{"news_link":"https:\/\/www.livemint.com\/companies\/news\/adanis-detailed-hindenburg-reply-now-said-to-be-post-share-sale-11674925741992.html","pub_date":"2023-01-28T22:52:59+05:30","title":"Adani’s detailed Hindenburg reply now said to be post-share sale","keywords":"Gautam Adani,Hidenburg report","articles":"The group has prepared a response of more than 100 pages and and is also seeking legal advice on when to release it, one of the people said, asking not to be identified because the information is private       Adani Group will release a detailed response to allegations made by US short seller Hindenburg Research only after the completion of a new share sale that’s set to conclude on Jan. 31, according to people familiar with the matter.    The conglomerate owned by Asia’s richest person Gautam Adani had said it would give a detailed rebuttal on Friday, according to bondholders who participated in a conference call with Adani executives. While it had answered some questions, the longer reply did not materialize as expected.    The group has prepared a response of more than 100 pages and and is also seeking legal advice on when to release it, one of the people said, asking not to be identified because the information is private. While it won’t be before Jan. 31, the people did not specify when the reply would come.    A representative for the conglomerate declined to comment.    Hindenburg released its report just days before the billionaire’s flagship firm Adani Enterprises Ltd. launched India’s biggest ever primary follow-on public offering that’s seeking to raise 200 billion rupees ($2.5 billion). It was meant to fund capital expenditures and to pay down the debt of its various units.     Hindenburg alleged that its two-year investigation found the Adani Group “engaged in a brazen stock manipulation and accounting fraud scheme over the course of decades\" and called out the conglomerate’s “substantial debt.\" The firm said it’s shorting Adani Group through US traded bonds and non-Indian-traded derivatives, and that its report “relates solely to the valuation of securities traded outside of India.\"      The group lost more than $50 billion in market value in two sessions, costing Adani himself in excess of $20 billion, or about one-fifth of his total fortune, according to the Bloomberg Billionaires Index.      Adani Group said Thursday that it was exploring legal action against the research firm, calling Hindenburg’s report “maliciously mischievous,\" “bogus\" and “unresearched.\"   Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/ntpcs-q3-net-profit-rises-nearly-5-11674914461234.html","pub_date":"2023-01-28T19:36:45+05:30","title":"NTPC’s Q3 net profit rises nearly 5%","keywords":"NTPC,NTPC results,NTPC profit,country's largest power generator,NTPC coal stations","articles":"Its revenue from operations increased 34% to  ₹44,601.84 crore during the period under review       State-run NTPC on Saturday on reported a 4.9% increase in its consolidated net profit for the quarter ended December at  ₹4,854.36 crore. During the same quarter of last fiscal (FY22), the company had registered a net profit of  ₹4,626.11 crore.    Its revenue from operations increased 34% to  ₹44,601.84 crore during the period under review, from  ₹33,292.61 crore in Q3 of FY22.    The Country’s largest power generator- NTPC Ltd., with a present group installed capacity of 71544 MW, declared unaudited financial results for Q3\/9M FY23 on 28 January 2023.    The NTPC group generated 295 billion units in the first nine months of FY23 as compared to 265 billion units in 9M FY22, an increase of 11%. NTPC’s standalone gross generation in 9M FY23 is 255 billion units as compared to 227 billion units in the corresponding previous period, registering an increase of 12%.  NTPC coal stations achieved a plant load factor of 74.45% as against the national average of 63.27% during 9M FY23.    On standalone basis, total income of NTPC during April-December is  ₹124,685.49 crore as against corresponding previous period total income of  ₹89,314.50 crore, registering an increase of 39.60%.    On consolidated basis, total income of the group for the nine months of FY23 was  ₹133,231.43 crore as against corresponding previous period total income of  ₹97,269.89 crore, registering an increase of 36.97%.    The Board of Directors has approved interim dividend for FY23 at 42.50% of paid-up share capital i.e.  ₹4.25 per equity share of face value of  ₹10 each. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/kajaria-ceramics-announces-rs-6-per-share-dividend-pat-drops-39-in-q3-11674913973777.html","pub_date":"2023-01-28T19:28:12+05:30","title":"Kajaria Ceramics announces  ₹6 per share dividend, PAT drops 39% in Q3","keywords":"kajaria ceramics,kajaria ceramics final dividend,kajaria ceramics market cap,kajaria ceramics share price,kajaria ceramics dividend payment date","articles":"With a market valuation of  ₹17,472.59 Cr, Kajaria Ceramics is a mid-size company that operates in the consumer discretionary industry.       With a market valuation of  ₹17,472.59 Cr, Kajaria Ceramics is a mid-size company that operates in the consumer discretionary industry. The largest producer of ceramic and vitrified tiles in India is Kajaria. Its eight plants—Sikandrabad in Uttar Pradesh, Gailpur and Malootana in Rajasthan, Vijayawada and Srikalahasti in Andhra Pradesh, Balanagar in Telangana, and two plants in Gujarat—have an annual aggregate capacity of 84.45 million square metres. The company has declared its Q3 results and also a dividend for the financial year 2022-23.    The company said in a stock exchange filing that its Board of Directors has declared “An Interim Dividend of Rs. 6 per share of Re. 1 each for the financial year 2022-23 and Wednesday, February 8, 2023 as the ‘Record Date’ for determining entitlement of members of the Company to the aforesaid Interim Dividend. The payment of the said Interim Dividend will be made on\/before February 26, 2023.\"    The board of Kajaria Ceramics has also granted the go-ahead for an additional acquisition of up to 11,40,968 equity shares worth  ₹10 each of Kajaria Vitrified (KVPL), a subsidiary firm, for a total cash payment of  ₹1,80,04,475. The company's equity stake in KVPL now stands at 87.37%, and once the planned acquisition is completed, it will climb to 95%.    Kajaria Ceramics also said in a stock exchange filing that its Board has “Approved the modernisation of the manufacturing facility at Gailpur (Rajasthan) for Ceramic Tiles by replacing the existing Kilns with latest model of Kilns having capacity for production of bigger size of ceramic tiles including other latest equipment, as may be required. The said modernisation will involve Rs. 51.11 crores and is expected to be completed by July 2023. The said modernisation will further benefit to the Company by way of saving in cost\/energy as well as improved quality including bigger size of ceramic tiles.\"    Kajaria Ceramics' board has also approved divesting the entire Kajaria’s stake i.e. 1,22,40,000 equity shares of Rs. 10 each in Vennar Ceramics Limited, a subsidiary company in a phased manner, at a consideration of Rs. 18.25 crores. The expected date of completion of sale\/disposal is upto March 31, 2024.    On a consolidated basis, Kajaria Ceramics' net profit dropped 39.09% YoY to  ₹74.32 crore in Q3FY23 as against  ₹122.02 crore recorded in Q3FY22. The revenue from operations for the quarter that ended on December 31, 2022, was  ₹1,091.13 crore, a growth of 2.14% from the  ₹1,068.23 crore recorded for the same period of the previous year. Profit before tax (PBT) decreased by 37.75 per cent to  ₹99.71 crore in the third quarter of FY23 from  ₹160.18 crore in the third quarter of FY22. From  ₹183.84 crore in Q3 FY22 to  ₹133.07 crore in Q3 FY23, EBITDA plummeted by 28% YoY.    Commenting on the Q3 performance, Shri Ashok Kajaria, Chairman & Managing Director said “This quarter has been challenging in terms of performance. The overall volumes were impacted by the prolonged monsoon season and the festive period in the month of October 2022. However, there has been some recovery in demand during November and December, indicating a positive trend going forward. The consolidated revenue for the quarter stood at  ₹1091 crores, compared to  ₹1068 crores from the corresponding period of the previous year, representing a 2% growth.\"    He further added that “The EBITDA margin for Q3FY23 was 12.20%, a decline of 500 basis points compared to the same period in the previous year. The primary cause of this decline was disruption in natural gas supply and an unprecedented increase in gas prices. However, fuel cost has started to come down since December 2022, primarily due to the increased use of alternative fuels and some fall in gas prices. The full impact of these changes is expected to be visible by March 2023.\"    “Overall, the company has seen decent growth in the first nine months, with a 12% increase in volume and a 22% increase in revenue. The company is dedicated to its growth strategy, which includes expanding market share and increasing the number of dealers across India, particularly in unrepresented territories. The company is confident that its strong foundation and commitment to excellence will continue to drive its success in the upcoming quarters, both in terms of sales and profitability,\" said Shri Ashok Kajaria.    On Friday, the shares of Kajaria Ceramics closed on the NSE at  ₹1,098.65 apiece level, up by 4.77% from the previous close of  ₹1,048.65. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/samsung-opens-its-largest-experience-store-in-delhi-11674911367275.html","pub_date":"2023-01-28T18:42:47+05:30","title":"Samsung opens its largest experience store in Delhi","keywords":"Samsung,Delhi,Samsung experience store,Bengaluru,Samsung Opera House,Connaught Place.,news,top news","articles":"The new experience centre comes after Samsung recently revamped the Samsung Opera House in Bengaluru by bringing in new technology experiences       Consumer electronics company Samsung India on Saturday inaugurated its largest experience store in North India in New Delhi’s Connaught Place.    The new experience store showcases Samsung’s complete product ecosystem through different zones such as connected living, smartphones, audio, gaming, lifestyle screens and wearables, among others, showcasing its multi-device connectivity with smart-things.    The new experience centre comes after Samsung recently revamped the Samsung Opera House in Bengaluru by bringing in new technology experiences.    “We are excited to open a new Samsung experience store at Connaught Place in Delhi, an iconic location teeming with energy, diverse culture and rich heritage. This is the largest Samsung experience store in North India offering the widest portfolio of Samsung devices. With this new store, our goal is to provide every consumer, especially Gen Z and millennials, the best of Samsung products and experiences such as Connected Living, Gaming and Lifestyle Screens,\" said Sumit Walia, Senior Director, Samsung India.    “This new store will also offer a one of its kind phygital experience through Store+, further enhancing the shopping experience and choices for our young consumers,\" he said.    Spread over two floors, across 3,500 sq ft of space, the store will also host a variety of engaging events for consumers such as Galaxy workshops, live commerce activities and cultural performances. The store also offers a fully functional customer service center.  Samsung is among the top consumer electronics companies--it sells TVs, smartphones, wearable devices, tablets, digital appliances, network systems and memory, system LSI, foundry and LED solutions. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/vineeta-singh-shares-photos-of-her-2-favourite-sharks-guess-who-they-are-11674909109116.html","pub_date":"2023-01-28T18:40:39+05:30","title":"Vineeta Singh shares photos of her 2 favourite ‘sharks’. Guess who they are?","keywords":"Vineeta Singh,Shark Tank India,Vineeta Singh favourite sharks,Shark Tank India season 2,Sugar","articles":"In one of the two photos, Singh, CEO of Sugar Cosmetics, is seen hugging her sons at the set of the show       As Shark Tank India season 2 has started picking the pace, one of the judges Vineeta Singh shared pictures of her two favourite sharks on the set and though it is quite a surprise, the photos will definitely bring a big smile to your face.    In one of the two photos, Singh, CEO of Sugar Cosmetics, is seen hugging her sons at the set of the show. In the other one, she is seen wearing a shark ring on her little finger. She posted the picture captioning them as “My 2 favouritest @sharktank.india fans in the world.\" A post shared by Vineeta Singh (@vineetasng)    The pictures that were posted about 3 hours ago have received close to 19,000 like and several wonderful comments.    “If mommy is a shark then the kids of course are \"Baby Shark\",\" joked an Instagram user. “Lovely pic,\" expressed another. “Cute,\" shared a third. “You people are doing a wonderful job by motivating Indian youths to scale their capabilities,\" wrote a fourth. Many showed their reactions through heart emoticons.    The show is based on the popular concept of the show of the same name - Shark Tank USA. It launched its first season in December last year.    'Shark Tank India 2' is judged by Anupam Mittal (Founder and CEO of Shaadi.com - People Group), Aman Gupta (Co-Founder and CMO of boAt), Peyush Bansal (Founder and CEO of Lenskart.com), Namita Thapar (Executive Director of Emcure Pharmaceuticals), Vineeta Singh (Co-Founder and CEO of SUGAR Cosmetics), and Amit Jain (CEO and Co-founder of CarDekho Group and InsuranceDekho.com) Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/coal-india-subsidiary-constructs-eco-park-coal-museum-in-odisha-11674902947021.html","pub_date":"2023-01-28T16:19:06+05:30","title":"Coal India subsidiary constructs eco-park, coal museum in Odisha","keywords":"Coal India,Mahanadi Coalfields,coal museum,mining practices","articles":"The Coal Museum inside the park is tells the history and legacy of coal mining in India. Working models of different machines and vehicles used in under ground and open cast mines are on display       NEW DELHI: Coal India subsidiary Mahanadi Coalfields Ltd (MCL) has constructed an eco-park and coal museum at Orient Area in Ib Valley Coalfields, Jharsuguda, Odisha, as part of its larger plan to evolve environment friendly and sustainable mining practices.    The CPSE under the ministry of coal is striving to raise country’s coal production along with adoption cleaner and greater mining practises.     The Chandra Shekar Azad eco-park has been set up at Gandghora village on the side of Jharsuguda-Raigarh National Highway 49. The park comes with lush green landscape and has a coal café and a children’s park. The initiative was constructed by MCL after repurposing coal mine No.4 that closed production in 2017.     The foundation stone for the park was laid in 2021. The park also provides opportunity to have first-hand experience of an underground mine to the visitors.    The Coal Museum inside the park is tells the history and legacy of coal mining in India. Working models of different machines and vehicles used in under ground and open cast mines are on display. Coal mining equipment\/machines on display include surface miner, dumper, crane, tipper, dozer, belt conveyor, coal cutting machine, drill machine and backhoe to name a few.    Engaged in coal mining activities in Sundergarh, Jharsuguda and Angul districts of Odisha, MCL has backfilled and reclaimed at least 2000 hectares of completely utilised land so far. Many quarry voids have been developed into water bodies for rain water harvesting, in line with sustainable mining practices. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/airtel-5g-plus-now-available-in-7-jammu-kashmir-cities-all-details-11674902177317.html","pub_date":"2023-01-28T16:15:10+05:30","title":"Airtel 5G Plus now available in 7 Jammu &amp; Kashmir cities: All details","keywords":"airtel,bharti airtel","articles":"Airtel has announced the launch of its 5G services in Samba, Kathua, Udhampur, Akhnoor, Kupwara, Lakhanpur and Khour. Airtel’s 5G services already live in the cities of Jammu and Kashmir.       Bharti Airtel (“Airtel\"), a telecommunications services provider, has announced the launch of its 5G services in Samba, Kathua, Udhampur, Akhnoor, Kupwara, Lakhanpur and Khour. Airtel’s 5G services already live in the cities of Jammu and Kashmir.  Airtel 5G Plus services will be available to customers in a phased manner as the company continues to construct its network and complete the roll out. Customers with 5G enabled devices will be able to get access to Airtel 5G Plus network at no extra cost until the roll out is more widespread.    The company says that it will augment its network in due course of time, making its services available across many other locations in these cities.    Commenting on the launch, Adarsh Verma, COO, Bharti Airtel, Jammu, Kashmir and Ladakh said, “Connectivity to our customers in the Valley is in line with our commitment to bridge the digital divide and connect communities who need it the most. I am thrilled to announce the launch of Airtel 5G Plus in Samba, Kathua, Udhampur, Akhnoor, Kupwara, Lakhanpur and Khour. Customers in these cities can now experience ultrafast network and enjoy speeds upto 20-30 times faster than the current 4G speeds. We are in the process of lighting up the entire Union territory which will allow customers to enjoy superfast access to High-definition video streaming, gaming, multiple chatting, instant uploading of photos and more.\"    To recall, the telco recently announced the launch of its 5G services in Bhubaneswar, Cuttack and Rourkela of Odisha.    The company said it has deployed the 5G services at the Kalinga and Birsa Munda stadiums in Bhubaneswar and Rourkela, respectively, which are hosting the forthcoming Men's Hockey World Cup.    Airtel 5G Plus services will be available to customers in a phased manner as the company continues to construct its network and complete the roll-out. Customers with the fifth-generation mobile system (5G)-enabled devices will be able to access the Airtel 5G Plus network at no extra cost until the roll-out is more widespread, according to the statement released.    Soumendra Sahu, Chief Operating Officer - Odisha, Bharti Airtel, said, \"We are thrilled to power the two stadiums hosting the men's hockey world cup. While at the stadium, customers can experience a superfast network that will allow them high-definition video streaming, multiple chatting, instant uploading of photos and videos and more.\" Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/ntpc-s-consolidated-pat-rises-over-43-sequentially-to-rs-4-777-cr-in-q3-declares-dividend-11674901132817.html","pub_date":"2023-01-28T15:51:21+05:30","title":"NTPC's consolidated PAT rises over 43% sequentially to  ₹4,777 cr in Q3, declares dividend","keywords":"NTPC Q3 results,NTPC interim dividend,NTPC Q3","articles":"The PAT has climbed by 6.18% from  ₹4498.58 crore in Q3FY22, but posted a huge growth of 43.07% from the profit of  ₹3338.45 crore witnessed in Q2 of FY23.       India's largest energy conglomerate, NTPC garnered a consolidated net profit of  ₹4776.61 crore attributable to owners in the third quarter of FY23. The PAT has climbed by 6.18% from  ₹4498.58 crore in Q3FY22, but posted a huge growth of 43.07% from the profit of  ₹3338.45 crore witnessed in Q2 of FY23. The company has also declared a dividend of 42.50% for the current fiscal.    However, profits including non-controlling interests, came in at  ₹4854.36 crore on a consolidated basis in Q3 of FY23, registering a growth of 5% QoQ and 42% YoY.    Consolidated revenue from operations stood at  ₹44,601.84 crore in Q3FY23 --- rising by 33.96% from  ₹33,292.61 crore a year ago same period --- but marginally up from  ₹44,175.03 crore revenue recorded in September 2022 quarter.    As of December 31, 2022, NTPC's group installed capacity rose by 3,127 MW year-on-year to 70,884 MW, while its commercial capacity jumped by 2,256 MW YoY to 58,269 MW.    Further, NTPC's gross generation climbed by 2.972 BUs in Q3 to 78.646 BUs. Also, commercial generation and energy sent out grew by 3.052 BUs and 2.445 BUs YoY to 78.626 BUs and 72,870 BUs respectively.    The company's coal produced from captive mines-commercial stood at 5.35 MMT in Q3FY23 --- higher than 4 MMT in Q3 of the previous fiscal.    However, the total coal supply was at 54.02 MMT in Q3 -- contracting by 1.46 MMT from 55.48 MMT a year ago same period. This was due to a decline in domestic coal supply which was around 52.45 MMT in Q3FY23 versus 54.96 MMT in Q3FY22. The company imported coal to the tune of 1.57 MMT in Q3FY23.    Gas consumptions stood at 1.13 MMSCMD in Q3FY23, lower than 1.41 MMSCMD in Q3 of FY22.    In regards to plant availability factor (DC), coal stood at 92.67% by end of the December 2022 quarter, while gas and hydro section stood at 98.53% and 110.13% respectively.    The average tariff for nine months period of FY23 rose to  ₹4.96 versus  ₹3.95 in the corresponding period a year ago.    In a meeting held on Saturday, NTPC's board of directors decided to pay an interim dividend at the rate of 42.50% amounting to  ₹4.25 per share on the face value of paid-up equity shares of  ₹10 each for the financial year 2022-23. The company has fixed February 4th as the record date to determine eligible shareholders for the said interim dividend. Thereby, NTPC shares will turn ex-dividend on February 3rd. The payment date is set on February 24.    On BSE, NTPC shares closed at  ₹166.30 apiece broadly flat on Friday compared to the previous session. Its market cap is over  ₹1.61 lakh crore. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/myths-of-short-seller-adani-gives-point-by-point-reply-to-hindenberg-s-allegations-11674896811503.html","pub_date":"2023-01-28T15:01:12+05:30","title":"'Myths of short seller': Adani gives point by point reply to Hindenberg's allegations","keywords":"adani stocks,adani fpo,adani hindenburg's accusations,adani vs Hindenburg,adani replies Hindenburg report,adani gives clarity on hindenburg report,adani port share price,adani enterprises share price,adani total gas share price,adani green energy share price,adani transmission share price,adani power share price,gautam adani,adani wilmar share price,adani stocks selloff,gautam adani allegations,adani group hindenburg allegations,adani on hindenburg's report","articles":"The  ₹20,000 crore worth FPO received dull demand on Day 1.Adani stocks have hit lower circuits and some of them even witnessing a double-digit decline.Hindenburg Research's report accused Adani of stock manipulation and fraud schemes.       The timing could not have been worse for Gautam Adani's  ₹20,000 crore follow-on public offer (FPO) which came at a time when investors were offloading their positions in the group's seven listed stocks extensively. It was a bloodbath on Friday, with Adani stocks hitting lower circuits and some of them even witnessing a double-digit decline. The reason behind the free fall in Adani stocks would be Hindenburg Research's allegations over the Group. However, Adani has fought back by giving a much clear picture of its business portfolio.    On Friday, Adani Transmission, Adani Green Energy, and Adani Total Gas closed at 20% lower circuits each. While Adani Power and Adani Wilmar hit 5% lower circuits each. Adani Ports wasn't performing any better and tumbled by over 16% at the end of the day.    Meanwhile, Adani's flagship company, Adani Enterprises, which launched its FPO on Friday, nosedived by around 20% before closing at  ₹2,762.15 apiece on BSE.    The first day of the FPO saw muted demand across investors.    Under the  ₹20,000 crore worth FPO, on Friday, only 4,70,160 equity shares were bid against the offered size of 4,55,06,791 equity shares. The price band for the FPO is set from  ₹3,112 to  ₹3,276 per FPO equity share for all categories of investors.    If Adani's FPO is fully subscribed, then this will become the second largest follow-on public offer in India after Coal India's  ₹22,558 crore issue in 2015. Earlier in 2020, Yes Bank had launched a  ₹15,000 crore FPO.    But circumstances changed drastically a few days before Adani's FPO and it would be Hindenburg Research's report under which it accused Adani of stock manipulation and fraud schemes.    In its report on January 24, the New York-based investment research firm said, \"we reveal the findings of our 2-year investigation, presenting evidence that the  ₹17.8 trillion ($218 billion) Indian conglomerate Adani Group has engaged in a brazen stock manipulation and accounting fraud scheme over the course of decades.\"    Hindenburg's report indicated that Gautam Adani, Founder, and Chairman of the Adani Group, has amassed a net worth of roughly $120 billion, adding over $100 billion in the past 3 years largely through stock price appreciation in the group’s 7 key listed companies, which have spiked an average of 819% in that period.    The findings of Hindenburg's research report on Adani involved interactions with dozens of individuals, including former senior executives of Adani and also reviewing thousands of documents, and conducting diligence site visits in almost half a dozen countries.    Also, the research said, even \"if you ignore the findings of our investigation and take the financials of Adani Group at face value, its 7 key listed companies have 85% downside purely on a fundamental basis owing to sky-high valuations.\"    Adani companies' debt was also among the key factors that Hindenburg pointed out.     It said, key listed Adani companies have also taken on substantial debt, including pledging shares of their inflated stock for loans, putting the entire group on precarious financial footing. 5 of 7 key listed companies have reported ‘current ratios’ below 1, indicating near-term liquidity pressure.    Hindenburg's research note came as a shock and Adani stocks went into frenzied selling.    Although, Adani has denied Hindenburg's accusations.    On January 27th, Adani Enterprises filed a presentation covering Adani Group’s response to Hindenburg Report. It was titled \"Myths of Short Seller\".    Hindenburg is the short seller.     According to Adani's presentation, Hindenburg asked 89 questions in total. While some of these questions are in regards to the group's related party transactions, DRI (Directorate of Revenue Intelligence), and court cases. However, there are 21 questions in total that cannot be claimed to be the result of any investigation over a 2-year period or any such assertion as they were disclosed in public documents all the way back from 2015 onwards.    Further, Adani said, 8 of 9 listed companies have a big 6 auditor such as Deloitte Haskins & Sells, SRBC & Co. (EY), SRBC & Co. (EY) & Dharmesh Parikh & Co. (Joint Auditors), Shah Dhandharia & Co., Ernst & Young, PKF, Walker Chandiok & Co. and K S Rao & Co., etc.    Moreover, on the leverage issue, Adani mentioned 100 of its various companies are rated ( these account for nearly 100% of its EBITDA). Also, in regards to revenue or balance sheet being artificially inflated or managed, it said, out of 9 listed companies in Adani portfolio — 6 are subject to specific sector regulatory review for revenue, costs, and capex.    Meanwhile, in terms of governance, 4 of Adani's large companies are in the top 7% of the peer group in Emerging markets or the sector or the world. On LAS position, Adani said, overall promoter leverage is less than 4% of promoter holding.    Earlier, on January 25, Jugeshinder Singh, Group CFO, Adani said, \"We are shocked that Hindenburg Research has published a report on 24 January 2023 without making any attempt to contact us or verify the factual matrix. The report is a malicious combination of selective misinformation and stale, baseless, and discredited allegations that have been tested and rejected by India’s highest courts.\"    \"The timing of the report’s publication clearly betrays a brazen, mala fide intention to undermine the Adani Group’s reputation with the principal objective of damaging the upcoming Follow-on Public Offering from Adani Enterprises, the biggest FPO ever in India,\" Singh added.    Also, on January 26, Jatin Jalundhwala, Group Head - Legal, Adani said, \"the maliciously mischievous, unresearched report published by Hindenburg Research on 24 Jan 2023 has adversely affected the Adani Group, our shareholders, and investors. The volatility in Indian stock markets created by the report is of great concern and has led to unwanted anguish for Indian citizens.\"    Nevertheless, the panic selloffs in these seven stocks have led to a massive correction in Gautam Adani's net worth. Asia's richest man's wealth is to the tune of $92.7 billion as of January 28. As per Bloomberg Billionaire Index, Adani's net worth has dropped by $20.8 billion at the latest. However, year-to-date, Adani's wealth has dipped by $27.9 billion.      Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/chevron-annual-profit-hits-record-but-q4-miss-hits-shares-11674886108988.html","pub_date":"2023-01-28T12:04:15+05:30","title":"Chevron annual profit hits record but Q4 miss hits shares","keywords":"chevron,chevon shares,chevron annual profit,white house,oil,refinery","articles":"US Oil producer Chevron Corp on Friday posted a record $36.5 billion profit for 2022 that was more than double year-earlier earnings       Chevron Corp on Friday posted a record $36.5 billion profit for 2022 that was more than double year-earlier earnings, but the bottom line fell shy of Wall Street estimates, undercut by asset writedowns and rising costs.    The second largest US oil producer's adjusted net profit for 2022 exceeded its previous record set in 2011 by about $10 billion. Still, higher expenses and weaker oil and fuel profits left fourth-quarter earnings 6.6% below Wall Street's forecast, according to Refinitiv data.    Chevron shares were down 3.9%.    Its results kick off what promises to be nosebleed level earnings for global energy suppliers. High prices from strong demand and shortages since Russia's invasion of Ukraine position Western energy firms to show a combined $200 billion profit for the year, according to analysts.    This season's earnings have already put energy stocks at the top of industry returns as more companies lift their payouts to shareholders. The record shareholder payouts could stir fresh calls for windfall taxes.    \"We made progress winning back investors to energy and 2022. We still have a long way to go,\" finance chief Pierre Breber told Reuters in an interview.    The industry has potential to significantly increase its participation in the S&P index, even with modest production growth.    The White House on Wednesday protested Chevron's decision to triple its spending on share repurchases, now at $75 billion over five years at current guidance. The Biden administration wants companies to lower prices for consumers.    \"The billions that Chevron earned in 2022 will seem like a slap in the face\" for Americans struggling to repair damages after floods earlier this month, said Jonathan Noronha-Gant, an environmental campaigner at Global Witness.  SHAREHOLDER PAYOUTS    Shareholder rewards will continue to be the top priority for cash, Chevron officials said.    \"We can do it all,\" Breber said. After providing for shareholder dividends, Chevron will allocate cash to production and repaying debt, with share buybacks a fourth priority.    \"I'm going to keep doing what we have been doing, year in and year out,\" he said.    Despite the furor over the buyback target, Chevron's spending on its own shares will be \"unchanged at $5 billion to $15 billion per year\", Breber said.    \"The $75 billion can be thought of as five years at the current buyback rates,\" he said.    Chevron last year paid out $26 billion via dividends and buybacks to shareholders and invested $15.7 billion in operations.    This year, it will increase project expenditure to $17 billion, with two-thirds of outlays in the United States, where oil and gas output was up 4% over 2021.    It left global oil and gas production guidance for this year at flat to up 3%.  FOURTH-QUARTER MISS    In the final quarter, Chevron posted adjusted earnings of $7.9 billion, or $4.09 per share, below analysts' estimate of a $4.38 per share profit.    \"The miss was primarily driven by higher corporate costs, with both the upstream and downstream coming in a touch below market expectations,\" said Biraj Borkhataria, European research director at RBC Capital.    Oil and gas production was down for the year, led by a 7% decline in international output due to the end of concessions in Thailand and Indonesia.    But Chevron has been shifting its focus for new investments and targeting production in the United States. U.S. production hit a record last year, led by a 16% increase in Permian, the country's main shale basin.    Its refining business picked up and almost tripled results from the previous year as international fuel production delivered stronger margins. Refined product sales were up 7%, led by higher renewable fuel sales and jet demand. This story has been published from a wire agency feed without modifications to the text. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/lvmhs-shares-wobble-after-china-takes-margin-toll-11674886094939.html","pub_date":"2023-01-28T11:57:22+05:30","title":"LVMH's shares wobble after China takes margin toll","keywords":"lvmh shares,lvmh,jean jacques guiony,dior,louis vuitton","articles":"LVMH shares wobbled briefly on Friday with disappointment over the impact of China disruption on the company's margins       A record-breaking run in the shares of French luxury goods group LVMH halted briefly on Friday after the company's fourth quarter sales update prompted some disappointment over the impact of China disruption on its margins.    The company, which owns dozens of high-end labels including fashion houses Louis Vuitton and Dior, late on Thursday reported that its sales rose 9% in the fourth quarter as shoppers in Europe and the United States splurged over the holiday season, helping partly to offset COVID-19 disruptions in China.    But some analysts focused on the margins, taking some of the shine off the fourth-quarter sales boost.    \"The slight wrinkle is on the margin, where the group delivered a flat operating margin year-on-year (versus consensus of +90 bps) – largely a reflection of maintaining\/raising H2 marketing spend despite disrupted revenue growth,\" Credit Suisse analysts wrote in a note.    The shares fell initially on Friday but were up about 0.6% by 0956 GMT.    LVMH chief financial officer Jean Jacques Guiony said on Thursday the company had decided to maintain marketing investments in the second half at a level of 30% higher than the previous year despite lower revenue growth, but had not expected such a sharp decline in business in China in December.    High profile marketing events included Dior's takeover of London department store Harrods over the holidays as well as a fashion show in Egypt, with the pyramids serving as a backdrop.    Guiony also said that LVMH's strategy of curbing parallel channels for its perfumes and cosmetics division was \"a costly decision\" that drove down profitability, but that it was \"the right decision\" and would protect the appeal of its labels.    Parallel channels are where retailers sell branded products at a discount.    Guiony said that over the past two years, rivals had been shipping large quantities of perfumes and cosmetics to China where they were being sold at a discount.    \"We think that, to preserve capital, this is not a good idea -- so we don't do this,\" he said.    The division's profit from recurring operations came to 660 million euros ($718.61 million) for the year, a fall of 3%.    Rogerio Fujimori, analyst with Stifel, said the reasons for the margin miss were \"net positive\" for the coming year, as the step-up in marketing spending should translate into stronger top line growth while the sales shortfall in China should be recovered.    The luxury industry took a hit in China at the end of the year due to lockdowns, followed by a surge in infections when they were lifted. Now, the luxury industry is expected to be one of the biggest winners from the loosening of restrictions that kept shoppers out of stores in China for months. ($1 = 0.9184 euros) This story has been published from a wire agency feed without modifications to the text. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/gm-ford-must-convince-investors-they-can-profit-as-prices-fall-11674886070751.html","pub_date":"2023-01-28T11:49:10+05:30","title":"GM, Ford must convince investors they can profit as prices fall","keywords":"ford profit,general motor profit,ford investment news,general motors news","articles":"General Motors Co and Ford Motor Co will have to convince investors that last year's profit formula can keep working when costs for EV batteries are rising       General Motors Co and Ford Motor Co are expected to report strong profits for 2022 next week, powered by premium-priced pickup trucks and sports utility vehicles (SUVs).    Now, the Detroit rivals must convince investors that last year's profit formula can keep working when costs for EV batteries are rising, high interest rates are cutting consumer purchasing power, and Tesla Inc is slashing prices.    Already there are signs the Detroit automakers are scaling back spending to offset competitive and economic pressure. GM has shelved for now plans to build a fourth EV battery plant in North America.    Ford is in talks with German unions to cut thousands of jobs in its European operations and possibly sell a German vehicle assembly plant. In October, it stopped funding autonomous vehicle affiliate Argo AI.    GM and Ford both rely on sales of pickup trucks and SUVs in the United States for the bulk of their global profits. This year, both automakers plan to ramp up sales of much less profitable electric vehicles in North America and other markets.    The risk to the Detroit automakers' profitability would be a challenge in the best of times. But now, GM and Ford must factor in forecasts for a slowdown, or even a recession, in the U.S. economy.    EV battery raw material costs are rising, but U.S. EV market leader Tesla is cutting prices on its best-selling Model 3 and Model Y vehicles by as much as 20%.    The Model Y SUV competes with Ford's Mustang Mach-E, GM's Cadillac Lyriq EV, and with combustion SUVs the Detroit automakers sell.    Morgan Stanley estimated increased prices added an average of $3 billion a year to Ford's pre-tax bottom line and was the equivalent of more than 200% of the improvement in the company's pre-tax profits for 2022.    GM, the No. 1 U.S. automaker by sales in 2022, said higher prices added $2.1 billion to pre-tax profits in the third quarter compared to the same quarter in 2021 - equivalent to nearly half of pre-tax profits for the period overall.    The company has told investors it will spend $35 billion on electric and automated vehicles between 2020 and 2025. Ford has put its planned EV investments at $50 billion through 2026.    \"If we are entering a downturn,\" Morgan Stanley analyst Adam Jonas said, \"what steps can they take to keep investing and remain strong?\"  This story has been published from a wire agency feed without modifications to the text. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/intels-historic-collapse-erases-8-billion-from-market-value-11674884491226.html","pub_date":"2023-01-28T11:43:38+05:30","title":"Intel's 'historic collapse' erases $8 billion from market value","keywords":"intel,intel share,intel share pric,intel collapse,intel news,intel chipset,intel shares today","articles":"Intel saw around $8 Billion of its market value wiped off with company's shares closing 6.4% lower on Friday       Intel Corp saw about $8 billion wiped off its market value on Friday after the US chipmaker stumped Wall Street with dismal earnings projections, fanning fears around a slump in the personal-computer market.    The company predicted a surprise loss for the first quarter and its revenue forecast was $3 billion below estimates as it also struggled with slowing growth in the data center business.    Intel shares closed 6.4% lower, while rival Advanced Micro Devices and Nvidia ended the session up 0.3% and 2.8%, respectively. Intel supplier KLA Corp settled 6.9% lower after its dismal forecast.    \"No words can portray or explain the historic collapse of Intel,\" said Rosenblatt Securities' Hans Mosesmann, who was among the 21 analysts to cut their price targets on the stock.    The poor outlook underscored the challenges facing Chief Executive Pat Gelsinger as he tries to reestablish Intel's dominance of the sector by expanding contract manufacturing and building new factories in the United States and Europe.    The company has been steadily losing market share to rivals like AMD, which has used contract chipmakers such as Taiwan-based TSMC to make chips that outpace Intel's technology.    \"AMD's Genoa and Bergamo (data center) chips have a strong price-performance advantage compared to Intel's Sapphire Rapids processors, which should drive further AMD share gains,\" said Matt Wegner, analyst at YipitData.    Analysts said that puts Intel at a disadvantage even when the data center market bottoms out, expected in the second half of 2022, as the company would have lost even more share by then.    \"It is now clear why Intel needs to cut so much cost as the company's original plans prove to be fantasy,\" brokerage Bernstein said.    \"The magnitude of the deterioration is stunning, and brings potential concern to the company's cash position over time.\"    Intel, which plans to cut $3 billion in costs this year, generated $7.7 billion in cash from operations in the fourth quarter and paid dividends of $1.5 billion.    With capital expenditure estimated to be around $20 billion in 2023, analysts said the company should consider cutting its dividend. This story has been published from a wire agency feed without modifications to the text. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/lic-sbi-savings-at-risk-amid-hindenburg-report-on-adani-here-s-what-banks-say-11674869457632.html","pub_date":"2023-01-28T08:08:39+05:30","title":"LIC, SBI savings at risk amid Hindenburg report on Adani? Here's what banks say","keywords":"adani,adani group exposure,hindenburg research,hindenburg research report,hindenburg research adani report,hindenburg research twitter,adani enterprises shares,lic,sbi","articles":"Congress general secretary Jairam Ramesh said that the high exposure of financial institutions such as the LIC and the SBI to the Adani Group has implications for financial stability       Adani Group shares have plunged massively for the past two consecutive days falling up to 20% and losing over  ₹4.17 lakh crore from the combined market valuation of listed firms after the US-based investment research firm Hindenburg Research accused the conglomerate and Asia's richest man of “brazen\" market manipulation and accounting fraud.    The 24 January Hindenburg's report details a web of Adani-family-controlled offshore shell entities in tax havens, from the Caribbean, Mauritius, and the United Arab Emirates. It claims these were used to facilitate corruption, money laundering, and taxpayer theft while siphoning money from the group’s listed companies.    Naturally, the Adani Group has denied the claims by Hindenburg and said the report is \"a malicious combination of selective misinformation and stale, baseless, and discredited allegations\".    Hindenburg said it had taken a short position in Adani’s companies through US-traded bonds and non-Indian-traded derivative instruments.    The Adani Group is now considering taking legal action against Hindenburg Research. “We are evaluating the relevant provisions under US and Indian laws for remedial and punitive action against Hindenburg,\" Adani group's legal head said in a statement.    On the other hand, market regulator Sebi has also increased scrutiny of deals by the Adani Group over the past year.    Meanwhile, a major concern has been raised regarding the exposure of LIC and SBI in Adani Group's stocks.    Congress general secretary Jairam Ramesh said that the high exposure of financial institutions such as the Life Insurance Company of India (LIC) and the State Bank of India (SBI) to the Adani Group has implications for financial stability and for the crores of Indians whose savings are stewarded by these pillars of the financial system.    The Congress leader claimed that \"As much as 8% of LIC's equity assets under management, amounting to a gigantic sum of  ₹74,000 crore, is in Adani companies and comprise its second-largest holding\".    Alleviating the concerns of lakhs of investors, SBI Chairman Dinesh Kumar Khara said, \"There is nothing alarming about our Adani exposure and we don't have any concerns as of now\".    He said that the Adani Group hadn't raised any funding from SBI in the recent past and that the bank would take a \"prudent call\" on any funding request from them in the near future.    Another SBI official told Reuters news agency, \"Our exposure to the Adani Group is below the large exposure framework of the Reserve Bank of India\".    The Union Bank of India was not seeing any stress from their exposure to the conglomerate either, an official at the bank said, also speaking on condition of anonymity as the matter was private.    According to Jefferies, the Adani Group's debt accounts for 0.5% of total loans across the Indian banking sector. For public sector banks, the debt is at 0.7% of total loans and for private banks, it is at 0.3%.  LIC shareholding in Adani Group stocks:4.23% in Adani Enterprises9.14% in Adani Ports3.65% in Adani Transmission1.28% in Adani Green5.96% in Adani Total Gas Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/boeing-to-hire-10-000-workers-in-2023-as-it-ramps-up-production-11674846739906.html","pub_date":"2023-01-28T00:55:02+05:30","title":"Boeing to hire 10,000 workers in 2023 as it ramps up production","keywords":"Boeing,production,boeing ramp up production,world opens after covid pandemic,boeing's plan of expansion,Airbus,US planemaker company","articles":"As the world reopens for travelling post covid,Boeing is planning to hire 10,000 workers in 2023 to ramp up its production       Boeing expects to hire 10,000 workers in 2023 as it recovers from the pandemic and increases jetliner production, but will trim some support jobs, the U.S. planemaker said Friday.    The Arlington, Virginia-based company boosted overall employment by about 14,000 workers in 2022 to 156,000 as of Dec. 31, up from about 142,000 in 2021. Boeing employs about 136,000 workers in the United States.  Also Read: Air India inches closer to seal half of jumbo plane order    Boeing acknowledged it will \"lower staffing within some support functions\" - a move meant to enable it to better align resources to support current products and technology development. It declined to comment on how many jobs it will cut in 2023.    Most of the growth will occur in Boeing's business units, as well as engineering and manufacturing, to meet airlines' growing demand.  Also Read: Boeing reports Q4 loss but reaffirms 2023 targets    The company plans to increase deliveries of the 737 MAX from 374 aircraft in 2022 to between 400 to 450 planes this year, with deliveries of the 787 expected to hit between 70 and 80 aircraft.    European rival Airbus said this week it plans to add 13,000 employees this year. About 7,000 of those jobs are set to be newly created positions, with about 9,000 of the new hires based in Europe.  Also Read: Air India’s mega jet deal with Airbus, Boeing held up by engine-cost debate    Boeing did not comment on how many net new jobs would created in the United States in 2023.    The U.S. planemaker is nearing pre-pandemic workforce levels, which stood at 161,000 people at the end of 2019. During 2020, the workforce fell to about 141,000 employees after Boeing announced job reductions.    \"Hiring is not a constraint anymore,\" Boeing Chief Executive Dave Calhoun told analysts Wednesday. \"People are able to hire the people they need. It's all about the training and ultimately getting them ready to do the sophisticated work that we demand.\" This story has been published from a wire agency feed without modifications to the text. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/air-india-increases-active-fleet-by-27-on-year-11674846560321.html","pub_date":"2023-01-28T00:39:19+05:30","title":"Air India increases active fleet by 27% on year","keywords":"Air India,fleet,Tata Group","articles":"With more capacity available, the airline has been able to increase average daily flights by 30% and weekly international flights by 63%.  NEW DELHI :      A year after being acquired by the Tata Group, the number of operating aircraft at Air India has increased 27% to 100, the airline said in an anniversary update.     With more capacity available, the airline has been able to increase average daily flights by 30% and weekly international flights by 63%.     The Tata Group acquired Air India and Air India Express under a government-led strategic divestment programme in January 2022.     Air India has 113 aircraft, comprising 70 narrow-body and 43 wide-body jets. In December, the airline said 19 long-grounded aircraft have returned to the skies and nine more were expected to follow.     In order to address the supply chain issues experienced by global aerospace companies, the company plans to induct 36 aircraft on lease in the first half of 2023 for short-to-medium-term capacity needs. These will comprise 21 Airbus A320, four Airbus A321, five Boeing B777-200LR widebody aircraft and six Boeing B777-300 ER jets.     In a speech to airline employees, Chief Executive Officer and Managing Director Campbell Wilson said the turnaround of Air India is “one of the most ambitious turnarounds in international aviation history.\" “More than our successes, it is how we respond to our lapses that will define us,\" Wilson said.     The airlines under the Air India umbrella are in the process of moving to a centralised work space in Gurugram by mid-2023. The group umbrella now includes budget carriers Air India Express, AirAsia and full-service carriers Air India and Vistara.    The airline is also finalising a historic order of new aircraft, Wilson said, adding that Air India will also shortly introduce an enhanced menu on its international routes.  Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/air-india-daily-flights-up-30-within-a-year-under-tata-11674844896859.html","pub_date":"2023-01-28T00:13:47+05:30","title":"Air India daily flights up 30% within a year under Tata","keywords":"Tata Group,Air India,Air India flight","articles":"With more capacity available, the airline has been able to increase average daily flights by 30% and weekly international flights by 63%.       A year after being acquired by the Tata Group, the number of operating aircraft at Air India has increased 27% to 100, the airline said in an anniversary update.    With more capacity available, the airline has been able to increase average daily flights by 30% and weekly international flights by 63%.    The Tata Group acquired Air India and Air India Express under a government-led strategic divestment programme in January 2022.    Air India has 113 aircraft, comprising 70 narrow-body and 43 wide-body jets. In December, the airline said 19 long-grounded aircraft have returned to the skies and nine more were expected to follow.    In order to address the supply chain issues experienced by global aerospace companies, the company plans to induct 36 aircraft on lease in the first half of 2023 for short-to-medium-term capacity needs. These will comprise 21 Airbus A320, four Airbus A321, five Boeing B777-200LR widebody aircraft and six Boeing B777-300 ER jets.    In a speech to airline employees, Chief Executive Officer and Managing Director Campbell Wilson said the turnaround of Air India is “one of the most ambitious turnarounds in international aviation history.\" “More than our successes, it is how we respond to our lapses that will define us,\" Wilson said. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/adani-stock-crash-wipes-out-3-19-trillion-investor-wealth-11674843129704.html","pub_date":"2023-01-27T23:44:07+05:30","title":"Adani stock crash wipes out  ₹3.19 trillion investor wealth","keywords":"Adani Group,Hindengurg Research,FPO,Nifty,Sensex","articles":"Mumbai\/New Delhi: Adani Group stocks fell 5-20% on Friday, wiping out  ₹3       Mumbai\/New Delhi: Adani Group stocks fell 5-20% on Friday, wiping out  ₹3.19 trillion in investor wealth after Hindenburg Research said it stood by its findings of alleged share price manipulation and accounting fraud by the conglomerate.     The rout in Adani shares also impacted stocks of state-owned and private lenders with an exposure to the group, fuelling the fall in the benchmark indices, Nifty and Sensex, to three-month lows.     The rout in Adani shares also impacted stocks of state-owned and private lenders with an exposure to the group, fuelling the fall in the benchmark indices, Nifty and Sensex, to three-month lows.     Adani Enterprises, the flagship of the Adani Group, dismissed the report as “unresearched\" and “maliciously mischievous,\" which seeks to undermine the “goodwill and reputation of the Adani group and its leaders and sabotage the FPO (follow-on public offering) from Adani Enterprises,\" a day after its release on Thursday.     However, six of the 10 Adani group stocks hit the lower circuits before recouping some losses on Friday, while four that don’t have price bands – Adani Enterprises, Adani Ports, Ambuja Cements and ACC – fell between 12% and 18%. The rout in Adani stocks helped rival Mukesh Ambani, chairman of Reliance Industries Ltd, reclaim the title of the richest Indian he ceded to billionaire Gautam Adani last year.     The fall in the Adani Group stocks saw investor wealth worth  ₹3.19 trillion get wiped off and took the two-day loss since the Hindenburg Research report surfaced on Wednesday to  ₹4.4 trillion. Adani Group stocks’ market value loss accounted for 47% of the overall  ₹6.98 trillion loss of investor wealth on Friday.     Adani Ports and Adani Enterprises, part of the Nifty, crashed by 15% and 18% each. Jittery investors also offloaded bank stocks such as State Bank of India, ICICI Bank and IndusInd Bank, which fell between 4% and 5%. The 18% fall in Adani Enterprises to  ₹2,768.50 apiece took it below the lower band of the FPO’s floor price of  ₹3,112.     The cascading effect on the bank stocks dragged down the benchmark indices. The Nifty plunged by 1.61% to 17,604.35, while the Sensex shed 1.45% to close at 59,330.90. The 12-constituent of Bank Nifty fell 3.13% to 4,0345.30.     Investors’ nervousness was reflected in the fear gauge, India Vix, surging 18% to 17.32.     The Adani Group released a presentation through its flagship Adani Enterprises to the stock exchanges after market closing on Friday, with its responses to Hindenburg’s questions.     It said that eight of the group’s listed companies were audited by the Big 6, including Deloitte Haskins & Sells and EY.     Earlier in the day, American billionaire and hedge fund manager Bill Ackman weighed in on the matter through a tweet wherein he described the Hindenburg report as “highly credible and extremely well researched.\"     Proxy advisory firm InGovern also weighed in on the issue stating, “Hindenburg, as a short seller, should be considered as just another participant who has a motivated view to release a negative report with the aim to bring down the stock price.\"     A Sebi official said that the regulator would wait for the clarification by the company to the exchanges before deciding the further course of action. The official declined to be identified.     Corporate houses with heavy leverage or expensive valuations were hit the most during this selloff on Friday, said Nishit Master, portfolio manager, Axis Securities.     Foreign portfolio investors’ (FIIs) cautious stance ahead of the Union Budget and US Federal Open Market Committee meetings also contributed to the collapse in the markets. FIIs sold shares worth a provisional  ₹5,977.86 crore, while domestic institutional investors purchased  ₹4,252.33 crore worth of stocks on Friday. FIIs have sold  ₹13,206 crore worth of equity till 25 January.     Amid the gloom, the one silver lining was India on Friday became the first country in the world to have a T+1 settlement cycle. The faster settlement cycle is expected to augur well for the Indian equity markets from a liquidity perspective, with settlements being made within 24 hours.     The shift will boost operational efficiency as the rolling of funds and stocks will be faster, said Ajay Menon, managing director and CEO of broking and distribution at Motilal Oswal Financial Services.     The same will help the investor in reducing the overall capital requirements with the margins getting released on T+1 day. Sellers will get funds in their bank accounts within 24 hours of the sale.  ujjval.j@livemint.com Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/swiss-watch-imports-touch-200-mn-as-indians-splurge-11674843243800.html","pub_date":"2023-01-27T23:44:03+05:30","title":"Swiss watch imports touch $200 mn as Indians splurge","keywords":"luxury watches,luxury,sports,hublot,tag heuer,zenith,bomberg,luxury time,ashok goel,nitin chainani,franck muller,rolex,luxury watches in india ","articles":"Imports have grown 19% over 2021. With this, India has surpassed countries such as Kuwait, Ireland, Bahrain, Belgium, Portugal, Greece, and Malaysia in luxury watch imports.       New Delhi: Demand for luxury watches in India has soared, with Swiss watch imports nearly doubling in 2022 from 2020, the Federation of the Swiss Watch Industry said.    Watch distributors in India imported luxury watches worth Swiss franc 187.6 million ($200 million) last year, rising from Swiss franc 97 million in 2020.     Imports have grown 19% over 2021. With this, India has surpassed countries such as Kuwait, Ireland, Bahrain, Belgium, Portugal, Greece, and Malaysia in luxury watch imports.    Despite the sharp increase, the waiting period for some of the most desirable watches, including Rolex and Patek Philippe, is still about six months. And while a lot of this demand is said to be fuelled by an artificial shortage being created by luxury brands themselves, several collectors accept that they never stopped buying luxury watches during the pandemic.    Ashok Goel, founder of Delhi-based Luxury Time Pvt. Ltd, a distributor of brands such as Hublot, Tag Heuer, Zenith and Bomberg, confirmed the trend is true for their products as well. The company, he said, is reporting 50% more business than it did in 2019 and 250% more business than it did in 2020.    “Several brands across the world, especially the well-established and highly desirable Swiss companies, are currently focused on making and selling more high-end collectable watches directly from their own monoband retail boutiques,\" he said.     This is primarily because the super-rich never stopped buying collectable luxury watches during the pandemic, and the more unique the watch was, the more collectable it became.    Luxury watch retailer Kapoor Watch Co., the Indian retailer of Bvlgari, Cartier, Omega and Tag Heuer brands, also saw an uptick in business last year.     Pratiek Kapoor, the company’s head of marketing, said India’s purchasing power for luxury goods has increased tremendously during the pandemic.     The company is adding not just newer clients but their existing clients are also trading up and buying more now.     “Existing buyers are trading up with more high-end pieces. Also, newer clients are continuing to enter the fold,\" he said.     The major growth is primarily being driven by products in the price range of  ₹8-16 lakh.    Late last year, Swiss luxury watchmaker Franck Muller launched a watch collection exclusively for the Indian market, priced between  ₹8-20 lakh.    But one of the top distributors of luxury watches in the country cautioned that the sharp increase in sales of luxury watches could be due to certain factors.    The Chinese have been largely absent from the global luxury consumption market in the last couple of years; as a result of this, several international companies have renewed their focus on India.     The Swiss luxury watch industry could also be gaining in terms of value from the dollar strengthening and the rupee devaluing.     “The prices of luxury watches have increased by 25%. But the overall demand for luxury products in India has gone up. Just like other asset classes, Indians are now seriously investing in luxury watches,\" said Nitin Chainani, CEO of Swiss Promotion Pvt. Ltd, a firm that distributes luxury watches here.    And it is no surprise that passion investments that are likely to be made in 2023 showed a high percentage of growth in the Indian context.     According to a recent report, titled The Wealth Report: Outlook 2023, by Knight Frank, Indians were more likely to buy luxury watches as compared to their Asia-Pacific and other global counterparts in the ultra high-net-worth individual category. As much as 53% of Indians are likely to purchase luxury watches compared to 48% Asia-Pacific and 46% global counterparts.    “The proposition of investible wealth towards passion investments changed in the last four to five years. Today, since 2018, when Indians spent 3% of their wealth on these types of investments, there has been a 1% increase. Luxury watches, for instance, which are relatively better to store, transact with and resell, compared to others, are highly investable for this asset class of people,\" said Vivek Rathi, senior vice-president of research at Knight Frank India. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/start-ups\/dealshare-lays-off-around-6-of-workforce-11674843238175.html","pub_date":"2023-01-27T23:43:57+05:30","title":"Dealshare lays off around 6% of workforce","keywords":"dealshare layoffs","articles":"The firm will provide a notice period of about three months to the laid off employees, along with out-placement support       Joining the long list of Indian startups that have been trimming their headcount to cut costs, grocery-focussed social commerce startup Dealshare run by Merabo Labs Pvt. Ltd on Friday said it has laid off 100 employees, or around 6% of its 1,500-workforce, across several verticals as part of a corporate realignment process.     “As part of our business restructuring plan and to sustain growth, we have taken a difficult decision to reduce the size of the team by 100 employees which constitutes only 6% of the company. We have taken adequate measures to compensate the affected employees,\" a company statement said.     Layoffs at the social commerce startup were undertaken across functions, the company said.     The realignment plan comes amid challenging macroeconomic conditions, which, as per the firm’s founder and co-chief executive Sourjyendu Medda, are likely to continue in the near term. “We have toned down the business plan a bit in terms of geographical expansion, and the newer spheres of the business that we were going to invest into,\" Medda said.    The firm looks to pare down expenses from those parts of its operations which “could lead to longer periods of cash infusion and investments, before becoming profitable.\" The firm aims to realign its operations, particularly in Madhya Pradesh and Tamil Nadu, which were among the recently launched geographies, as a measure to contain its costs. It currently operates in 150 cities.     The firm will provide a notice period of about three months to the laid off employees, along with out-placement support. Medda said the company may offer and extension to the notice period to employees unable to secure a job offer at the end of the three-month period.     At its peak during March-April 2022, the company’s ARR (annual revenue run rate) stood at about $900 million, from which it has dropped by about one-thirds about to $600 million, after the company reduced its cash monthly burn by about two-thirds.     Even as the chief executive remained confident on the firm’s revenue growth, which stood at about  ₹1933 crore at the end of financial year (FY) 2022, the firm may not be able to break even by FY23 end, he said. Dealshare incurred a  ₹67 crore loss at the end of FY22.     With this, the firm joins the long list of startups laying off their employees amid a challenging macroeconomic environment. In 2022, over 19000 were laid off across Indian startups, while this year, over 2600 have already been sacked for a multitude of reasons including corporate restructuring, cost-cutting, or performance review.     This week saw layoffs particularly in the healthcare sector. Among the latest was SirionLabs, which fired about its 130 staff to realign business operations, followed by Innovaccer, laying off around 245 employees citing a similar reason. InMobi also cut 70 jobs as part of its performance review.     DealShare joined the coveted unicorn club early last year after raising almost $130 million as a part of its Series E funding round from Tiger Global Management, Alpha Wave Global and others. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/bank-exposure-to-adani-firms-manageable-analysts-say-11674843233802.html","pub_date":"2023-01-27T23:43:53+05:30","title":"Bank exposure to Adani firms manageable, analysts say","keywords":"Adani Group,Hindenburg Research,CLSA,debt","articles":"CLSA estimates that the group has a bank debt of  ₹70,000-80,000 crore out of the total  ₹2 trillion of debt at the end of FY22       Mumbai: The exposure of Indian banks, primarily state-run lenders, to the Adani group has dropped to 40% of the conglomerate’s total debt as the group diversified its funding sources, including from bonds and foreign banks, according to analyst reports published after US investor Hindenburg Research alleged that the group engaged in accounting fraud and stock manipulation.     A 26 January CLSA report, titled Adani—Where does the debt sit?, said Indian banks’ exposure is under 40% of total group debt, with private banks’ share plummeting from 31% to 8% and public sector banks’ share falling from 55% to 26%.    CLSA estimates that the group has a bank debt of  ₹70,000-80,000 crore out of the total  ₹2 trillion of debt at the end of FY22. While the group’s debt levels have doubled to  ₹2 trillion in three years, the group’s bank debt has increased only by 25%. A greater part of the group’s funding now comes from bonds at 37% and foreign banks at 18% of the debt.     Shares of Indian banks and Life Insurance Corp. of India plunged on Friday amid concerns about their exposure to the Adani Group following the report. The NSE Bank Nifty Index fell 3.13% to 40,345.30, extending declines from the previous session. Bank of Baroda and State Bank of India were among the major losers, falling at least 5% each. LIC’s shares ended 3.4% lower at  ₹665.95 apiece.    Hindenburg Research, which in the past has shorted electric truck maker Nikola Corp., said it holds short positions in Adani companies through US-traded bonds and non-India traded derivative instruments.    “Private banks’ exposure is below 10% of total group debt, and most banks (including ICICI, Axis) have indicated that they have largely financed assets with strong cash flows, such as airports\/ports. PSU banks do have material exposure (30% of group debt), but this debt has not increased in the past three years. Most of the incremental funding to the group for new businesses and acquisitions has come via overseas sources,\" CLSA said in its report.    “We estimate that incrementally, banks have only lent  ₹15,000 crore, or 15% of the  ₹1 trillion the group companies have borrowed over the past three years. Large acquisitions, such as cement, have been fully funded by foreign banks,\" CLSA added.    Jefferies, too, noted limited risk for banks due to their exposure to Adani group companies.     “From the banking sector’s perspective, debt to this group forms 0.5% of total loans—0.7% for PSU banks and 0.3% for private banks. Our recent conversation with industry participants also indicated that cash-flows and repayment timelines of debt had been conservatively planned. Hence, DSCR (debt service coverage ratio) could be even better. While we watch for developments here, we don’t see material risk arising to the Indian banking sector,\" Jefferies said.  Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/athleisure-casual-wear-stay-robust-in-post-covid-world-11674843232007.html","pub_date":"2023-01-27T23:43:51+05:30","title":"Athleisure, casual wear stay robust in post-covid world","keywords":"Select Citywalk mall,athleisure,Nike,Adidas,Puma,Decathalon","articles":"Companies said the trend points to consumers finding more comfort in casual wear and also mixing day-to-day pieces with formal clothing.  NEW DELHI :      Demand for athleisure and casual clothing will continue growing in line with the post-covid trend that has held strong despite the return of festive clothing and occasion wear in the December quarter, retailers said.    Companies said the trend points to consumers finding more comfort in casual wear and also mixing day-to-day pieces with formal clothing.    In the December quarter, department store chain Shoppers Stop saw strong demand for casual wear, despite an increase in demand for wedding wear and festive clothing. “I think if we look at the whole casual space, that has expanded and continues to grow. Even during the third quarter, where festive was a strong category, casual wear grew. The casualization trend that has happened (post-covid) will continue to be strong. Athleisure is a subset—that I think will definitely continue to grow because the base itself is low. It’s eventually about comfort and that’s something which customers have gotten used to,\" said Venu Nair, managing director and chief executive officer, Shoppers Stop.    Casualization as a trend within apparel will continue to remain strong, Nair said.    Jubi Samuel, senior director, category management, sports at Myntra said that athleisure is now “well ingrained\" in people’s everyday wear. With more and more brands focusing on inclusive sizes, any-wear and all-day stylized comfort wear, this segment is poised to grow further, said Samuel.    On Thursday, Myntra announced the launch of Bollywood actor Akshay Kumar’s fashion brand Force IX on its platform. The brand will sell t-shirts, sweatshirts and caps targeted towards consumers looking for street wear and casual wear.     “Athleisure as a category (apparel and accessories) has witnessed a steady growth in demand from customers including from metros as well as tier-2 cities and beyond, with increasing focus and enthusiasm for fitness particularly since the pandemic. Interestingly, the growth of athleisure for women is faster than for men,\" Samuel said.     Samuel said the platform is seeing leading brands in this segment betting big on women’s athleisure and getting a lot of colour and print elements incorporated in their assortment.     “We are confident about the category continuing the momentum for calendar year 2023 with customers coming in from both metros, as well as smaller towns and cities,\" Samuel added.    The pandemic also took away the dominance of formal clothing as consumers swapped office shirts with causal t-shirts and joggers to stay at home for extended periods.     However, even prior to the pandemic, athleisure clothing such as leggings, tights, sweatpants, sneakers, hoodies, and jackets was established in popularity. Covid further accelerated the trend.     It helps that India’s demographic is also largely young, comfortable in joggers and sneakers at malls and cafes.    The pandemic also stoked consumer interest in health and fitness. This, in turn, is prompting consumers to buy more leggings, tracks and jackets.     At New Delhi’s popular Select Citywalk Mall, athleisure and sporting good stores have continued to do brisk business, growing ahead of 2019 levels. The mall has over a dozen brands that retail sneakers, fitness clothing, sporting goods as well as other athleisure assortments. These include Nike, Adidas, Puma and Decathlon.    Yogeshwar Sharma, CEO and executive director, Select Citywalk, said: “Fitness as a category is not going down and that will continue— things like sporting equipment and sporting goods will grow at a fast pace. It is because of covid that this category has gained momentum. For us, four categories including athleisure, beauty, electronics and watches are the key focus areas,\" he said. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/adani-ent-fpo-subscribed-just-1-on-first-day-11674843230708.html","pub_date":"2023-01-27T23:43:50+05:30","title":"Adani Ent FPO subscribed just 1% on first day","keywords":"Adani Group,FPO,investor demand,Hindenburg Research","articles":"The  ₹20,000 crore follow-on public offering (FPO) of Adani Enterprises Ltd got off to a weak start on Friday with a subscription of just 1%, as the fraud allegations made by Hindenburg Research buffeted Adani group stocks       Mumbai: The  ₹20,000 crore follow-on public offering (FPO) of Adani Enterprises Ltd got off to a weak start on Friday with a subscription of just 1%, as the fraud allegations made by Hindenburg Research buffeted Adani group stocks.     The FPO received bids for only 470,000 shares against an offer size of 45.5 million shares, stock exchange data showed.    To be sure, the first-day subscription figures are a poor indicator of the demand for a share sale, as these share sales typically draw the lion’s share of investor demand on the final day of the offering.     The price range of the FPO, running through 27-31 January, has been fixed between  ₹3,112 and  ₹3,276. Retail investors have been offered an additional  ₹64 discount per share. On Friday, Adani Enterprises shares plunged 18.5% to  ₹2,762.15 on BSE, trading below the lower end of the FPO offer price. However, subscribers to the offer need to pay only 50% of the price now, with the remaining 50% to be paid at a later date to be decided by the company.    According to stock exchange data, the institutional investor category of the share sale did not see any subscription on day one, while the portion reserved for retail investors and non-institutional\/high net-worth individuals was subscribed 2% and 1%, respectively. A small portion of the share sale reserved for employees saw a 4% subscription.    Ahead of the FPO opening for public subscription, the company raised  ₹5,984.9 crore by allocating shares to anchor investors. The anchor investors, 33 in total, included foreign and domestic institutional investors such as Maybank Securities Pte Ltd, Life Insurance Corp. of India, SBI Employees Pension Fund, SBI Life Insurance Co., HDFC Life Insurance Co, Abu-Dhabi-based sovereign wealth fund ADIA, Goldman Sachs Investment and Morgan Stanley Asia.    “It is still too early to say. It is becoming too hot for people to put in money, but the group still has a lot of influence with institutional investors to ensure sufficient demand for the offer to be successful,\" said a market expert, speaking on the condition of anonymity.    Meanwhile, Adani group has denied several of the allegations made in the Hindenburg Research report released ahead of the opening of the FPO, according to a presentation made by the Adani group.    The Adani group said 21 questions (related-party transactions and court cases) are nothing but Adani portfolio’s public disclosure from as far back as 2015. Hindenburg had sent the group 89 questions as part of its research into the group. Mint has seen a copy of the presentation. “Hindenburg asked 89 questions in total...21 in total cannot be claimed to be a result of any investigation over a two-year period or any such assertion as they were disclosed in the following public documents all the way back from 2015,\" the presentation said.    The presentation added that the accounting (or fraud-type assertions) “investigation\" was devoid of facts. “Of Adani portfolio’s nine public listed entities, eight are audited by one of the Big 6,\" it said.    On the issue of leverage, the group said 100 of its firms are rated by three global and seven domestic rating agencies, with this accounting for nearly 100% of its Ebitda.    On revenue or balance sheet being artificially inflated, the group retorted that out of nine listed firms in Adani portfolio, six are subject to specific sector regulatory review for revenue, costs and capex. “In addition to accounts, Sebi, BSE or NSE requirements, six of our listed entities are also obliged to provide regular filings for business regulators. In these cases, revenue claimed expenses and claimed capital expenses are independently reviewed by the regulators as part of the relevant legislation, e.g. Electricity Act,\" the presentation noted. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/jiomarttests-govt-s-e-commerce-platform-ondc-before-going-live-11674843229498.html","pub_date":"2023-01-27T23:43:49+05:30","title":"JioMart tests govt’s e-commerce platform ONDC before going live","keywords":"ONDC,JioMart,Reliance Jio","articles":" Reliance Jio’s grocery platform JioMart is currently testing the government’s Open Network for Digital Commerce (ONDC) network and may join the platform soon, a person aware of the matter said       New Delhi: Reliance Jio’s grocery platform JioMart is currently testing the government’s Open Network for Digital Commerce (ONDC) network and may join the platform soon, a person aware of the matter said.     Seven hundred companies, including financial services giant Paytm, have already signed up on ONDC, while 300 are in various stages of integration, the person said on the condition of anonymity.     Also, companies such as ITC Ltd are building seller services for ONDC, according to the company’s website. IDFC Bank, Kotak Mahindra Bank, and payments firm PhonePe, are other big brands that are set to integrate with the network. The person added that 5,000 merchants are already part of ONDC.    The ONDC network aims to break hegemonies in the e-commerce industry. It does so by creating a common registry of buyers, sellers, logistics and tech service providers, among others, which all stakeholders can access. This prevents any one operator from controlling the market by limiting access to buyers by creating walled gardens.    JioMart is owned by billionaire Mukesh Ambani’s Jio Platforms Ltd. The company also partnered with WhatsApp and allows consumers to place orders through the messaging service. In its earnings report earlier this month, the company said orders on WhatsApp were up 37% monthly.    To be sure, this won’t be the first integration that Reliance has done with the network. In August, Reliance Retail-owned logistics platform Grab.in went live on ONDC. A spokesperson for Reliance Jio did not respond to a request for comment.    ONDC officially went live in September, with a pilot launch in Bengaluru. It has since started running alpha tests in 84 cities and is in beta in two cities—Bengaluru and Meerut. Alpha tests are being run in Noida, Faridabad, Lucknow, Bijnor, Bhopal, Chhindwara, Kolkata, Pune, Chennai, and Kannur.    Logistics unicorns Dunzo, Delhivery and Shiprocket have already joined the platform. Paytm and Meesho have e-commerce integrations, with Flipkart and Amazon expected to join later.     A report by the non-profit think-tank Digital India Foundation (DIF), published in November, said ONDC may reach 250 million users by 2027.    In December, T. Koshy, managing director and chief executive of ONDC, said the company might charge a “small fee\" from platforms in future. He didn’t specify when this would begin, however.    The person also said that the source code for a reference ONDC app would be put up on the Microsoft-owned code repository GitHub within a few weeks. While ONDC is not a platform like the unified payments interface (UPI) or account aggregator (AA), platforms can still build ONDC-compliant apps.     The reference app to be put up on GitHub will allow any developer to gain access to the basic source code required to build such an app. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/chemical-firms-face-demand-woes-though-cost-stress-eases-11674839842820.html","pub_date":"2023-01-27T22:49:56+05:30","title":"Chemical firms face demand woes though cost stress eases","keywords":"chemical industry,chemical manufacturer,companies,china,prices,q3 results,agriculture","articles":"Demand for agrochemicals remained steady but channel inventories in some regions worry       Despite strong long-term growth drivers, the Indian chemical industry is facing pressure from rising raw material prices, logistics issues and supply-side constraints, as well as demand concerns because of the economic slowdown in Western markets.    Some respite, however, is now being provided by China, which has eased longstanding covid curbs. Lower oil prices are another positive, as it helps ease raw material prices and supplies. Even shipping rates and container availability have improved over time. Strong domestic demand for chemicals is another major positive.    However, analysts remain cautious and watchful about the impact of the global slowdown amid lingering recession worries.    Analysts feel that while the pace of rate hikes and inflation are falling, the interest rate hike cycle may continue for some time and inflation is still much higher than the 2% targeted by developed economies such as the US.    Prahalathan Iyer, chief general manager (research and analysis) at the Export-Import Bank of India, said recessionary concerns may lead to caution prevailing for about two quarters more. He, however, kept a positive view of the prospects of the Indian chemical industry.    Trade data across India, China and the US reflect weakness engendered by an economic slowdown. Consequently, export revenues of Indian companies, particularly those exposed to cyclical end-users, are under pressure, said analysts at Kotak Securities Ltd.    India’s exports and imports of organic and inorganic chemicals trended lower from a year ago in December 2022. Exports fell 6.6% from a year ago (although they rose 9.8% sequentially compared with a depressed base), while imports fell 20.4% from a year ago (down 0.5% sequentially) in US dollar terms, as per Kotak.    Even trade data from the US and China, too, reveal softness. US chemical exports were lower by 9.5% from a year ago at $13.4 billion in November, and imports declined 2.5%, while China’s overall exports (across all sectors) fell 9.9% from a year earlier in December and imports fell 7.5%, as per analysts at Kotak.    Among chemicals, demand for discretionary applications such as dyes and pigments, polymers, and automobiles continues to face headwinds, analysts said, though demand for essentials such as agrochemicals is steady. Higher crop prices are supporting agrochemical demand, though high channel inventory could impact sales in the near term.    Although domestic demand for chemicals continues to remain healthy, exports trend needs to be monitored amid demand weakness across the European and Chinese markets, said analysts at Centrum Broking. Analysts, however, do expect companies to benefit from lower chemical prices.    “Most basic chemicals saw a sharp correction in prices in Q3FY23 as crude oil prices moderated 10% sequentially and chemical feedstock prices witnessed a fall of up to 20% sequentially on weak demand. Ocean freight costs declined 40-50% sequentially and are currently back to normalized\/ historical levels. Rupee depreciated 3% versus the dollar,\" analysts at Prabhudas Lilladher said.    Chemical prices generally trended downwards sequentially in Q3, impacted by demand weakness in Europe and China. Domestic companies are expected to benefit only partially due to the spillover of high-cost inventories in Q3, said analysts at Centrum. Nonetheless, they expect some gross margin expansion for the chemical producers, with major benefits likely to accrue in the current quarter. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/hinduja-global-announces-buyback-worth-rs-1020-cr-11674836562142.html","pub_date":"2023-01-27T22:22:08+05:30","title":"Hinduja Global Solutions announces buyback worth  ₹1020 cr","keywords":"hinduja global solutions buyback,hinduja global solutions share price,hinduja global share","articles":"The record date for the purpose has been fixed as March 6,2023 in order to determine determining the names of the equity shareholders .       The Hinduja Group’s business process management entity, Hinduja Global Solutions (HGS) on Friday announced that the company's board has approved buyback programme worth  ₹1,020 crore.     The company said that it has fixed final buyback price of  ₹1,700 per equity share. The buyback size, which is not to exceed  ₹1,020 crore, excluding any expenses incurred in the buyback programme.    “Fixed the Final Buyback price of Rs1,700 (Rupees One Thousand and Seven Hundred Only ) per equity share (the “Buyback Price\" ) for an aggregate consideration not exceeding  ₹1020,00,00,000 (Rupees One Thousand and Twenty Crores only), excluding any expenses incurred or to be incurred for Buy-back viz,\" said Hinduja Global Solutions in its regulatory filing.    The record date for the purpose has been fixed as March 6,2023 in order to determine determining the names of the equity shareholders .    “Fixed, Monday, March 6, 2023 as the Record Date for the purpose of determining the names of the equity shareholders who will be eligible to participate in the Buyback and their entitlements,\" said the company in the filing.    The company said that the total number of shares to be bought back in the buyback programme is sixty lakhs which represents 24.59 per cent and 13.43 percent  of the aggregate of the fully paid-up equity share capital and free reserves of the company.    “The total number of shares to be bought back in the Buyback shall be upto 60,00,000 (Sixty Lacs) equity shares representing 24.59% and 13.43% of the aggregate of the fully paid-up equity share capital and free reserves of the Company as per audited condensed standalone interim financial statements and audited condensed consolidated interim financial statements of the Company as on September 30, 2022 of the Company respectively,\" said Hinduja Global Solutions in the filing.    The company's scrip ended 0.089 per cent up at  ₹­1,299.20 on BSE.              \" Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/telecom-authority-releases-subscribers-tally-airtel-jio-gain-vodafone-loses-11674834322938.html","pub_date":"2023-01-27T21:44:41+05:30","title":"Telecom authority releases subscribers tally; Airtel, Jio gain; Vodafone loses","keywords":"TRAI data,Jio,Airtel,Vodafone Idea,Jio subscribers,Airtel subscribers,Vodafone Idea susbcribers","articles":"India's largest telco Reliance Jio cemented its lead in the telecom market adding 14.26 lakh net subscribers in November, whereas Airtel added 10.56 lakh users. Jio's overall subscribers tally stood at 42.28 crore at the end of November 2022.       The Telecom Regulatory Authority of India (TRAI) on Friday released the data of mobile subscribers gained by various telecom operators in November 2022. Cumulatively, Reliance Jio and Bharti Airtel obtained nearly 25 lakh subscribers during this period, while Vodafone Idea lost around 18.3 lakh customers, according to the data.     India's largest telco Reliance Jio cemented its lead in the telecom market adding 14.26 lakh net subscribers in November, whereas Airtel added 10.56 lakh users. Jio's overall subscribers tally stood at 42.28 crore at the end of November 2022.     As per TRAI data, Bharti Airtel's subscriber gains increased mobile user count of the Sunil Mittal-led company to 36.60 crore in last November, PTI reported.     However, Vodafone Idea has lost 18.27 lakh subscribers during the same month in reference, tempering its subscriber base to 24.37 crore in November.    The TRAI data also stated that the total broadband subscribers increased to 825.38 million at the end of November 2022 with a monthly growth rate of 0.47%. In total, top five service providers constituted over 98% market share at November end.     The list included Reliance Jio Infocomm Ltd (430.18 million), Bharti Airtel (230.56 million), Vodafone Idea (123.48 million), and BSNL (25.85 million), amongst others, as per PTI reports.     As on November 2022, the top five wired broadband service providers were Reliance Jio Infocomm Ltd (7.38 million), Bharti Airtel (5.56 million), BSNL (4.02 million), Atria Convergence Technologies (2.14 million) and Hathway Cable & Datacom (1.13 million).    The top five wireless broadband service providers include Reliance Jio Infocom Ltd (422.81 million), Bharti Airtel (225 million), Vodafone Idea (123.47 million), BSNL (21.83 million), and Intech Online Pvt. Ltd. (0.23 million).    Total wireless subscribers decreased to 1,143.04 million at the end of November 2022, from 1,143.63 million at the end of October 2022, sliding 0.05 per cent.    \"Monthly growth rates of urban and rural wireless subscription were 0.24 per cent and -0.39 per cent respectively,\" it said.       (With PTI inputs) Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/ford-recalls-462-000-vehicles-for-damaged-rearview-cameras-11674831004782.html","pub_date":"2023-01-27T20:31:15+05:30","title":"Ford recalls 462,000 vehicles for damaged rearview cameras","keywords":"Ford Motor Co,rear camera display failure,Ford vehicles,Ford vehicles rear camera","articles":"Ford said it has reports of 17 minor crashes relating to the recall issue and more than 2,100 warranty reports but no reports of injuries.       Ford Motor Co said Friday it is recalling 462,000 vehicles worldwide because video output may fail, preventing the rearview camera image from displaying.    The U.S. automaker said the recall covers some 2020-2023 model year Explorer, Lincoln Aviator, and 2020-2022 Lincoln Corsair vehicles equipped with 360-degree cameras and includes 382,000 in the United States.    Ford said it has reports of 17 minor crashes relating to the recall issue and more than 2,100 warranty reports but no reports of injuries. The recall expands and replaces a 2021 recall of 228,000 vehicles. Dealers will update the image processing module software and vehicles previously updated under the old recall will need the new update.    Ford said in late 2021 and 2022 the National Highway Traffic Safety Administration (NHTSA) contacted the automaker about reports of a blue image in the rear camera display after the completion of the 2021 recall, which prompted the company to investigate.    NHTSA in August 2021 opened an investigation after Ford in 2020 recalled 620,246 vehicles for another rear camera issue. The investigation is reviewing if Ford had recalled the vehicles in a timely fashion and if it recalled enough vehicles.    Ford has issued other rear camera related recalls in recent years including recalling 47,000 U.S. 2021-2022 Bronco vehicles because the rearview camera image may still be displayed after a backing event has ended, which could distract the driver.  This story has been published from a wire agency feed without modifications to the text. Only the headline has been changed. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/goodyear-to-cut-500-jobs-citing-significantly-weaker-demand-11674829937369.html","pub_date":"2023-01-27T20:08:05+05:30","title":"Goodyear to cut 500 jobs, citing ‘significantly weaker’ demand","keywords":"Goodyear,Layoffs,Goodyear Tire &amp; Rubber Co.","articles":"The reductions will target salaried employees, representing about 5% of such positions across the company   Goodyear Tire & Rubber Co. will eliminate about 500 jobs, adding to the wave of layoffs sweeping corporate America as the company cuts costs in response to weak demand and rising inflation.    Goodyear Tire & Rubber Co. will eliminate about 500 jobs, adding to the wave of layoffs sweeping corporate America as the company cuts costs in response to weak demand and rising inflation.      The reductions will target salaried employees, representing about 5% of such positions across the company, according to a statement Friday. The move, expected to be completed during the first half of this year, will results in pretax charges of about $55 million.      “Our fourth-quarter results fell short of our expectations given a significantly weaker industry backdrop, particularly in Europe,\" Chief Executive Officer Richard Kramer said in the statement. Tire demand fell about 12% during the period in the Europe, Middle East and Africa region, which will drag that unit to an operating loss of about $80 million.      Goodyear shares fell 4.5% as of 8:53 a.m. in New York. The company is slated to report full results for the fourth quarter on Feb. 8.      The company said it’s grappling with inflation in areas such as wages and benefits, countering the benefit from a decline in raw material costs.   This story has been published from a wire agency feed without modifications to the text. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/i-did-not-expect-it-google-hr-laid-off-abruptly-while-interviewing-candidate-11674824435212.html","pub_date":"2023-01-27T19:13:28+05:30","title":"‘I did not expect it…': Google HR laid off abruptly while interviewing candidate","keywords":"Google,Google HR,Google lay off,Google employee lost job","articles":"A Google recruiter, taking to LinkedIn, stated that he was in the middle of a call with a potential candidate when the call was suddenly disconnected in between the conversation.       The tech giant, Google has announced 12,000 job cuts globally this month. Google CEO Sundar Pichai has sent an email regarding lay offs to its staff members. However, an employee has recently revealed that he discovered about his employment termination when he could not access his account anymore.    A Google recruiter, taking to LinkedIn, stated that he was in the middle of a call with a potential candidate when the call was suddenly disconnected in between the conversation.    Dan Lanigan Ryan, who worked as a recruiter at Google, shared how he was blocked out of the system in the middle of a call and fired from the company abruptly.    “Unfortunately, I was laid off from Google along with many thousands of others last Friday. Cut to 16 months later, I did not expect it to come to such an abrupt end, blocked out of the system in the middle of a call,\" Ryan's LinkedIn post read.    He stated that he landed his ‘dream job’ with a ‘dream company’ about an year ago. Expressing his happiness after being selected at Google, Ryan said, “I was walking the dog when my recruiter called to tell me I got the role and I nearly choked the poor pooch I was celebrating so much.\"    Ryan further informed that his contract was just extended for another year and was moved to the Cloud Sales recruitment team. In addition, only a week ago there was talk of a pay rise, however, he have been caught off guard, the ex-Google recruiter added.    “I will be forever grateful for everything I learned and to all the fantastic people I had the pleasure of working with. I want to say thank you to my managers Emma Daly-Ronayne, Marie-Claire Kennedy and Joe Morgan and my buddies Yasmeen Hussain and Rocco Sek. Your continuous support was instrumental to my successes,\" Ryan expressed gratitude to his colleagues and seniors at the company.    Soon after laying off 12,000 employees, Sundar Pichai took full responsibility for the decision and also he was “deeply sorry\" for the job cuts at Alphabet. He mentioned in the email that Google would support the impacted employees through 2022 bonuses, healthcare, job placement services, and immigration support. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/equirus-plans-to-invest-750-cr-to-expand-biz-11674823516704.html","pub_date":"2023-01-27T18:15:16+05:30","title":"Equirus plans to invest  ₹750 cr to expand biz","keywords":"equirus,invest,expansion,ajay garg","articles":"We keep client at the centre of all decision-making and all solutions that we develop are to take care of client needs, said Ajay Garg, founder and managing director of Equirus Capital       The year 2022 was a difficult one for dealmaking, especially in capital markets, as global macroeconomic woes kept Indian markets volatile and foreign investors withdrew liquidity. In an interview, Ajay Garg, founder and managing director of Equirus Capital, owned 20% by Federal Bank, spoke about the dealmaking outlook for this year and the investment banking platform’s plan to expand its asset and wealth management businesses with an investment of  ₹750 crore over the next five years. Edited excerpts:  What is the growth plan for Equirus for the next five years? How are you building out the asset management and wealth management businesses?    Equirus is rightly placed in all its businesses to enjoy significant growth in next five years. Equirus Wealth is strategically poised to significantly scale up in the next five years as both the wealth and asset management businesses have been steadily growing for the last 5-6 years and are operationally profitable as well. We are adding a tech and digital team to increase our capabilities on the digital side as we have started HNI broking, which was missing in our overall proposition. Family office is another proposition that we intend to start to cater to the segment at which Equirus parent entity has been operating over the last 15 years. At Equirus Wealth, we keep client at the centre of all decision-making and all solutions that we develop are to take care of client needs. This strategy has helped us cross  ₹5,000 crore AUM across wealth and asset management and over the next five years, we would want to increase this penetration into partner banks by increasing our location network and RM (relationship manager) footprint. Asset management would be focussed on creating and managing high-quality alpha-generating portfolio; we would want to piggy on the alpha that we have generated for our clients in our flagship fund Equirus Long Horizon and replicating the same in a more diversified portfolio. We would also wish to add debt PMS and AIFs as a part of asset management offering, which shall in turn increase our overall proposition.  How much capital do you plan to invest in the platform for these plans? Will you look at going public to raise the funds or will you look at private equity investors?    We plan to invest around  ₹750 crore in all our businesses put together. There is specific deployment for our digital wealth business and NBFC business to help our wealth platform. We are also adding the direct equities options for our wealth platform. With Gift City presence, we are seeking to further our AMC vertical. Our core business of investment banking and institutional equities are looking to broaden and strengthen the capability. Besides internal accruals, we will supplement the same with the right external raising to implement the above plans.  Federal Bank is a minority investor in Equirus. Will they be investing more capital in Equirus to fund these growth plans?    Since 2018, Federal Bank has been a key investor and partner of Equirus. Post the initial investment, the bank has participated in our rights issue and has always invested in the past.  Will capital market deals such as IPOs and QIPs see a good run in 2023 or do you see a repeat of 2022?    2022 had been sluggish because of the external headwinds. Not just India, but the entire world has suffered. However, 2023 is a year of hope as we expect the headwinds to fade and therefore, capital market deals should revive. Needless to say, the backlog of 2022 itself will provide the much-needed boost. Furthermore, as we will see return of foreign capital and revival of equity markets, deals should improve. Notably, the attractiveness of Indian companies, the confidence in Indian markets remains intact. What is needed is the return of risk in the global arena which will happen with the abatement of the headwinds. Furthermore, it is imperative to note that not just the private sector, but government is also “eagerly\" awaiting the momentum with a sizable divestment programme, the success of which is imperative to long term fiscal discipline and consolidation path.    Yes, tightening liquidity not just locally but globally means the easy money is no longer available. However, that only reaffirms that only those companies with strong business fundamentals will get access to the market. Overall, we could see activity pick up with the pace and quantum increasing with Q2\/Q3 onwards.  How are you planning to grow the advisory side of the investment banking business?    Over the years, we have built strong expertise in each of industry verticals with deal track record in new-age tech services, road divestments, auto ancillary, speciality chemicals, healthcare, and financial services as well as fintech. We continue to strengthen these track records and broaden our domain and deal track record. With the broad platform, Equirus is the only middle market bank which can help clients discover true value across private equity market, strategic market, and public market. Through this product-agnostic capability, we are able to have a stronger client-oriented approach to deliver the best solution relevant for the client situation rather than force-fit solution at our product capability. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/dgca-imposes-rs-10-lakh-penalty-on-go-first-11674820835759.html","pub_date":"2023-01-27T17:30:35+05:30","title":"DGCA slaps  ₹10 lakh penalty on Go FIRST for leaving behind passengers at airport","keywords":"GoFIRST,airline,DGCA","articles":"DGCA observed that there was no proper communication and coordination between terminal coordinator, commercial staff and crew regarding boarding of passengers in the aircraft.       Indian civil aviation regulator Directorate General of Civil Aviation has imposed a penalty of  ₹10 lakh rupees on Go FIRST for leaving behind 55 flyers in the passenger coach at Bengaluru airport on 9 January.     The regulator had issued a show cause notice to accountable manager of the airline as to why enforcement action should not be taken against them for dereliction of their regulatory obligations.     The regulator observed from the reply of Go FIRST that there was no proper communication and coordination between terminal coordinator, commercial staff and crew regarding boarding of passengers in the aircraft.     The airline also failed to ensure adequate arrangement for ground handling, preparation of load and trim sheet, flight dispatch and passenger or cargo handling, the regulator noted.     “The airline was at fault across multiple points and no one was cross-checking on how many passengers were supposed to be on that flight. Some people have been sacked by the airline with regard to the incident. Half of the seats in the plane were empty but still it did not strike the staff that something was amiss,\" a senior official said.     “The airline, however, has been quick in taking action post the incident in terms of offering free tickets to the affected passengers,\" the official added.     After the incident, Go First, in a statement, had said that the error occurred due to an “inadvertent oversight\" and all staff responsible for the incident have been put off the roster till the inquiry is on.     “We sincerely apologize for the inconvenience caused to the passengers due to an inadvertent oversight in the reconciliation of flight G8 116, from Bengaluru to Delhi. Passengers were accommodated on alternate airlines to Delhi and onward to other destinations,\" Go First had said after the Directorate General of Civil Aviation issued a show-cause notice to the airline citing “multiple mistakes\".     The airline also offered one free ticket to each affected passenger to avail in domestic routes, valid for the next one year. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/samvardhana-motherson-to-buy-51-stake-in-saddles-international-for-rs-207-cr-11674819385369.html","pub_date":"2023-01-27T17:24:56+05:30","title":"Samvardhana Motherson to buy 51% stake in Saddles International for  ₹207 cr","keywords":"Samvardhana Motherson,Saddles International Automotive,Motherson Consultancies Service,Motherson Invenzen Xlab,Samvardhana Motherson Polymers","articles":"The companies plan to complete the acquisition within three-four months from the date of signing of the deal       Mumbai: Samvardhana Motherson International Ltd (formerly Motherson Sumi Systems Limited) said it will acquire a 51% stake in Saddles International Automotive and Aviation Interiors Pvt Ltd for an enterprise value of  ₹207 crore.    The companies plan to complete the acquisition within three-four months from the date of signing of the deal, according to an exchange filing.    The enterprise value will be computed with adjustments for debt, debt-like items, and working capital    With the acquisition of Saddles International, Samvardhana Motherson will take a step towards diversifying its current business by entering the upholstery market for applications such as passenger vehicle seat covers, gear knob covers, and wrapping of door panels, etc., supporting the company's vision of increasing content per car, the company said.    Saddles International Automotive and Aviation Interiors Pvt Ltd. is engaged in the business of manufacturing premium upholstery for applications such as passenger vehicles seat covers, covers for gear knobs and wrapping solutions for door trims. Saddle International has booked  ₹2,500 crores in business over the next 4-5 years. The company reported revenues of  ₹320 crore in FY22, with approximately 2,000 employees, the company operates seven facilities in India near OEMs, according to investor presentation.    Samvardhana Motherson, in a separate press release, also announced the merger of its four wholly owned subsidiaries with the company through the NCLT route     Motherson Consultancies Service, Motherson Invenzen Xlab, Samvardhana Motherson Polymers, and MS Global India Automotive are among the four subsidiaries.    Samvardhana Motherson International board will consider its third-quarter results on 8 February.    Shares of Samvardhana Motherson ended 1.45% lower at  ₹71.6 apiece on the NSE today. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/cars24-plans-to-hire-over-500-employees-across-divisions-this-quarter-including-technology-product-data-sciences-engineering-business-customer-success-human-resources-finance-marketing-and-sales-11674818192190.html","pub_date":"2023-01-27T17:10:56+05:30","title":"CARS24 plans to hire over 500 employees across divisions this quarter","keywords":"CARS2,Vikram Chopra,hiring,vacancy,technology,product,data sciences,engineering,business,customer success,human resources,finance,marketing,sales","articles":"The company announced that it would be hiring for both tech-related and non-tech related employees and that it had openings across various divisions       CARS24, an online marketplace for pre-owned autos, in order to propel its next phase of expansion, announced on Friday that it would be hiring over 500 individuals in the upcoming three months.    The company announced that it would be hiring for both tech-related and non-tech related employees and that it had openings in the divisions including technology, product, data sciences, engineering, business, customer success, human resources, finance, marketing, and sales.    According to a statement from CARS24, the new recruits will be crucial in advancing the business's next stage of growth as it shrinks back operations and grows even more.    According to the statement, there will be significant hiring for positions like business strategists, data scientists, software, frontend\/backend engineers, product managers, human resource managers, etc.    CARS24 CEO and founder Vikram Chopra stated that, \"As we scale our operations and expand further, we are looking for bright, talented minds for various roles, who share similar values as us to join our team and play a pivotal part in driving the next phase of growth.\"    The business added 24 more cities to its operational footprint last year. The company's domestic division generated  ₹6,008 crore in sales last year, compared to  ₹2,776 crore in 2021.    CARS24 is an online platform that allows users to buy and sell used cars. The company has a network of over 1,500 dealers and more than 1 million registered users. Cars24.com offers a wide range of services to its customers, including vehicle inspections, financing, insurance, car exchange, etc.  (With inputs from PTI) Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/bajaj-finance-q3-profit-surges-40-to-rs-2-973-cr-revenue-up-by-26-11674817087071.html","pub_date":"2023-01-27T17:05:36+05:30","title":"Bajaj Finance Q3: Profit surges 40% to  ₹2,973 cr, revenue up by 26%","keywords":"bajaj finance","articles":"The net interest income (NII) increased 22 per cent on year to  ₹7,435 crore to from  ₹6,005 crore in Q3 FY22.       Bajaj Finance on Friday reported 40 per cent rise on consolidated net profit to  ₹2,973 crore for the December quarter. This is against a net profit of  ₹2,125.29 crore in the corresponding quarter last fiscal.    The total revenue from operations increased 26.3 per cent on year to  ₹10,784.30 crore as against  ₹8,539.13 in the year ago period, said Bajaj Finance in its filing.    The net interest income (NII) increased 22 per cent on year to  ₹7,435 crore to from  ₹6,005 crore in Q3 FY22.    The assets under management grew by 27% to  ₹168,359 crore as of 31 December 2022 from  ₹132,913 crore as of 31 December 2021.    New loans booked during the quarter were the highest ever at 7.84 million, the company said.    The customer franchise stood at 66.05 million as of 31 December 2022 as compared to 55.36 million as of 31 December 2021, a growth of 19%. Bajaj Finance recorded highest ever quarterly increase in its customer franchise of 3.14 million in 03 FY23.    The total operating expenses to net interest income was 34.7% in the third quarter, compared to 35.9% in the second quarter, and was stable from the year-ago period.    The loan losses and provisions for the December quarter was  ₹811 crore as against  ₹995 crore in the year ago period.    Gross NPA and Net NPA as of 31 December 2022 stood at 1.14% and 0.41% respectively, as against 1.73% and 0.78% as of 31December2021.    \"The Company has provisioning coverage ratio of 64% on stage 3 assets and 116 bps on stage 1 and 2 assets as of 31 December 2022,\" it said in its regulatory filing.    On Friday, the company's scrip ended 0.71 per cent down to  ₹5,756 on BSE. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/vedanta-q3-pat-decline-by-42-to-rs-3-092-cr-declares-dividend-of-rs-12-50-11674816253543.html","pub_date":"2023-01-27T16:16:39+05:30","title":"Vedanta Q3: PAT decline by 42% to  ₹3,092 cr , declares dividend of  ₹12.5","keywords":"vedanta,vedanta dividend record date","articles":"The board of directors of Vedanta has approved the fourth interim dividend of  ₹12.50 per equity share, record date is set as February 4       Vedanta Ltd on Friday reported 42 per cent decline in consolidated net profit to  ₹3,092 crore for the December 2022 quarter. This is against a net profit of  ₹5,354 crore in the year-ago period, Vedanta said in a regulatory filing.    The consolidated revenue of Vedanta declined by 0.017 per cent to  ₹33,69 crore in the quarter under review from  ₹33,697 crore a year ago.    The board of directors of Vedanta has approved the fourth interim dividend of  ₹12.50 per equity share. The record date is set as February 4, 2023.    “The Board of Directors of the Company has approved the Fourth Interim Dividend of   ₹12.50 per equity share i.e. 1250% on face value of Re. 1\/‐ per share for the financial year 2022‐23 amounting to  ₹4,647 Crores. The record date for the purpose of payment of dividend is Saturday, February 04, 2023. The interim dividend will be paid within the stipulated timelines as prescribed under law,\"  said Vedanta in its filing.    However, on a quarter-on-quarter basis, net profit grew 15 per cent to  ₹3,092 crore from  ₹2,690 crore.    Consolidated quarterly EBITDA of  ₹7,100 crore with EBITDA margin of 24%.    \"We have delivered a strong set of financial results and steady operational performance in challenging macroeconomic environment. Our quarterly Profit after tax grew 15% on sequential basis to  ₹3,092 crore; free cash flow (pre capex) stood at  ₹6,504 crore with focus on working capital and cost optimization. Our ESG initiatives have been recognized by several major external rating agencies. We have approved plans for another 941 MW RE power under group captive RE power development program. I am also happy to share that Vedanta and Hindustan Zinc Limited Boards have taken strategic initiative to consolidate Zinc International under Hindustan Zinc. It will be a win-win transaction, unlocking significant value for both Vedanta Limited and Hindustan Zinc Limited shareholders,\" said Sunil Duggal, Chief Executive Officer, Vedanta.    The company has announced another 941 MW RE power under group captive RE power development program.    \"I am also happy to share that Vedanta and Hindustan Zinc Limited Boards have taken a strategic initiative to consolidate Zinc International under Hindustan Zinc,\" the company said.    The company's board has approved the sale of Vedanta Zinc International (VZI) business (Gamsberg, Black Mountain and Skorpion operations) to Hindustan Zinc Limited (HZL) for a cash consideration of $ 2,981 mn, including $562 mn as deferred consideration linked to certain milestones.    \"This is a win-win transaction and will unlock significant value for both Vedanta Limited and HZL shareholders. With combined R&R of 1,150 mn tonnes Ore and 60+ mn tons Metal, HZL will have potential to become the largest global Zinc player. Vedanta will continue to participate in this growth story through Hindustan Zinc,\" said Vedanta in its filing.    The company's scrip ended 1.96 per cent down to  ₹319.85 on BSE. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/jio-rolls-out-5g-services-in-6-northeast-states-all-details-inside-11674811684484.html","pub_date":"2023-01-27T15:06:15+05:30","title":"Jio rolls out 5G services in 6 Northeast states: All details inside","keywords":"jio,Reliance Jio","articles":"True 5G is now live in 191 cities across the country, the company said. By December 2023, Jio True 5G services will be made available in every town and taluka of the Northeastern states, Reliance Jio said in a statement.       Reliance Jio, a telecom giant, announced on Friday the launch of its 5G services across six states of the Northeast circle by connecting seven cities, namely, Shillong, Imphal, Aizawl, Agartala, Itanagar, Kohima and Dimapur with its True 5G network.    True 5G is now live in 191 cities across the country, the company said. \"By December 2023, Jio True 5G services will be made available in every town and taluka of the Northeastern states,\" Reliance Jio said in a statement.    Starting tomorrow, the company said Jio users in seven cities across six states of Arunachal Pradesh (Itanagar), Manipur (Imphal), Meghalaya (Shillong), Mizoram (Aizawl), Nagaland (Kohima and Dimapur), and Tripura (Agartala) would be invited to the Jio Welcome Offer, by which they can experience unlimited data at up to 1 Gbps speeds, at no additional cost.    “Amongst the various benefits of True 5G, healthcare has the potential to save lives in difficult times even in the remotest far-flung areas with its reliable wireless network,\" says Jio.    The company said in a statement that revolutionary solutions such as the Jio Community Clinic medical kit, augmented reality-virtual reality (AR-VR)-based healthcare solutions can enhance quality healthcare in urban India and assist in spreading quality healthcare infrastructure to the remotest areas of the country.    A Jio spokesperson said, \"Jio is proud to announce the launch of True 5G services in all the six states of Northeast Circle from today. This advanced technology will bring significant benefits to the people of the Northeast, particularly in the field of healthcare with its reliable wireless network.\"    Additionally, the network would enhance various sectors such as agriculture, education, e-governance, IT, SME, automation, artificial intelligence, gaming, and many more, the spokesperson added. The spokesperson said Jio True 5G has already reached 191 cities in less than four months of its beta launch.    To recall, Jio has rolled out its Jio True 5G service in major cities earlier. Commenting on the occasion, a Jio Spokesperson said, “We are thrilled to launch Jio True 5G services in 50 additional cities across 17 states and union territories, taking the total count to 184 cities. This is by far one of the largest rollouts of 5G services, not just in India, but anywhere in the world. We have stepped up the speed and intensity of True 5G rollout across the nation because we want every Jio user to enjoy the transformational benefits of Jio True 5G technology in the new year 2023.\"    “The entire nation will be able to enjoy and benefit from Jio True 5G services by December 2023. We are grateful to the State Governments of Andhra Pradesh, Assam, Chhattisgarh, Goa, Haryana, Jharkhand, Karnataka, Kerala, Maharashtra, Odisha, Puducherry, Punjab, Rajasthan, Tamil Nadu, Telangana, Uttar Pradesh, and West Bengal for their continuous support in our quest to digitize every region,\" he further added.    (With inputs from ANI) Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/convenience-store-company-the-new-shop-signs-rajkummar-rao-as-brand-ambassador-11674801455534.html","pub_date":"2023-01-27T12:07:35+05:30","title":"Convenience store company The New Shop signs Rajkummar Rao as brand ambassador","keywords":"convenience store,the new shop,rajkummar rao,aastha almast,Charak Almast and Mani Dev Gyawali,co founders,india's retail market,india's convenience retail,24x7,247","articles":"Rajkummar Rao will be seen in digital and on print platforms like social media, OTT, OOH, and IVR messaging to connect with prospective consumers through physical stores and in-app services       The New Shop, a 24-hour convenience retail company has appointed Bollywood actor Rajkummar Rao as its brand ambassador. The actor will feature in a series of campaigns aimed to improve its footprints across the country. He will be seen in digital and on print platforms like social media, OTT, OOH, and IVR messaging to connect with prospective consumers through physical stores and in-app services.    Accelerate Product X ventures Pvt Ltd -- the company that owns The New Shop-- is two years old and has about 100 stores of which 70 are franchised. With its plans to expand and open new stores in the near future, the company wants to go beyond conventional strategies of consumer engagement through collaboration with Rajkummar Rao.    Rajkummar Rao said, “I am thrilled to be partnering with them, a young brand exhibiting rapid growth. I identify with the co-founders‘ determination to create a brand, ensuring its sustainability, and profitability; and I believe this comes from their prior entrepreneurial experiences.“    Aastha Almast, co-founder and head of business for the company said, “We believe that now is the right time to bring on board a brand ambassador and strengthen our brand-building initiatives. While carving a niche as an actor in Bollywood can be quite daunting, Rajkummar Rao has proven to the world over time and time again that talent is not only a product of merit but a combination of perseverance and diligence. What sets him apart is the unconventionality with which he has navigated through the industry by setting his own rules and striking a chord with the audience. His risks have been nothing less than entrepreneurial, which resonates with the company’s organic growth and breaking systemic barriers by providing round-the-clock quality services to consumers.“    According to a research done by Kearney, India’s retail industry is projected to grow at 9% CAGR over this decade, from $779 billion in 2019 to $1,407 billion by 2026 and more than $1.8 trillion by 2030.    Although the pandemic put major stress on discretionary spending, especially in lifestyle retail categories such as apparel, footwear, fashion accessories, cosmetics, small appliances, and home and living, this segment is expected to bounce back stronger after the pandemic. The lifestyle retail categories are expected to grow at a healthy 10 percent to become a $249 billion market by 2026 Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/the-humbling-of-goldman-sachs-11674798129489.html","pub_date":"2023-01-27T11:16:59+05:30","title":"The humbling of Goldman Sachs","keywords":"Goldman Sachs,investment bank,Goldman Sachs consumer business,financial crisis,JPMorgan Chase,David Solomon,Morgan Stanley","articles":"The struggle to reinvent a firm trapped by its own mythology        Goldman Sachs has always seen itself as exceptional. When the bank floated its shares in New York in 1999 it declared: “We have an uncompromising determination to achieve excellence in everything we undertake.\" Conspiracy theorists have long paid it the backhanded compliment of imagining that it secretly runs the world. Yet lately the only exceptional thing about the Wall Street icon has been its mistakes.       Since October Goldman has made a u-turn on its plan to build a big consumer bank; booked one of its worst quarterly results for a decade, measured by return on equity; and attracted a probe by the Federal Reserve. The firm is not yet in serious trouble, but it is trapped by its own mythology. Its recent struggles show how hard it will be to reform—and illuminate a new balance of power in global finance.       To understand Goldman today, take a walk down Wall Street. After the financial crisis of 2007-09, two big American banks reinvented themselves. JPMorgan Chase successfully pursued vast scale across a wide range of business lines. Morgan Stanley built a thriving arm managing the assets of the wealthy, which mints reliable profits. Goldman, however, stuck to its game of trading, advising on deals and bespoke investing. Penal new capital rules made this less lucrative, but the firm staked a Darwinian bet that the resulting shakeout would kill off many competitors. Instead, it badly underperformed the stockmarket for years and got ensnared in the 1mdb scandal, in which officials in Malaysia and Abu Dhabi received $1.6bn of bribes in 2009-14. A Goldman subsidiary pleaded guilty to a criminal charge and the firm admitted “institutional failure\".       The firm’s boss, David Solomon, took over in 2018. A man with a short fuse, he has tried to rebrand himself and to renew the firm by expanding its core and diversifying into new areas. Goldman now offers transaction banking to multinationals, helping them move funds globally. It has bulked up its asset- and wealth-management arm. And from their Manhattan skyscraper, flush Goldmanites dreamed of growing a mass-market digital bank for ordinary consumers, including a credit-card operation.       Parts of Mr Solomon’s strategy have paid off. Goldman’s market share in mergers and bond trading has risen, helping it make a monster $21bn in profits in 2021 as markets boomed. From taxpayers’ viewpoint, it is safer, with more capital and deposits. And, importantly, its share price has recovered lost ground, rising more than the market and those of most of its peers.       Yet look more closely and the project to remake the bank is vexingly incomplete. Diversification has been patchy: transaction-banking revenues are tiny and the asset-management arm is often dragged down by opaque proprietary bets. The dream of creating a consumer bank has soured. Goldman has 15m customers, but has also faced large losses and bad-debt charges, which is why it is now winding down part of the operation.       As the prospects for a big new earnings machine have receded, everything still rests on the traditional business. The profitability of the trading arm has improved but remains volatile and, on average, pedestrian. Overall, Goldman has made reasonable use of its resources, generating a return on tangible equity of 14% over Mr Solomon’s tenure. But its performance is erratic, veering from 33% in early 2021 to just 5% in the latest quarter. It has lagged behind its American peers half of the time, and the two industry leaders, JPMorgan and Morgan Stanley, two-thirds of the time. Investors think that Goldman is worth only the net book—or liquidation—value of its assets, suggesting they doubt that it can generate consistently high returns or find lucrative new areas.    Goldman’s struggles point to several lessons. One is that it still excels, but in a bad industry. Investment banking combines the drawbacks of a regulated activity (capital requirements and red tape) with the vices of a speculative one (volatility and capture by employees). The firm says it has become more disciplined on pay but last year forked out $15bn, its second-highest salary and bonus bill since the financial crisis, even as profits halved to $11bn and the firm barely beat its cost of capital. The real action in finance is outside regulated banking, where a new cohort of stars rules, including Blackstone in private markets, BlackRock in index funds, and Citadel, an investing and trading house that made its clients $16bn in 2022.    Another lesson is that it is hard to compete in winner-takes-all digital markets. Goldman thought that brains and brand were enough. Not true. It has spent billions, but its customer base remains a fraction of that of PayPal or Amazon. JPMorgan reaches 66m American households, but maintains a vast physical network of branches. Goldman has achieved digital scale by teaming up with Apple to provide a credit card. However, given that the tech giant has almost a billion paying subscribers, Apple holds the whip hand in that relationship.    A final lesson is that the stagnation of globalisation has shrunk Wall Street’s horizons. In the decade after Goldman listed, international revenues provided half of its growth, as its bankers conquered Europe and then broke into Asia. Today they supply a third of growth, as local competitors have emerged and some countries have become wary of foreign financiers. The number-one arranger of shares and bonds last year in China was citic Securities; in India Kotak Mahindra and Axis led the pack. These are names that many on Wall Street may not know.    Raging bulls    Can Goldman recover its swagger? Mr Solomon is wisely laying off staff and shrinking the bank’s proprietary investments. Over time he may be vindicated by prosaic changes—running its asset-management arm better, say, or pioneering new tech to cut exorbitant labour costs—or even by orchestrating a merger.    Yet there is something uniquely hard about reforming elite firms whose unwritten code is that they are smarter than everyone else. Just ask McKinsey, a scandal-magnet once known as the world’s most-admired consultancy. Goldman’s culture of self-regard remains at odds with the facts. Instead it now needs to be self-critical. For yesterday’s masters of the universe, that may be the hardest leap of all.  © 2023, The Economist Newspaper Limited. All rights reserved.  From The Economist, published under licence. The original content can be found on www.economist.com Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/tatas-air-india-to-seal-half-of-jumbo-plane-order-reports-11674770823661.html","pub_date":"2023-01-27T03:47:39+05:30","title":"Tata's Air India to seal half of jumbo plane order today","keywords":"Tata Air India,jumbo plane order,Air India plane order,Boeing,General Electric and CFM International,Airbus","articles":"Air India is expected to finalise a deal worth billions of dollars for some 495 jets with Boeing and engine suppliers General Electric and CFM International on Friday       Air India will on Friday seal half of an order worth billions of dollars for some 495 jets with Boeing and engine suppliers General Electric and CFM International, two industry sources said, as its new owner seeks to revive the airline and compete with much larger rivals.    After months of closely-guarded, tough negotiations, Air India is set to place an order for 190 Boeing 737 MAX narrowbody planes as well as some 20 Boeing 787s and 10 Boeing 777X on a day marking one year since Tata Group took control of the former state-run carrier, the sources told Reuters.  Also Read: Air India resets as it finishes one year under the Tata fold    The second half of the order, which industry sources have told Reuters includes around 235 Airbus single-aisle jets and about 40 Airbus A350 widebody aircraft, is expected to be formally wrapped up over the coming days.    Senior Boeing, GE and CFM officials are expected in India to mark the deal on Friday.  Also Read: Tata  group plans to infuse up to $1.8 bn in Air India-Vistara    Despite earlier expectations of a single coordinated announcement, it remains unclear when either deal may be publicly disclosed especially with the Aero India air show looming in February when deals like this are usually revealed.    Manufacturers Boeing and Airbus, as well as CFM's joint venture partners GE and Safran declined comment. Air India did not respond to a request for comment.    Reuters reported last month Air India was closing in on a deal for about 500 jets.  Also Read: Efficiency, costs key focus in Air India-Vistara merger drill    The order, once finalised, aims to put Air India in the league of large global airlines and make it an influential customer for planemakers and suppliers at a time when its home market is seeing a strong post-Covid travel surge.    Domestic passenger air traffic in India grew 47% in 2022 from a year ago, government data showed.    Analysts caution the airline faces intense competition given the connectivity carved out by local and international rivals.    India, which is set to overtake China as the world's most populous country, has a large, under-served air travel market dominated by budget carrier IndiGo. The bulk of India's outbound passenger traffic, however, is carried by Middle Eastern airlines like Emirates and Qatar Airways. RESURGENT AIR INDIA Under its new owners Air India is looking to restore its reputation at home and overseas as a storied carrier with impeccable service and world-class planes.    It has put back in service nearly 20 aircraft that had been grounded for years due to lack of parts and money. The airline has also said it will spend over $400 million to refurbish its entire legacy wide body fleet of 27 Boeing 787-8s and 13 777 aircraft.    The aim is to corner 30% of the domestic air travel market over the next five years thus narrowing the gap with market leader IndiGo. It also wants to increase by \"multiples\" its current share of international travel, the airline's new chief executive Campbell Wilson previously said.    Tata's four airlines, including two budget carriers, Air India and Vistara its joint venture with Singapore Airlines, have a combined market share of 24%.    Analysts have said Air India has the ability to claw back some passengers from rival Gulf carriers but not before it matches their quality of fleet and service. Nor will the domestic battle with IndiGo happen without tough competition from a carrier that continues to expand. This story has been published from a wire agency feed without modifications to the text. Only the headline has been changed. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/spotify-down-for-thousands-of-users-11674765861452.html","pub_date":"2023-01-27T02:21:10+05:30","title":"Spotify down for thousands of users","keywords":"Spotify,Spotify down,Spotiy outage,Downdetector.com.,Spotiy Users in United States,Spotify music platform","articles":"Several Spotify users had to suffer problem as the platform was down for a while on Thursday. This is the second such outage within two weeks   Spotify Technology SA's music streaming platform was down for thousands of users on Thursday, according to outage-tracking website Downdetector.com.    Spotify Technology SA's music streaming platform was down for thousands of users on Thursday, according to outage-tracking website Downdetector.com.      In the second such outage within two weeks, nearly 35,000 Spotify users reported on Downdetector.com they were having issues with the streaming platform.      \"Something's not quite right, and we’re looking into it,\" Spotify Status, an account that provides updates about the platform's status, said in a tweet on Thursday.      Spotify suffered a brief outage earlier this month, with more than 45,000 affected users from the United States at the peak of the disruption.      A networking outage at Microsoft Corp on Wednesday took down its cloud platform along with services such as Teams and Outlook, hitting millions of users globally, while Meta Platforms Inc's social media apps also faced a brief disruption.    This story has been published from a wire agency feed without modifications to the text. Only the headline has been changed. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/ibm-to-cut-3-900-jobs-amid-broader-tech-slowdown-11674761185772.html","pub_date":"2023-01-27T01:07:02+05:30","title":"IBM to cut 3,900 jobs amid broader tech slowdown","keywords":"IBM,Jobs,layoffs,Tech Slowdown,Information technology","articles":"Information-technology company says cuts stem from spinoff        International Business Machines Corp. on Wednesday joined the wave of companies making layoffs, saying it would cut about 3,900 jobs. Download the Mint app and read premium stories Log in to our website to save your bookmarks. It'll just take a moment. You are just one step away from creating your watchlist! Oops! Looks like you have exceeded the limit to bookmark the image. Remove some to bookmark this image. Your session has expired, please login again. You are now subscribed to our newsletters. In case you can’t find any email from our side, please check the spam folder. This is a subscriber only feature Subscribe Now to get daily updates on WhatsApp","scraped_date":"2023-01-29"}
