{"news_link":"https:\/\/www.livemint.com\/companies\/news\/it-startups-may-cut-up-to-20-000-jobs-in-next6months\/amp-11674408539192.html","pub_date":"2023-01-22T22:58:58+05:30","title":"IT, startups may  cut  up to 20,000  jobs  in next  6 months","keywords":"layoffs,job cuts,Indian IT,startups,employees,hiring frenzy,salary costs","articles":"Pressure from investors, an expected global recession and the domino impact of global layoffs have resulted in staff cuts  India’s IT and startup sectors may lay off 15,000 to 20,000 employees in the next six months, battling slowing demand after the hiring frenzy of the last two years inflated salary costs.  India’s IT and startup sectors may lay off 15,000 to 20,000 employees in the next six months, battling slowing demand after the hiring frenzy of the last two years inflated salary costs.  Recruitment consultants expect fewer hiring mandates in the months ahead and have decided not to enter new businesses for now. Recruitment consultants expect fewer hiring mandates in the months ahead and have decided not to enter new businesses for now. However, even as some IT and startup companies will shed staff to manage costs, others within the same sectors are hiring, too. “We expect about 20,000 layoffs over the next few quarters. Over the last year, companies faced the fear of missing out on talent hiring and recruited in large numbers and paid them many folds more than inflation and market standards,\" said Lohit Bhatia, president of workforce management for recruitment firm Quess Corp.  The cost of maintaining that talent has begun to hurt IT firms and startups, Bhatia added. In FY23 so far, the two sectors have laid off more than 20,000 employees, including 1,400 in the first two weeks of January. Many IT product and services firms, edtechs and fintechs are struggling after the over-hiring of pandemic years, when they snapped up talent at steep salaries assuming continued growth. Today, pressure from investors, an expected global recession and the domino impact of global layoffs have combined to result in staff cuts. Last week, Google fired 12,000 employees, joining tech giants such as Meta, Amazon and Microsoft, which have laid off 11,000, 18,000 and 11,000 workers, respectively. “Fifteen thousand employees will get retrenched over the next six months, but this will be the last leg of the recession. However, there are skilled employees who are getting absorbed into the industry. Attrition in many of the product or IT service firms are upwards of 15%, which means despite layoffs, there is room for lateral hirings,\" said Kamal Karanth, co-founder of Xpheno, which specializes in technology and startup hiring. IT services companies such as Tata Consultancy Services Ltd, Infosys Ltd, Wipro Ltd and HCL Tech face high employee costs, even though overall headcount has fallen.  The impact is mostly on junior and middle-level employees, but search firms in charge of senior hiring in tech and startup sectors said leadership hiring had slowed as well. “There are a couple of cases where the decision-making is getting delayed, but that’s about it. In fact, as a side effect of this retrenchment news, clients have raised their expectations, imagining that a lot of talent is now available,\" said Amit Agarwal, managing director, Singapore and India, Stanton Chase. “However, the matter of fact is companies are not letting go of their key talent or high performers at the top. So, the battle for leadership only intensifies,\" he added. Rituparna Chakraborty, co-founder and executive director of TeamLease Services, expects employers to remain cautious for at least the first quarter of the new fiscal. “IT hiring has gone down, and there is tepidness in the market,\" Chakraborty said.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/rbitoappealbombay-hc-order-onyesbankat1bonds\/amp-11674407344086.html","pub_date":"2023-01-22T22:39:03+05:30","title":"RBI  may  appeal  Bombay HC  order on  Yes  Bank  AT-1  bonds","keywords":"RBI,Bombay high court,Yes Bank,additional tier-I bonds,AT-I","articles":"Bombay high court ruling could have a huge sectoral impact.  The Reserve Bank of India will likely appeal the Bombay high court ruling that quashed the regulator and Yes Bank administrator’s decision to write off additional tier-I (AT-I) bonds to save the lender from collapsing, according to two officials familiar with the matter.  The Reserve Bank of India will likely appeal the Bombay high court ruling that quashed the regulator and Yes Bank administrator’s decision to write off additional tier-I (AT-I) bonds to save the lender from collapsing, according to two officials familiar with the matter.  This high court on Friday granted six weeks to Yes Bank to file its appeal against the order in the Supreme Court.  This high court on Friday granted six weeks to Yes Bank to file its appeal against the order in the Supreme Court.  “RBI believes the writ petition is not maintainable and the order could have a huge sectoral impact. The central bank also believes that the administrator had all the powers of the board to write off the bonds and, therefore, the court’s argument is not valid,\" said one of the two officials aware of the matter, requesting anonymity.  RBI approved the Yes Bank administrator’s March 2020 decision to write off the AT-I bonds as part of a restructuring plan to save bank depositors from losing their savings.  You might also like   India’s rupee trade bid and the math behind it  How GST brought cheer to some states, not others  How a non-compete clause pushed Roongta to RIA practice  The decision was then challenged in court by a group of aggrieved bondholders.MINT PREMIUMSee All\n  AT-I bonds are unsecured bonds with no maturity date and are used by banks to shore up their capital base and comply with Basel III norms. An email sent to a spokesperson for RBI went unanswered. The high court, in its order, said that the administrator appointed by the RBI exceeded his powers to write off the AT-I bonds as the decision was taken after the final reconstitution scheme was notified on 13 March 2020. It said that the scheme came into force on 13 March 2020, and the bank stood reconstructed on the same day. The court ruled that AT-I bonds could only be written down before the bank’s reconstruction. It also pointed out that the government-approved reconstruction scheme for Yes Bank did not include a clause for writing down these bonds. However, the court did not consider whether the writing off of the AT-1 bonds was necessary but only looked at the decision-making process. Yes Bank argued that Section 36 AC of the RBI Act allows the administrator to exercise the board’s powers until a new board takes charge. “The court order is based on two grounds—the date of reconstruction and the administrator did not have the power after the scheme was notified. As far as the first ground is concerned, it is incorrect to say that the date of reconstruction could be the same as the date of notification because it does not take into account the period of implementation of the reconstruction. The second reason is contrary to the RBI Act that merely because the scheme was notified, the administrator cannot exercise any powers,\" said Rohan Dakshini, a lawyer representing Yes Bank and a partner at law firm Rashmikant and Partners. “The court’s observation on the deletion of the provision of the write-down from the final scheme makes no difference to the exercise by the bank of its contractual rights,\" he added. Following the Bombay high court ruling, bondholders of Lakshmi Vilas Bank also plan to seek an urgent hearing in the Madras high court against the RBI’s decision to write off tier-II bonds worth  ₹320 crore, as the government’s approved merger scheme also does not mention write-downs for these bonds. Elsewhere in Mint In Opinion, Manu Joseph says it’s a wonder what most Indian politicians actually do. CM Eknath Shinde writes Mahrashtra was a magnet for investment MoUs at Davos. L. Viswanathan & Madhav Kanoria explain how govt's proposals will strengthen insolvency code. Long Story tells how to explain the budget to your grandma.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/we-want-to-maximize-hni-retail-interest-in-adani-fpo\/amp-11674407211222.html","pub_date":"2023-01-22T22:36:50+05:30","title":"‘We want to maximize HNI, retail interest in Adani FPO’","keywords":"Adani Enterprises,fpo,sale,adani cfo,retail investors,Adani FPO","articles":"Adani group has been running investor outreach programmes for 3 years, says group CFO  Adani Enterprises Ltd, the flagship of the diversified Adani group, is exploring ways to garner maximum participation from retail investors and high-net worth individuals for its proposed  ₹20,000-crore follow-on public offer, which will be India’s largest so far. Adani Enterprises Ltd, the flagship of the diversified Adani group, is exploring ways to garner maximum participation from retail investors and high-net worth individuals for its proposed  ₹20,000-crore follow-on public offer, which will be India’s largest so far. “The FPO aims to maximize retail and HNI categories as they are inter-generational investors unlike mutual funds or domestic institutional investors, who have a much shorter horizon for investments,\" said Jugeshinder Singh, chief financial officer, Adani group. “There are some large family offices that can participate as institutions also, so they don’t have to participate as HNI. If they participate as institutions, that gives us more space for HNIs and regular investors, and allows us to have greater HNI and retail participation,\" he said when asked about interest evinced by institutional firms, given the meteoric rise in valuations of Adani Enterprises in the past few years. “The FPO aims to maximize retail and HNI categories as they are inter-generational investors unlike mutual funds or domestic institutional investors, who have a much shorter horizon for investments,\" said Jugeshinder Singh, chief financial officer, Adani group. “There are some large family offices that can participate as institutions also, so they don’t have to participate as HNI. If they participate as institutions, that gives us more space for HNIs and regular investors, and allows us to have greater HNI and retail participation,\" he said when asked about interest evinced by institutional firms, given the meteoric rise in valuations of Adani Enterprises in the past few years. “Having a core infra portfolio, these companies will be massively valuable, but their value accrues over a period of time. If you see Adani Transmission, the value accrued over a nine-year period; we started in 2012. Adani Green, we started incubating in 2011, and the value is now emerging. So we need those kinds of investors,\" he added. To draw retail investors, Adani Enterprises will offer an added discount of  ₹64 per partly paid-up share from the cut-off price. The price range for the FPO, running through 27- 31 January, has been fixed at  ₹3,112-3,276. Mutual funds, he said, had monetized less than 2% of Indian household wealth, allowing the group to potentially access a vast swathe of savings. It has been engaged in domestic investor outreach for the last three years, he said. “We have been running roadshows to reach domestic investors across cities: Delhi, Kolkata and Surat for five years, and next month, we will hit Rajkot to increase their count as shareholders across our group verticals. Our aim is to have 10 million retail investors. I am told by some investors that at the roadshows, they are seeing huge interactions between corporate and domestic investors, decades after what Dhirubhai Ambani would do on outreach programmes for domestic investors.\"  On steep valuations of group companies becoming a roadblock for potential retail investors, Singh said: “High equity valuations imply that people value our growth and this reduces our risk premium, which in turn will boost the value of our utility business.\" “We feel across infra like airports, for one, we can reduce tariffs and compete with the best like in Sydney,\" he added. After the  ₹20,000-crore proposed FPO, retail investors’ holding in Adani Enterprises will increase from around 1.4% to over 3%, while promoter shareholding will drop by 3.6 percentage points. Adani Enterprises’ shares have soared 174% from their 52-week lows in less than 10 months to  ₹4189.55 on 21 December. The stock has since corrected to  ₹3,456 apiece on 20 January. On why brokerages avoid including Adani group companies in their coverage universe, Singh said utility businesses are not tracked widely by analysts. But, this would change with time, he added. The follow-on public offer will see the group invest  ₹10,869 crore for capital expenditure requirements of the company’s subsidiaries in the green hydrogen ecosystem projects, existing airports and for construction of a greenfield expressway, while  ₹4,165 crore will be used to repay debt either partly or fully as well as for three subsidiaries—Adani Airport Holdings Ltd, Adani Road Transport Ltd, and Mundra Solar Ltd. The rest will be used for general corporate purposes, according to the offer document.  The group is also confident that its green hydrogen business will be operational in four years. “We are confident that by 2026, hydrogen will be at an operating cost of 25-30 cents. Depending on the rate of return requirement, we will sell it for between $1.80 and 2.30 a kg, which is lower than India’s LNG import cost. So, already it will compete without any government subsidy,\" said Singh. The group has invested $1.6 billion in the hydrogen ecosystem and has signed a memorandum of understanding with French energy major Total. It will be investing 25% equity in the business, he said. The Adani group is also looking at various partnerships for the airport business, he added.  “We have entered a joint venture in the duty-free area. In airports, you have specific elements that address a specific consumer base, and we are looking at other JVs in fuel services and public entertainment space, among others,\" Singh said.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/ongc-totalenergies-plan-joint-venture\/amp-11674406803927.html","pub_date":"2023-01-22T22:30:03+05:30","title":"ONGC, TotalEnergies plan joint venture","keywords":"ongc,totalenergies,jv,Oil and gas exploration,Andaman islands,Open Acreage Licensing Programme","articles":"Talking of the tie-ups and joint ventures, Rawat said apart from Total, the company is also looking for tie-ups with other major players in exploration and production, as well as carbon capture, among others  State-run energy major ONGC plans to tie up with French giant TotalEnergies for exploration and production of oil and gas in the Andaman islands, said Sushma Rawat, director, exploration at ONGC Ltd. In an interview, Rawat said that prospective hydrocarbon blocks are expected to be auctioned at the next round of auctions under the Open Acreage Licensing Programme for which both companies may bid as a joint venture. State-run energy major ONGC plans to tie up with French giant TotalEnergies for exploration and production of oil and gas in the Andaman islands, said Sushma Rawat, director, exploration at ONGC Ltd. In an interview, Rawat said that prospective hydrocarbon blocks are expected to be auctioned at the next round of auctions under the Open Acreage Licensing Programme for which both companies may bid as a joint venture. “For deepwater, talks are underway with Total. Andamans, which is coming up, is mostly deepwater. The government has an Island Exploration Project, a lot of seismic data is being acquired in the Andamans which will be processed and analysed. Within a month we will know whether Total would be coming there with us and in what way. With Total we still have to sign an MoU. The talks are in the final stages,\" she added. “For deepwater, talks are underway with Total. Andamans, which is coming up, is mostly deepwater. The government has an Island Exploration Project, a lot of seismic data is being acquired in the Andamans which will be processed and analysed. Within a month we will know whether Total would be coming there with us and in what way. With Total we still have to sign an MoU. The talks are in the final stages,\" she added. While the initial survey is being done by the Centre, she said the blocks would be up for auction either through the open acreage licensing policy (OALP-XI) round of auction or there may be a separate round for deepwater exploration and production. “We have prepared the blocks, we need to submit them,\" she said. The Centre has been ambitious with the National Island Exploration Project, seeking to reduce its import dependence for crude oil in a volatile global market scenario. Talking of the tie-ups and joint ventures, Rawat said apart from Total, the Maharatna company is also looking for tie-ups with other major players in exploration and production, as well as carbon capture, among others. “For international partnerships we had a global outreach programme, which was initiated 2-3 years ago by the then chairman-managing director of ONGC. In that area we have gone ahead, and held a lot of technical discussions and four MoUs have been signed right from ExxonMobil to Equinor to Chevron and all. So, we are looking forward to tie ups with Total and others right from exploration and enhanced oil recovery to carbon capture and renewables.\" In August 2022 ONGC signed an agreement with American oil and gas major ExxonMobil for deepwater exploration at India’s east and west coasts. The tie-up is expected to firm up by March-end, she said. “ExxonMobil (contract) is totally (for) deepwater. They have been looking at the data both at the east cost and west coast. They will let us know at the end of March, when their entire study is complete, and identify areas they would like to go for acreage bidding, or may be it will be a joint venture with ONGC,\" she said. She further said: “We are looking at joint venture between ONGC and ExxonMobil. Right now the technical teams are sitting together and analyzing the data we processed. With ExxonMobil its little bit ahead in terms of but they have given their timeline as March end for them to decide, whether they will come in for a partnership for bidding and exploration.\" Rawat added that ONGC is likely to announce a partnership with French company IFP in a month’s time for technical domain, software model building and interpretation in order to reduce uncertainty and assure risk management. Speaking on company pilot project for carbon capture, utilization and storage (CCUS) for which ONGC has tied up with Norwegian state-owned energy company Equinor, the director (exploration) said that both the companies will discuss the timeline for the project, required investment and if other players need to be involved in the project. She also said that talks are underway with Indian Oil Corporation Ltd (IOCL) for the procurement of carbon dioxide from the company and the required investment amount would depend upon the cost for carbon dioxide procurement. “We want to take in carbon dioxide and pump it underground, store it in the field which has been producing for a very long time now. So, that is Gandhar in the Cambay basin. For that we have a tie up with the Equinor. They have their project Northern Lights in the North Sea. We would be requiring carbon dioxide from Indian Oil Corporation. For them it is a waste product that we will pump in into the reservoir.\"","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/automation-to-pick-up-pace-during-recession-shukla\/amp-11674406395835.html","pub_date":"2023-01-22T22:23:15+05:30","title":"Automation to pick up pace during recession: Shukla","keywords":"Automation Anywhere,Mihir Shukla,automation,RPA,robotic process automation,ChatGPT,recession","articles":"India has been a great source of talent and innovation for us and it continues to be. We are strengthening our place in India with two R&D centres in Bengaluru and Baroda, said Shukla  After covid-led business disruptions prompted firms to turn to robotic process automation, or RPA, robotics solution providers are expecting another wave of mass adoption on the fear of a recession, and resultant layoffs. Mihir Shukla, chief executive, Automation Anywhere Inc., a US-based RPA solutions company, believes it will play a key role for firms and sectors due to its speed and scale. After covid-led business disruptions prompted firms to turn to robotic process automation, or RPA, robotics solution providers are expecting another wave of mass adoption on the fear of a recession, and resultant layoffs. Mihir Shukla, chief executive, Automation Anywhere Inc., a US-based RPA solutions company, believes it will play a key role for firms and sectors due to its speed and scale. In an interview, Shukla spoke about how firms are adopting automation, disruptive role of platforms like ChatGPT and more. Edited excerpts: In an interview, Shukla spoke about how firms are adopting automation, disruptive role of platforms like ChatGPT and more. Edited excerpts: We heard about Automation Anywhere’s IPO plan. Has it been delayed? We are growing fast, creating a very compelling product on cloud automation, which is being used by more than 70% of our new customers. We are very excited with the business we’re building and will look for an opportune moment to float our public offer. Your key markets are North America and Europe but have you seen faster growth in India after the covid-19 led digital transformation wave? India has been a great source of talent and innovation for us and it continues to be. We are strengthening our place in India with two R&D centres in Bengaluru and Baroda. We are seeing growing interest from local enterprises in adopting automation. With well-known brands in India scaling their businesses, they find a need for speed and scale. We are seeing some large private banks, oil and gas companies adopting and scaling automation, and are seeing traction in healthcare, telecom, and manufacturing in India, and a great deal of interest from governments. Has the economic crisis impacted the adoption of automation? Because of speed and scale automation is the solution to turn to in a time of recession and inflationary pressures, as we all are experiencing. I think you will have seen this in past recessions as well. You will see even faster adoption of automation across all enterprises. What are your plans in India in terms of hiring and investments? We are strengthening our teams in India:R&D and to serve enterprises. Over 50% of our global workforce sits in India and that speaks for itself. The team has led the work on some of the most cutting-edge products we have launched recently. Many firms are working on integrating ChatGPT into their services. Will it become mainstream soon? Most technologies start as entertainment initially. Technologies that have capabilities like ChatGPT will become more and more mainstream. ChatGPT is an example of where we are going and what’s to come. AI can be a great tool to answer questions. I think one of the things we as humans will have to get better at is thinking about what are the right questions. There is no AI software in the world that can tell you what the right question is.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/commodity-prices-may-be-range-bound-in-23-jsw-cfo\/amp-11674406188924.html","pub_date":"2023-01-22T22:19:48+05:30","title":"Commodity prices may be range bound in ‘23: JSW CFO","keywords":"JSW,Steel,domestic prices,Seshagiri Rao,commodity prices,earnings","articles":"JSW Steel Ltd’s net profit plunged 90% in the December quarter from a year earlier, and the earnings also trailed analysts’ expectations  JSW Steel Ltd’s net profit plunged 90% in the December quarter from a year earlier, and the earnings also trailed analysts’ expectations. However, Seshagiri Rao, joint managing director and group chief financial officer, said a sequential analysis would do more justice to the financial performance. JSW Steel Ltd’s net profit plunged 90% in the December quarter from a year earlier, and the earnings also trailed analysts’ expectations. However, Seshagiri Rao, joint managing director and group chief financial officer, said a sequential analysis would do more justice to the financial performance. “The results have to be seen in the context of Q3 versus Q2, rather than year-on-year because last fiscal year was an aberration,\" he said in an interview. “Last year, steel prices were very high, and raw material price increase took some time to catch up, resulting in exceptionally robust margins posted by steel companies. However, the current year saw steel price corrections post-May, and margins also got normalized.\"  “The results have to be seen in the context of Q3 versus Q2, rather than year-on-year because last fiscal year was an aberration,\" he said in an interview. “Last year, steel prices were very high, and raw material price increase took some time to catch up, resulting in exceptionally robust margins posted by steel companies. However, the current year saw steel price corrections post-May, and margins also got normalized.\"  “We have booked inventory losses in Q1 and Q2 of this fiscal year, and added to that, the rupee has depreciated from 75 to 82 to a dollar. Therefore, a quarter-on-quarter comparison will be appropriate,\" he added.  After reporting a loss of  ₹915 crore in the September quarter, the company posted a net profit of  ₹474 crore in Q3 compared to  ₹4,516 crore a year earlier. “It is a big turnaround with a swing of almost  ₹1,400 crore,\" Rao said.  The sequential rise was helped by the highest-ever production for JSW Steel, besides a bigger share of business in the automotive sector at 33% on the back of record domestic vehicle sales. Steel dispatches to makers of tinplate, appliances, and wind and solar energy have also increased.  Nevertheless, despite good domestic volumes, JSW Steel’s inventories rose to 180,000 tonnes in Q3, primarily due to a steep drop in exports, which fell by 32% and accounted for 7% of production. Consequently, total sales volume was lower by 2% sequentially.  Rao said JSW Steel’s financial turnaround on a sequential basis was made possible by a reduction in costs by  ₹7,900 per tonne, which improved earnings before interest, taxes, depreciation and amortization (Ebitda) per tonne from  ₹3,460 in Q2 to  ₹8,150 in Q3. The performance of its units also improved compared to Q2 from  ₹10 crore to  ₹517 crore, resulting in consolidated Ebitda rising to  ₹4,547 crore, he added. Rao expects steel demand to stay robust in Q4, as is normally the case in the last quarter of a financial year. The auto sector typically sees an uptick in sales in Q4, compared to Q3, and state governments also have more budgets. That apart, higher agriculture-related capex and increased activities for residential real estate would result in more demand for construction equipment as well as compressors, textile machinery, paper machinery, and wagon and locomotive manufacturing, which will boost demand for steel, he added.  Steel demand in Q3 was 30 million tonnes, which Rao expects to grow by two million tonnes in Q4, taking total demand to 118 mt for FY23, up 11%. Exports may also improve due to the rollback of duty in November and the easing of covid policy in China, resulting in the restocking of material globally.  “Prices have become attractive for exports, and removal of export duty will help us compete in international markets,\" Rao said. Indian steel prices are at a 6% discount to imports, which may lead to price hikes for domestic steel.  Rao, however, said commodity prices would remain range bound in 2023. “The rate hike cycle in the global economy is likely to continue though the pace may reduce. Inflation in Europe and the US is very high, and inflation targeting remains at 2%. Debt-to-GDP ratio in many countries is also very high, and so we are not very optimistic about global demand recovery,\" said Rao.  The only area for all the triggers is from China opening up. “Commentary coming is that the Chinese government is more focused on consumption-led growth than investment-led growth. Prices have improved in China and Europe, in the US, too, compared to November; however, they are still down from the highs in March-April,\" Rao added.  With raw material prices rising from the lows in November, Rao said coal and iron ore prices would not sustain. Most steel companies have announced capex and expansion plans to meet demand in the domestic market. JSW Steel, too, is increasing capacity by 10mt. Out of the capex allocation of  ₹49,000 crore,  ₹15,000 crore will be spent in FY23, and  ₹34,000 crore over the next two years, said Rao.  Meanwhile, JSW Steel is scouting for more iron ore mines and will participate in auctions. It is investing in iron ore beneficiation plants in Odisha and slurry pipelines to cut the cost of transportation to ports. Rao said JSW Steel’s units would perform better in the March quarter. He said carrying forward of coking coal inventory from Q3 to Q4 will ensure that there won’t be any impact of the current spike in coking coal prices.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/travel-biz-recovery-to-pick-up-in-2023-says-thomas-cook\/amp-11674405728686.html","pub_date":"2023-01-22T22:12:08+05:30","title":"Travel biz recovery to pick up in 2023, says Thomas Cook","keywords":"teavel,aviation industry,menon,thomas cook,G20 summit","articles":"Aviation industry is grinding through a shortage in supply of new aircraft, and many airlines have not returned to their full seat capacity. These factors have driven up fares, but Menon expects fares to fall towards the end of the year  As concerns about a severe recession in the West recede, India’s travel business will recover stronger than before in 2023 on the back of high domestic travel demand, recovery in business travel and India’s hosting of the G20 summit, said Madhavan Menon, chairman and managing director, Thomas Cook India Ltd. As concerns about a severe recession in the West recede, India’s travel business will recover stronger than before in 2023 on the back of high domestic travel demand, recovery in business travel and India’s hosting of the G20 summit, said Madhavan Menon, chairman and managing director, Thomas Cook India Ltd. “India’s travel recovery has stood out globally at an economic level and that is very visible in our industry also. People are going to continue to take holidays,\" Menon said in an interview. “India’s travel recovery has stood out globally at an economic level and that is very visible in our industry also. People are going to continue to take holidays,\" Menon said in an interview. Aviation industry is grinding through a shortage in supply of new aircraft, and many airlines have not returned to their full seat capacity. These factors have driven up fares, but Menon expects fares to fall towards the end of the year. On the other hand, hotel rates will be set by supply and demand. Globally, they may settle down only after the second quarter of the new fiscal year. “Domestic demand, though, is huge in India, especially in locations like Goa, Rajasthan and Kashmir. Even city hotels are exhibiting high prices and the domestic demand, both tourism and business-linked, will continue to stay high,\" said Menon. Fairfax-owned Thomas Cook India was earlier focused heavily on European travel in terms of international outbound leisure tourism, but today, Asia and domestic travel dominate its business, with Europe re-emerging and the US expected to re-emerge later. Menon is confident that for long-haul travel too, this year will be better than last when it suffered due to visa issues, capacity caps and high airfares. “Covid changed the way we viewed the customer. We value them much more than we did before. There is a so-called “new customer\" who had never transacted with us before. We discovered a younger generation approaching us, and this was partly aided by the fact that we updated our technology and made it an omni-channel approach,\" added Menon. Earlier, only about 4% of the company’s transactions happened digitally. Today, that number has grown to 14%. It intends to take these up to 35%. India’s presidency of the G20 could also add to hotel demand, for which the company is providing services to the government. While Menon did not comment on how much he expects the government to spend, industry estimates peg it at  ₹900-1,200 crore.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/pleasantly-surprised-with-quality-of-indian-merchandise-authentic-brands-stupp\/amp-11674403626290.html","pub_date":"2023-01-22T22:00:14+05:30","title":"Pleasantly surprised with quality of Indian merchandise: Authentic Brands’ Stupp","keywords":"Authentic Brands,Walt Disney,Reebok,Brooks Brothers,Nautica,Forever21","articles":"Identifying the right collaboration partners is key to our India strategy. The demand for Indian fashion is increasing, and we’re seeing it, Stupp said  MUMBAI :Authentic Brands Group, the world’s second-largest brand owner and licensor globally after Walt Disney, sees India as a significant market for licensing its brands, including Reebok, Brooks Brothers, Nautica, and Forever21, to retailers. The group is scouting for more partners across retail, wholesale and manufacturers and is hoping to collaborate and take some Indian brands to global markets, too, said Henry Stupp, president of India and EMEA at Authentic Brands. In an interview, he spoke about opening an office in India and why it’s an exciting market. Edited excerpts: MUMBAI :Authentic Brands Group, the world’s second-largest brand owner and licensor globally after Walt Disney, sees India as a significant market for licensing its brands, including Reebok, Brooks Brothers, Nautica, and Forever21, to retailers. The group is scouting for more partners across retail, wholesale and manufacturers and is hoping to collaborate and take some Indian brands to global markets, too, said Henry Stupp, president of India and EMEA at Authentic Brands. In an interview, he spoke about opening an office in India and why it’s an exciting market. Edited excerpts: Are you looking at opening an office in India? Are you looking at opening an office in India? Yes, very soon, probably within the year. The idea is to always identify the best-in-class partners, whether they’re wholesalers, manufacturers or retailers. And once they’re identified, we have to remain engaged constantly. We want to understand their business. We want to be the connective tissue, bringing a wholesaler to a retailer and introducing the retailers to our licensing partners. You just can’t do that remotely. You have to be in the markets, and we’re seeing a lot of success in putting in-country managers and country teams in certain markets. And dotting the i’s and crossing the t’s has been a very, very effective way of working. What kind of opportunity do you see here? We have about 15 partners in India, and are still in the early stages. While these are some exceptional partners, we need to do a lot more. We probably have tripled the number of partners in 12 months, but many of our brands still haven’t been licensed. We’re still in the process of identifying the right partners, whether they’re wholesalers or retailers. And so I’m spending more and more time here. This is my third trip here in the last 12 months, and I’ll be back again in March. Identifying the right brands or collaboration partners is going to be critical to our India strategy. The demand for Indian fashion is increasing, and we’re seeing it. I think, eventually, it’s going to break through into many other global markets. So when we look at our brands like Brooks Brothers, there should be an Indian component. It should be designed in India and probably produced here. And then there’s the whole opportunity of doing Indian collaborations with our brands to make them relevant for each market. That’s sort of the strategy that we’re planning on following. And then, to be honest with you, I think that in time, there will be brand opportunities that will come out of India that we’ll want to introduce to other parts of the world. Will you be looking to take Indian brands to other markets? Absolutely. I have a very simple belief that a good product should be accessible to anyone, anywhere, anytime. What is your view of manufacturers in India? I’ve watched the evolution of the manufacturing base in India get better and better each and every year. I have not left without being pleasantly surprised on my last few trips about the quality of the merchandise being produced, and I’m excited to see where you’re going to be in the coming years. Certainly, the government is encouraging domestic manufacturing through some of the new importation rules that have been put in place that should allow the domestic industry to catch up to other markets. You have the technology, labour force, and natural resources. It’s just a matter of time before I think that it will continue to grow. The interesting thing is, will the rise of domestic manufacturing and the affluence associated with it result in more Indian goods remaining in India, which is what we saw in China. For Authentic Brands, where does India stand? India is an emerging market for us, and that’s why I felt that it was an incredible opportunity for me to be able to work in India and take a view of working on developing a strategy that’s unique for India. There are also important lessons to be learnt from other emerging markets, including the Gulf, North Africa, and Sub-Saharan East Africa, and shared between all these different regions. I look at what Authentic Brands is doing in Turkey, which has some of the most amazing dynamic operators and is able to take good lessons learned and introduce them to other markets. It’s actually one of the more exciting parts of my job. And how big is the luxury brands market in India? Data says it’s about $5 billion today in retail value, and it’s anticipated to grow 10 to 12% a year, which is slightly ahead of your GDP, which I think is running about 8% right now. So it is a very, very resilient category. It’s highly sought after, and in the overall scheme of things, even though $5 billion is a significant market, it’s still a small piece, and that’s why it retains such resiliency. Who are your big partners in India? Reliance, Aditya Birla, Myntra, Flipkart, and KG Denim are a few of our partners here. I believe we have a good group of partners. What is your view on the regulatory environment regarding the retail sector in India? Every country has challenges in one way or another. I think that India is moving in a direction to address it. What is really going to drive changes in legislation is how technology is going to lead to more organised retail, where right now, it’s still highly unstructured. I think the current statistics show that only 10% of Indian retail is structured. That will change, and we’ve seen that happen in North Africa, East Africa, and many other markets. Technologies will lead to consolidation as it brings better value to the consumers, so that’s a natural evolution in all markets. And technology will drive it towards fewer, bigger and better retailers. How big is counterfeit as a challenge? It’s obviously a very big challenge, one we deal with on a daily basis. It’s also true that when you’re not being knocked off, you know, where’s your brand heat? Having said that, I don’t personally know what size it is. I don’t think it is material for our portfolio, particularly in this part of the world where we’re still growing, you know. We have recently come across counterfeit merchandise of Reebok, Nautica, Brooks Brother, as well as Juicy Couture, and so we are dealing with it. As the brand heat grows, we see more and more counterfeits in the market. The easiest way of addressing counterfeit merchandise is to make sure that you have a good supply chain. That is the number one way of stopping it. Have supply chains improved now after the pandemic? The pandemic led to shortfalls in the lack of availability of certain components, but that was not just for our industry. Look at the automotive industry in Europe; you can’t get computer chips. They’re selling cars now in Europe, where you have to come back six months later to get your navigation system installed. We faced unavailability of components, factory closures etc. Now the impact on fuel prices is something that’s going to be sitting right in front of us. With China reopening, it is going to lead to increasing capacity, which is good news, but it is also going to drive up fuel demands because China being shut down really kept fuel prices, on a global basis, largely under control.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/diesel-engines-will-dominate-trucking-biz-until-next-decade\/amp-11674403045798.html","pub_date":"2023-01-22T21:36:21+05:30","title":"‘Diesel engines will dominate trucking biz until next decade’","keywords":"cummins india,ICE,internal combustion engines,hydrogen-IC engines,fuel cells,biofuels,natural gas","articles":"The company believes that diesel engines and flex-fuel options that use biofuels, blended ethanol and natural gas will remain dominant as India transitions to fully green technologies.  NEW DELHI :Cummins India, a maker of diesel internal combustion engines, believes that while alternative fuel technologies such as hydrogen-IC engines and fuel cells could help the trucking sector go green, they won’t be adopted widely until the next decade due to significant infrastructure requirements. NEW DELHI :Cummins India, a maker of diesel internal combustion engines, believes that while alternative fuel technologies such as hydrogen-IC engines and fuel cells could help the trucking sector go green, they won’t be adopted widely until the next decade due to significant infrastructure requirements. The company believes that diesel engines and flex-fuel options that use biofuels, blended ethanol and natural gas will remain dominant as India transitions to fully green technologies. The company believes that diesel engines and flex-fuel options that use biofuels, blended ethanol and natural gas will remain dominant as India transitions to fully green technologies. The company is investing in building electrolyzers in India to generate green hydrogen for hydrogen fuel cell vehicles and fuel-agnostic platforms for Indian commercial vehicle makers as they transition to emissions-free technologies between 2040 and 2050, Ashwath Ram, managing director of Cummins India, said in an interview. “Ninety-nine per cent of everything we sell in India today is diesel-powered, and about 1% utilizes natural gas. Between now and 2030, we think that the CNG, LNG, biofuels and blended ethanol fuels could probably get to as high as 15%, and about 85% will continue to be with diesel, but between 2030 and 2040, we think the percentage of all those other fuels, including hydrogen, can go to 30%, and then in the 2040 to 2050 timeframe, we think we can get to 50:50. For a country like India, the time between 2050 and 2070, which is when we have committed to achieving net zero-carbon emissions, the remaining portion will also convert to green fuels\", Ram said. “The way we think about destination-zero is that it will not be a cliff event but a gradual journey towards zero. And our concern is what we can do today. In this decade, we are cleaning up the technologies. We are making our products more efficient and introducing several other platforms, such as LNG, CNG, biofuels and blended mixes with ethanol.\" According to Ram, it will take at least two decades for hydrogen-powered vehicles, particularly fuel cells, to gain wide adoption in India due to challenges such as lack of green hydrogen availability and storage, high cost of hydrogen IC-engines and fuel cell technologies, and regulatory bottlenecks. “Hydrogen storage and transport regulation in India says that 350 bar is the maximum pressure at which tanks can be used for hydrogen transportation. Around the world, the standard has already moved to 700 bar. When you move from 350 to 700 bar, you can store double the amount of fuel because it’s pressurized,\" Ram said. “So this regulation will have to change, and it will, as the world has already changed to that standard.\" Secondly, storage tanks for hydrogen are currently not built locally. “These tanks are built from carbon fibre. We need a supply of carbon fibre, which is produced by only a few companies in the world. It’s not produced in bulk volume in India as of now; so that infrastructure needs to be set up,\" Ram said. Additionally, hydrogen production for mobility will have to ramp up. “Today, most of the hydrogen produced is used up in the petrochemical processes to produce ammonia and decarbonize steel. So, where is hydrogen available for use in the mobility space? The industry will have to start generating excess hydrogen just for mobility. Besides this, all hydrogen being produced today is what’s called grey or blue hydrogen right out of the petrochemical process. It’s not green hydrogen, which solves only part of the problem of zero-emissions, not the complete problem\", Ram said, adding that Cummins is also setting up electrolyzers in India to produce green hydrogen. Lastly, hydrogen-IC engines currently cost roughly twice that of a comparable diesel engine, while a fuel cell vehicle comes with nearly five times the cost today. “There is a huge catch-up between where fuel cells are from a cost perspective, to where hydrogen ICE can get to quickly. We see that hydrogen-IC engine is a strong bridge for India and can be a dominant technology for 25-30 years before fuel cells become viable,\" he said.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/turbulence-at-go-first-spicejet-may-continue\/amp-11674402658943.html","pub_date":"2023-01-22T21:26:49+05:30","title":"Turbulence at Go First, SpiceJet may continue","keywords":"gofirst,spicejet,airlines,indigo,vistara,go first,aviation","articles":"Lack of  funds key hurdle as airlines weather a long  crisis that has spilled over into 2023  NEW DELHI :The prolonged air travel disruption caused by the pandemic has taken a heavy toll on airlines, especially two of India’s oldest budget carriers, Go First and SpiceJet, which lacked the funds to weather a long crisis period. NEW DELHI :The prolonged air travel disruption caused by the pandemic has taken a heavy toll on airlines, especially two of India’s oldest budget carriers, Go First and SpiceJet, which lacked the funds to weather a long crisis period. Go First and SpiceJet started flight operations in 2005, followed by the market leader, IndiGo, in 2006. As of 2022, IndiGo holds the largest share of the domestic market at 56.1%, followed by Vistara at 9.2%, Go First at 8.8%, and Air India and SpiceJet tied at 8.7% each. Go First and SpiceJet started flight operations in 2005, followed by the market leader, IndiGo, in 2006. As of 2022, IndiGo holds the largest share of the domestic market at 56.1%, followed by Vistara at 9.2%, Go First at 8.8%, and Air India and SpiceJet tied at 8.7% each. “The shutdown of air travel and resultant weak travel sentiment during 2020-21 has had a more severe impact on the airlines which did not have enough liquidity to deal with long periods of low revenue environment. Clearly, SpiceJet and Go First have been affected and need fund infusion to maintain course,\" an industry executive said, requesting anonymity. Supply chain challenges further compounded their struggles last year, leading to delayed delivery of engines and aircraft parts. Go First, for example, only received its 55th fuel-efficient Airbus A320neo aircraft after a delay of almost one-and-a-half months. Despite having a fleet of 60 planes, including 5 Airbus 320ceos, 20-25 of its planes were grounded in the last three months due to engine and parts shortages. “Pratt & Whitney had provided 17 serviceable engines in December, and we could make eight aircraft serviceable. Similarly, we expect 20 serviceable engines by February-March,\" said a Go First spokesperson. “We are in the process of taking delivery of eight new aircraft from Airbus from January to June, which will take the fleet to 68.\" The spokesperson said the airline would add a new aircraft in two days. While Go First has so far availed loans of around  ₹590 crore under the Emergency Credit Line Guarantee Scheme 3.0 (ECLGS), its proposed  ₹3,600-crore initial public offering has been delayed. The airline is evaluating the opportunity for an IPO from time to time and will be ready to take steps, the spokesperson said. SpiceJet has also been experiencing a host of issues, including delays in the induction of MAX aircraft and fundraising. The separation and stake sale in its profitable arm SpiceXpress has faced several hurdles. “They are trying to raise capital by hiving off cargo and possibly raising funds from strategic and financial investors. Without funding, frankly, there is no game, and they realise it,\" Kapil Kaul, chief executive and director of Centre for Aviation, said. Out of its fleet of 68 aircraft, 25 have not been in operation for seven days, leaving an operational fleet of 43 planes. Lack of funds is also impacting the airline’s ability to expand operations. In January-November, SpiceJet flight departures stood at 82,512, down 47% from the same period in 2019, while for Go First, flight departures fell 22.5% to 66,740 flights. IndiGo departures in the same period were at 452,798 flights, up 6% from 2019. For Vistara, flight departures in the period were 48% more than in 2019, or pre-covid levels at 72,615 departures. 2023 will be a year of intense competition between IndiGo and the Tata-run Air India group airlines. However, the situation will be even more crucial for SpiceJet and Go First to accelerate their fund infusion process, an aviation industry analyst said, requesting anonymity.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/microsoft-faces-the-highest-bar-in-tech\/amp-11674401989098.html","pub_date":"2023-01-22T21:22:50+05:30","title":"Microsoft faces the highest bar in tech","keywords":"Microsoft,Tech","articles":"Plan to lay off 10,000 workers shows pressure company faces to keep margins high  Microsoft might be planning to do more with less. Investors expect it to do a lot more.  Microsoft might be planning to do more with less. Investors expect it to do a lot more.  The software giant is heading into its second fiscal quarter earnings report on Tuesday facing a slumping PC market, a slowing corporate software market and even unclear demand for its once-hot cloud computing services.  The software giant is heading into its second fiscal quarter earnings report on Tuesday facing a slumping PC market, a slowing corporate software market and even unclear demand for its once-hot cloud computing services.  Microsoft’s dim forecast three months ago gave investors an early heads-up, and its plan to join other big techs in a recent layoff wave seemed to drive the point home further. “We will have to do more with less,\" Chief Executive Satya Nadella told the World Economic Forum in Davos, Switzerland, last week, before the company announced plans to cut 10,000 jobs from its payroll.  That would appear to set a low bar for the coming report. Analysts estimate that Microsoft’s revenue for the December quarter grew only 2.7% year over year to $53.1 billion—the company’s lowest growth rate in nearly six years. Growth for the company’s crucial Azure public cloud service is expected to hit a record low 30.5% year over year—a deceleration of nearly 5 percentage points from the September quarter.  Revenue in the personal-computing segment that includes the Windows business is expected to slide 14% year over year—a sharp reversal from the 15% growth logged in the previous year’s December quarter, when the company was still benefiting from the pandemic-induced PC sales boom.MINT PREMIUMSee All\n  Microsoft’s forecast for the March quarter and its outlook for the rest of the year will prove essential. Wall Street expects growth to pick back up in the second half of the calendar year. More crucially, Microsoft is expected to maintain annual operating margins above 40%—the highest among the big tech peers including Apple, Amazon.com and the parent companies of Google and Facebook. Wall Street’s projected operating margin of about 41% for Microsoft in calendar year 2023 is nearly 5 percentage points higher than what the company averaged over the five-year period running from 2017 to 2021 and is a much larger margin improvement than what the other four big techs are expected to show over the same period. Can the company pull that off? Maybe. Corporate tech officers are indeed cutting back their spending plans; Gartner projected that worldwide IT spending will grow 2.4% this year—less than half the growth rate the market research firm predicted three months ago. Microsoft is still in a prime position given that it runs the second-largest public cloud service and owns many of the software tools and applications that are still central to business life. A recent survey by Morgan Stanley found that 38% of chief information officers rank Microsoft’s Azure as their preferred cloud provider, compared with 31% for Amazon’s larger AWS service. But Microsoft still has a lot of exposure to the PC market, which is in free fall. IDC reported earlier this month that PC unit sales slid 28% year over year in the fourth quarter—the biggest drop that the market research firm has seen in years—and doesn’t expect recovery for the industry until 2024. Analyst John DiFucci of Guggenheim downgraded Microsoft to a sell rating on Jan. 17, citing both the PC slowdown and Microsoft’s strong exposure to small businesses, which he says “typically fare worse than enterprises in a macro slowdown.\" Even cutting 10,000 workers might have a limited impact. That is only one-quarter of the employees Microsoft added in the fiscal year that ended in June 2022, which included the company’s acquisition of Nuance Communications. In his email to employees announcing the layoffs, Mr. Nadella made clear that “we will continue to invest in strategic areas for our future,\" which includes the adoption of potentially expensive AI technology like ChatGPT across the company’s products. Microsoft’s highly successful transition into a cloudcentric company has deservedly earned it the faith of investors. Its ability to maintain high margins in the face of a possible recession will test that faith. This story has been published from a wire agency feed without modifications to the text","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/homeowners-struggle-to-get-pandemic-aid-meant-to-stop-foreclosures\/amp-11674397570205.html","pub_date":"2023-01-22T20:05:33+05:30","title":"Homeowners struggle to get pandemic aid meant to stop foreclosures","keywords":"Homeowners,Pandemic","articles":"The $10 billion Homeowner Assistance Fund has been slow to distribute funds  Peter and Nancy Rosalez found out in November they were eligible for up to $25,000 in government money to keep from losing their house to foreclosure.  Peter and Nancy Rosalez found out in November they were eligible for up to $25,000 in government money to keep from losing their house to foreclosure.  But their mortgage company had gotten permission to foreclose on their Middletown, Ohio, home and was about to sell it. The money sat unused while an auction of the home went forward.  But their mortgage company had gotten permission to foreclose on their Middletown, Ohio, home and was about to sell it. The money sat unused while an auction of the home went forward.  “The mental anguish we’ve been through with this house and trying to save this house—it’s just been ridiculous,\" Mrs. Rosalez said.  The federal government allocated funds for distressed homeowners as part of its expansive efforts to help Americans cope with the pandemic’s financial strains. Unlike some other stimulus programs, such as checks mailed to individuals, this money moved slowly.  The nearly $10 billion Homeowner Assistance Fund was administered through the U.S. Treasury Department, but relied heavily on individual states to set up programs to distribute aid. Some were slow to get up and running. Others struggled with a backlog of applications. For homeowners, getting money before the foreclosure went through could be a race against time.  The money ultimately came through for Mr. and Mrs. Rosalez, but it came down to the wire. Expecting to be forced out of their home, the couple had packed up their belongings.  “The homeowner shouldn’t be fighting on two battlefronts,\" said Jim Kowalski Jr., chief executive officer of Florida’s Jacksonville Area Legal Aid Inc. That was common during the previous financial crisis, when millions lost their homes, he said. “You learned this lesson.\"MINT PREMIUMSee All\n  The fund doled out about $2 billion to more than 150,000 households through the end of September, according to the National Council of State Housing Agencies, a trade group. The money serves a narrow slice of the population: There were some 324,000 foreclosure filings last year, below prepandemic norms but more than double 2021, according to real-estate data firm Attom. The funds were made available to homeowners who experienced pandemic-related hardships and whose household incomes were below a certain threshold. Most states gave the money as grants. About 200 homeowners have complained about the program through the Consumer Financial Protection Bureau’s complaint portal, including a handful about foreclosures moving forward while they were waiting on assistance. CFPB warned in March that foreclosing on a borrower who has a pending assistance application “will merit increased scrutiny.\" Government officials, as well as representatives of mortgage companies and states, said the assistance program has picked up speed, particularly in recent months, and everyone is working together. Servicers benefit more from taking the money than taking the home in a foreclosure, they said. The program “has already provided much-needed assistance in all fifty states to over a hundred thousand low-income families,\" said Gene Sperling, who coordinates the rollout of the Biden administration’s 2021 relief package, in a statement. Servicers must pause foreclosure proceedings for 60 days when a homeowner with a Fannie Mae or Freddie Mac loan applies for funds. But they don’t have to do so for Department of Veterans Affairs loans and other government-backed mortgages. A group of federal agencies urged servicers to halt foreclosures for pending applications in such cases but stopped short of requiring it. Mr. and Mrs. Rosalez had paused payments on their VA mortgage in 2021 under a Covid forbearance program. Conversations about a loan modification with their mortgage servicer, a unit of MidFirst Bank, didn’t result in a deal, according to Stephanie Moes, their legal aid attorney. The bank filed to foreclose in early August, and a court granted the request the next month. The couple filed an application in early October to Save the Dream, the Ohio program run by the state’s housing-finance agency to distribute homeowner aid. They learned they were eligible for the program in November, just before a scheduled sheriff’s sale of the house. Mrs. Rosalez emailed their eligibility letter to the bank. The sale went ahead and the bank was the winning bidder, which would allow it to evict the homeowners. In late December, Mrs. Rosalez called the bank’s law firm. “If you have a heart, please reinstate us and let us get all this right,\" she said in a message. After The Wall Street Journal contacted MidFirst in early January, the bank asked the court to rescind the foreclosure, which was approved. A spokeswoman for the Ohio Housing Finance Agency said funds are being applied to reinstate their mortgage and cover up to six months of future payments. “Once we learn someone has been approved for HAF, our policy is to take action immediately, including as appropriate initiating the process to rescind foreclosure,\" a spokeswoman for MidFirst said. Defenders of the program say states like New York and Texas are running smoothly. That isn’t the case everywhere, though. William Steinwedel, an attorney at Maryland Legal Aid Bureau, said one of his clients lost his home during a monthslong wait for assistance. In New Mexico, some homeowners are waiting months just to receive confirmation that their applications have been received, according to Eric Sutton, an attorney at the Albuquerque nonprofit United South Broadway Corp. “There are some states that are taking an alarming amount of time,\" said Stacey Tutt, an attorney who coordinates homeowner assistance at the National Housing Law Project. Homeowners who get approved after a lengthy delay might find their unpaid debt has gone up meanwhile, forcing them to use more assistance money to get their loans back on track, Ms. Tutt said. Because the fund has a fixed amount of money, that means less for other applicants. Some haven’t been able to use the money at all. Christopher Elia started the process for homeowner assistance on his Orange Park, Fla., home in April, soon after his mortgage company filed for foreclosure. “I stressed every day,\" Mr. Elia said. “I was afraid to answer the door.\" In October, he was approved for up to $50,000 in assistance. But because of missed payments and the servicer’s attorney fees, he owed more than $54,000 to reinstate the loan. Mr. Elia said he wasn’t able to come up with the additional money. The $50,000 went unused. Marissa Vetter, Mr. Elia’s housing counselor at Jacksonville Area Legal Aid, said she believes he could have used the assistance money if the unpaid debt hadn’t ticked higher while Mr. Elia waited. A spokeswoman for Florida’s Department of Economic Opportunity, which administers the state program, said Mr. Elia took three months to finish his application, delaying the process. Mr. Elia said he submitted his initial application promptly, but additional requests from the state delayed its completion. Weeks would pass in between requests, but he provided information as soon as he could, he said. The spokeswoman for the Florida agency defended its handling of aid applications, saying the state “stretched every available dollar to serve as many homeowners as possible.\" To reinstate his loan, Mr. Elia agreed with the servicer to extend the repayment term from 14 years to 40 with a higher monthly payment. He is hoping to get money from the program to cover some payments on the modified loan. A spokeswoman for Mr. Cooper Group Inc., the parent company of Mr. Elia’s mortgage servicer, RightPath, said the company continues to work with him. Mr. Kowalski, of Jacksonville Area Legal Aid, wrote a letter to federal regulators in November hoping to draw attention to Mr. Elia’s case. “You must do better,\" he wrote. This story has been published from a wire agency feed without modifications to the text","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/layoffs-often-leave-companies-worse-off\/amp-11674394634973.html","pub_date":"2023-01-22T19:12:31+05:30","title":"Layoffs often leave companies worse off","keywords":"layoff,layoff season,amazon layoff,twitter layoff,microsoft layoff,wipro layoff,google layoff,tech industry layoff,meta layoff","articles":"Job cuts alienate customers and sap morale among employees who have to pick up the slack.  Employers these days seem to feel they have plenty of employees — maybe even too many as the economy slows down. That’s what’s driving layoffs of tens of thousands of workers in tech, banking and other industries. Employers these days seem to feel they have plenty of employees — maybe even too many as the economy slows down. That’s what’s driving layoffs of tens of thousands of workers in tech, banking and other industries. But executives should be careful about making deep cuts. Because as the last three years have reminded us, having too few workers is almost always worse than having too many. When organizations are shorthanded, morale plunges and profits suffer. And companies often end up investing immense time and effort to rebuild their workforces not long after whittling them down. But executives should be careful about making deep cuts. Because as the last three years have reminded us, having too few workers is almost always worse than having too many. When organizations are shorthanded, morale plunges and profits suffer. And companies often end up investing immense time and effort to rebuild their workforces not long after whittling them down. “The good companies, whether they’re slightly understaffed or slightly overstaffed, if they’ve got that culture of innovation they will do really well in a recession,\" says Angie Kamath, dean of the New York University School of Professional Studies. It’s less about precise staffing levels and more about factors like product mix and pricing strategy. “The good companies, whether they’re slightly understaffed or slightly overstaffed, if they’ve got that culture of innovation they will do really well in a recession,\" says Angie Kamath, dean of the New York University School of Professional Studies. It’s less about precise staffing levels and more about factors like product mix and pricing strategy. A firm that’s slightly overstaffed should consider what to do with that capacity rather than panicking and jettisoning people they have worked hard to hire. “The research has been incredibly consistent that layoffs are not good,\" Kamath warns, ticking off a host of ills from bad PR to increased turnover among remaining employees. A firm that’s slightly overstaffed should consider what to do with that capacity rather than panicking and jettisoning people they have worked hard to hire. “The research has been incredibly consistent that layoffs are not good,\" Kamath warns, ticking off a host of ills from bad PR to increased turnover among remaining employees. Businesses contemplating job cuts might consider the experience of the retail industry, which for years sought to keep staff levels as lean as possible. Algorithms helped them predict periods of high and low demand and make sure stores had “just enough\" staff at those times — in theory, freeing them from having to employ quite as many workers. Businesses contemplating job cuts might consider the experience of the retail industry, which for years sought to keep staff levels as lean as possible. Algorithms helped them predict periods of high and low demand and make sure stores had “just enough\" staff at those times — in theory, freeing them from having to employ quite as many workers. Yet focusing so much on optimizing worker numbers left stores painfully understaffed during the busiest periods. A 2014 study in the journal Production and Operations Management looked at 41 stores of an (anonymized) large retail chain. The researchers, led by Vidya Mani of University of Virginia’s Darden School of Business, found all 41 locations were chronically shorthanded during peak hours. Adding staff during those times would have resulted in an increase in sales and profitability, the researchers concluded. Yet focusing so much on optimizing worker numbers left stores painfully understaffed during the busiest periods. A 2014 study in the journal Production and Operations Management looked at 41 stores of an (anonymized) large retail chain. The researchers, led by Vidya Mani of University of Virginia’s Darden School of Business, found all 41 locations were chronically shorthanded during peak hours. Adding staff during those times would have resulted in an increase in sales and profitability, the researchers concluded. The problems of understaffing go beyond lost sales, argue Zeynep Ton and Amanda Silver of the Good Jobs Institute, a nonprofit that works with companies in low-wage service industries to simultaneously improve financial performance and job stability. The problems of understaffing go beyond lost sales, argue Zeynep Ton and Amanda Silver of the Good Jobs Institute, a nonprofit that works with companies in low-wage service industries to simultaneously improve financial performance and job stability. The work draws from Massachusetts Institute of Technology professor Ton’s research that shows, among other things, the perils of being too lean. Understaffing creates waste: When there aren’t enough people to move pallets of groceries from trucks to warehouses, the food spoils. It angers customers: When they can’t get the help they need quickly, they get fed up and take their business elsewhere. It creates inefficiency: Inventory becomes disorganized, making it tougher for workers to find what they need quickly. The work draws from Massachusetts Institute of Technology professor Ton’s research that shows, among other things, the perils of being too lean. Understaffing creates waste: When there aren’t enough people to move pallets of groceries from trucks to warehouses, the food spoils. It angers customers: When they can’t get the help they need quickly, they get fed up and take their business elsewhere. It creates inefficiency: Inventory becomes disorganized, making it tougher for workers to find what they need quickly. In health care, where staffing levels have been a problem for decades, understaffing can be life-threatening. Studies have linked low staff levels in hospitals to worse outcomes for patients — specifically, in a hospital without enough workers, patients are more likely to contract an infection (because of things like decreased handwashing by frazzled staff). They also are less likely to get the right dose of medication and generally more likely to die. Nurses in such hospitals are more prone to feeling burned out and less inclined to recommend their hospital to friends and family who get sick. In health care, where staffing levels have been a problem for decades, understaffing can be life-threatening. Studies have linked low staff levels in hospitals to worse outcomes for patients — specifically, in a hospital without enough workers, patients are more likely to contract an infection (because of things like decreased handwashing by frazzled staff). They also are less likely to get the right dose of medication and generally more likely to die. Nurses in such hospitals are more prone to feeling burned out and less inclined to recommend their hospital to friends and family who get sick. Understaffing isn’t always a result of management short-sightedness. Restaurants, harried workplaces in the best of times, have had to shorten their hours — by about 6.4 hours a week in the US compared with 2019 levels — as the pandemic prompted workers to quit. Understaffing isn’t always a result of management short-sightedness. Restaurants, harried workplaces in the best of times, have had to shorten their hours — by about 6.4 hours a week in the US compared with 2019 levels — as the pandemic prompted workers to quit. Regardless of the cause, acute understaffing has a measurable impact on revenue. On a recent vacation to England, I found my favorite pub closed for two weeks — during a peak season — because they were so shorthanded. Never mind that they had already halved the number of diners they were serving. At another eatery, a full-page, single-spaced manifesto posted by the bathroom explained that they had had to stop offering hot food and table service due to a “very difficult staffing situation\" intensified by the area’s “lack of affordable [or any] housing.\" Regardless of the cause, acute understaffing has a measurable impact on revenue. On a recent vacation to England, I found my favorite pub closed for two weeks — during a peak season — because they were so shorthanded. Never mind that they had already halved the number of diners they were serving. At another eatery, a full-page, single-spaced manifesto posted by the bathroom explained that they had had to stop offering hot food and table service due to a “very difficult staffing situation\" intensified by the area’s “lack of affordable [or any] housing.\" The anonymous writer’s stress was palpable. No wonder a pandemic-era study of restaurant workers found a link between being spread too thin and higher levels of heavy drinking.  The anonymous writer’s stress was palpable. No wonder a pandemic-era study of restaurant workers found a link between being spread too thin and higher levels of heavy drinking.  Workers can put up with such conditions for only so long. Just look at the strikes we have seen lately by nurses, railroad workers, teachers and baristas. Chief among their demands: Hire more people. Workers can put up with such conditions for only so long. Just look at the strikes we have seen lately by nurses, railroad workers, teachers and baristas. Chief among their demands: Hire more people. Some bosses doubtless see it differently. They might feel that these workers are just lazy — that “no one wants to work\" as the management scholar Kim Kardashian once put it. That’s a managerial complaint as old as work itself. Some bosses doubtless see it differently. They might feel that these workers are just lazy — that “no one wants to work\" as the management scholar Kim Kardashian once put it. That’s a managerial complaint as old as work itself. I’m willing to concede the existence of some degree of human laziness. (This is why we invented the remote control, not to mention the bluetooth-enabled electric kettle.) And there are risks to being overstaffed. Workers may feel bored and unchallenged, picking up paychecks but not really engaging. In 2022, we called this “quiet quitting.\" In the 20th century, scholars termed it “social loafing.\" I’m willing to concede the existence of some degree of human laziness. (This is why we invented the remote control, not to mention the bluetooth-enabled electric kettle.) And there are risks to being overstaffed. Workers may feel bored and unchallenged, picking up paychecks but not really engaging. In 2022, we called this “quiet quitting.\" In the 20th century, scholars termed it “social loafing.\" Mild understaffing can keep staff focused and motivated, allowing employees to use a wider variety of skills (something most people find satisfying). But many sectors have gone far beyond being a little shorthanded — and have for a long time. Mild understaffing can keep staff focused and motivated, allowing employees to use a wider variety of skills (something most people find satisfying). But many sectors have gone far beyond being a little shorthanded — and have for a long time. Chronic understaffing hurts motivation and, of course, performance. Overstretched staff make mistakes. They disengage. Employees reason that if the company doesn’t care enough about its future to hire more people, why should they? They’ve essentially been set up to fail — and no one enjoys feeling incompetent. Chronic understaffing hurts motivation and, of course, performance. Overstretched staff make mistakes. They disengage. Employees reason that if the company doesn’t care enough about its future to hire more people, why should they? They’ve essentially been set up to fail — and no one enjoys feeling incompetent. At some point, the work just can’t get done, which weighs on the broader economy. There are still 90,000 fewer childcare workers in the US than there were pre-pandemic (when there already weren’t enough), making it tougher for parents to take on paid work. A dockworker shortage has contributed to clogged ports and snarled supply chains. A dearth of transit workers is a drag on cities trying to convince remote workers to start commuting again. At some point, the work just can’t get done, which weighs on the broader economy. There are still 90,000 fewer childcare workers in the US than there were pre-pandemic (when there already weren’t enough), making it tougher for parents to take on paid work. A dockworker shortage has contributed to clogged ports and snarled supply chains. A dearth of transit workers is a drag on cities trying to convince remote workers to start commuting again. That shared pain is worth remembering as companies seek to “right-size\" their staff levels. Demand for their services may have slowed, but if they cut too many jobs, it’s not only their remaining workers who will pay the price. It’s all of us. That shared pain is worth remembering as companies seek to “right-size\" their staff levels. Demand for their services may have slowed, but if they cut too many jobs, it’s not only their remaining workers who will pay the price. It’s all of us. This story has been published from a wire agency feed without modifications to the text.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/amazon-facing-questions-over-workplacesafety-also-probed-on-bank-dealings\/amp-11674394296279.html","pub_date":"2023-01-22T19:11:10+05:30","title":"Amazon, facing questions over workplacesafety, also probed on bank dealings","keywords":"Amazon,workplace safety,bank dealings,labor law,labor department,financial institutions,ecommerce,online Retail","articles":"The US Attorney is looking into whether what Amazon told lenders about labor law compliance might have defrauded them, applying a law originally aimed at the savings-and-loan industry  The US government is looking into whether Amazon.com Inc. might have misled lenders about its workplace safety record to obtain credit, using a law stemming from the savings-and-loan crisis in a legal move a lawyer for the company called “unprecedented.\"  The US government is looking into whether Amazon.com Inc. might have misled lenders about its workplace safety record to obtain credit, using a law stemming from the savings-and-loan crisis in a legal move a lawyer for the company called “unprecedented.\"  The Manhattan U.S. Attorney’s Office is conducting an investigation into Amazon under the Financial Institutions Reform, Recovery and Enforcement Act, a law that allows civil cases to be brought over wrongdoing that impacts banks. The office has deployed the 1989 law at the same time the Labor Department presses a workplace safety investigation of Amazon that has already led to several citations.  The Manhattan U.S. Attorney’s Office is conducting an investigation into Amazon under the Financial Institutions Reform, Recovery and Enforcement Act, a law that allows civil cases to be brought over wrongdoing that impacts banks. The office has deployed the 1989 law at the same time the Labor Department presses a workplace safety investigation of Amazon that has already led to several citations.  The Labor Department in December cited Amazon at six of its warehouses for not adequately reporting injuries and this week cited three company facilities, saying workers were exposed to ergonomic or equipment hazards.  Amazon has said it intends to appeal the citations. The company also said it never intentionally misrepresented its safety record.  Because Firrea cases proceed under civil law the government can more easily prove claims than in a criminal prosecution, which requires juries to be convinced of charges beyond a reasonable doubt.MINT PREMIUMSee All\n  The U.S. Attorney’s Office in Manhattan issued a subpoena in August to Amazon for information the company might have shared with financial institutions involved in at least $90 million in contracts or agreements with the online retailer in the previous five years, specifically information it shared on its injury rates and labor law compliance. An Amazon unit last month challenged the subpoena and related subpoenas in federal court in Seattle. “It is difficult to understand how a safety inquiry could plausibly be shoehorned into a Firrea investigation,\" Zainab Ahmad, a partner at outside counsel Gibson, Dunn & Crutcher LLP, wrote in a letter to government lawyers that is included with court papers. “Firrea addresses financial fraud, not employee safety,\" Ms. Ahmad added, calling the U.S. Attorney’s Office’s legal theory “extremely tenuous\" and “unprecedented.\" The office is seeking a range of documents on Amazon’s labor practices, including internal communications touching on policies around workplace productivity. The office also wants video surveillance footage of Amazon facilities and has served subpoenas to take testimony from Amazon employees, including high-level executives, according to Ms. Ahmad. Amazon in court papers in the case in Seattle said the information demands are “unrealistic\" and the U.S. Attorney’s Office stretched to assert jurisdiction under Firrea. While the law was meant to target insiders who looted savings-and-loan institutions, it has been applied in novel ways by government lawyers, said Robert Giuffra, a partner at the law firm Sullivan & Cromwell LLP who has worked on Firrea-related litigation. “The Justice Department has a history of misusing the Firrea statute and stretching it far beyond its intended purposes,\" he added. Firrea emerged as a “superweapon\" for the U.S. Justice Department following the 2008 financial crisis, when it was used to bring cases against banks themselves, said Brian Feldman, a lawyer formerly with the civil fraud unit of the U.S. Attorney’s Office in Manhattan who now is in private practice at Harter Secrest & Emery LLP. Mr. Feldman, who worked on Firrea-related cases during his time in the office, said that while the Amazon case involves a “novel set of circumstances,\" Firrea is written to allow the government to tackle a variety of fraud affecting banks. Any fraud case against Amazon would turn on whether the company had made misrepresentations to lenders and whether those misrepresentations impacted their decision-making, he said. A spokesman for the U.S. Attorney’s Office in Manhattan didn’t respond to a request for information on the identities of the financial institutions whose dealings with Amazon are under scrutiny.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/tata-communications-q3-preview-overall-revenue-to-recover-pat-to-decline\/amp-11674392693062.html","pub_date":"2023-01-22T18:38:36+05:30","title":"Tata Communications Q3 preview: Overall revenue to recover,  PAT to decline","keywords":"tata communications,tata communications share price target 2023,tata communications q3 preview","articles":"Tata Communications is expected to post recovery in its revenue 7.5 per cent year-on-year and 1.5 per cent quarter-on-quarter to  ₹4,497.4 crore, albeit normalising of costs      Telecom firm Tata Communications is expected to post recovery in revnue aided by data revenue which expected to grow. Tata Communication wil post its December quarter results on 23 jaunuary, 2023. Telecom firm Tata Communications is expected to post recovery in revnue aided by data revenue which expected to grow. Tata Communication wil post its December quarter results on 23 jaunuary, 2023. Tata Communications is expected to post recovery in its revenue 7.5 per cent year-on-year and 1.5 per cent quarter-on-quarter to  ₹4,497.4 crore, albeit normalising of costs will lead to margins decline said ICICI Direct in its brokerage report. Tata Communications is expected to post recovery in its revenue 7.5 per cent year-on-year and 1.5 per cent quarter-on-quarter to  ₹4,497.4 crore, albeit normalising of costs will lead to margins decline said ICICI Direct in its brokerage report. However, profit after tax (PAT) is expected to decline by 3.9 per cent year-on-year and 28.6 per cent quarter-on-quarter to  ₹380 crore in December 2022 quarter. However, profit after tax (PAT) is expected to decline by 3.9 per cent year-on-year and 28.6 per cent quarter-on-quarter to  ₹380 crore in December 2022 quarter. The data revenue is expected to grow 10.3 per cent year-on-year and 2.1 per cent quarter-on-quarter at  ₹2565 crore. While the overall Overall margins are expected at 24.9%, down 60 bps QoQ, 100 bps YoY. The data revenue is expected to grow 10.3 per cent year-on-year and 2.1 per cent quarter-on-quarter at  ₹2565 crore. While the overall Overall margins are expected at 24.9%, down 60 bps QoQ, 100 bps YoY. The firm is expected to post an EBITDA of  ₹1,119.9 crore up by 3.5 per cent YoY while it could decline by 0.9%. The firm is expected to post an EBITDA of  ₹1,119.9 crore up by 3.5 per cent YoY while it could decline by 0.9%. \"For Tata Communications (TCom), we expect gradual revenue growth recovery to continue, albeit normalising of costs will lead to margins decline QoQ and YoY. The data revenue is expected to grow 2.1% QoQ (up ~10.3% YoY) at  ₹3565 crore. The voice revenues are anticipated to continue to remain weak, down 4.7% QoQ (10 % YoY decline) at  ₹500 crore. The overall revenue is expected to grow 1.5% QoQ (7.5% YoY) at  ₹4497 crore. Data segment margins are expected at 29% (flattish QoQ). Overall margins are expected at 24.9%, down 60 bps QoQ and down 100 bps YoY. Key monitorable : Growth outlook commentary,\" said ICICI Direct brokerage report. \"For Tata Communications (TCom), we expect gradual revenue growth recovery to continue, albeit normalising of costs will lead to margins decline QoQ and YoY. The data revenue is expected to grow 2.1% QoQ (up ~10.3% YoY) at  ₹3565 crore. The voice revenues are anticipated to continue to remain weak, down 4.7% QoQ (10 % YoY decline) at  ₹500 crore. The overall revenue is expected to grow 1.5% QoQ (7.5% YoY) at  ₹4497 crore. Data segment margins are expected at 29% (flattish QoQ). Overall margins are expected at 24.9%, down 60 bps QoQ and down 100 bps YoY. Key monitorable : Growth outlook commentary,\" said ICICI Direct brokerage report. Tata Communications net consolidated profit fell by 2.1% to  ₹532.29 crore in Q2 from  ₹543.36 crore in Q1. The company's consolidated revenue from operations reduced to  ₹4,467 crore in the quarter under review. On Friday, the company's scrip was down by 2.04 per cent to  ₹1,342.55 at BSE. Tata Communications net consolidated profit fell by 2.1% to  ₹532.29 crore in Q2 from  ₹543.36 crore in Q1. The company's consolidated revenue from operations reduced to  ₹4,467 crore in the quarter under review. On Friday, the company's scrip was down by 2.04 per cent to  ₹1,342.55 at BSE.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/abbott-under-federal-criminal-investigation-over-baby-formula\/amp-11674388752851.html","pub_date":"2023-01-22T17:35:13+05:30","title":"Abbott under federal criminal investigation over baby formula","keywords":"Abbott Laboratories,baby formula,federal criminal investigation,Abbott Michigan plant,consumer-protection,contaminated food,Food and Drug Administration","articles":"Michigan plant at center of probe was temporarily closed by the company last year after potentially deadly bacteria was found  The Justice Department is investigating conduct at the Abbott Laboratories infant-formula plant in Sturgis, Mich., that led to its shutdown last year and worsened a nationwide formula shortage, people familiar with the matter said.  The Justice Department is investigating conduct at the Abbott Laboratories infant-formula plant in Sturgis, Mich., that led to its shutdown last year and worsened a nationwide formula shortage, people familiar with the matter said.  Attorneys with the Justice Department’s consumer-protection branch are conducting the criminal investigation, the people said.  Attorneys with the Justice Department’s consumer-protection branch are conducting the criminal investigation, the people said.  The branch, which has criminal as well as civil authority, was involved last year in a settlement with Abbott that allowed its Sturgis plant to resume operations after Food and Drug Administration inspectors found a potentially deadly bacteria there.  “The DOJ has informed us of its investigation, and we’re cooperating fully,\" an Abbott spokesman said.  The investigation signals further scrutiny of Abbott’s operation of the plant, a major source of baby formula in the U.S., and perhaps of the more than $4 billion formula industry.  The Justice Department in the past decade has investigated numerous food companies that have shipped contaminated products that resulted in illnesses or deaths.  Several have led to criminal prosecutions under the 1938 Federal Food, Drug and Cosmetic Act of companies or executives involved in producing goods from ice cream to peanut butter. The law allows government officials to prosecute entities or individuals who introduce adulterated food into interstate commerce.  In many recent cases, DOJ has been able to successfully prosecute defendants on misdemeanor charges for introducing contaminated food into the market even without proof that officials acted with criminal intent, according to Bill Marler, a Seattle lawyer who represents victims of food-borne illnesses.MINT PREMIUMSee All\n  Abbott, based outside Chicago, is one of the biggest manufacturers of baby formula. The company sells Similac, among other brands. Last January, FDA inspectors found bacteria at the plant after receiving reports of babies who drank the company’s formula and became sick. The inspectors also found standing water, damage to drying equipment and defects in the seams of formula cans, among other problems at the Sturgis plant. Federal officials couldn’t conclusively link the bacteria at the plant to the infants’ illnesses, however. Abbott has said genetic sequencing of the bacteria in the sick babies didn’t match the strains found at the plant. Abbott temporarily halted production at the Sturgis factory in February, and recalled baby formula made at the plant. The moves contributed to an infant formula shortage that sent parents and federal officials scrambling for months. To bolster supplies, the federal government waived regulatory requirements and tariffs to allow more foreign formula into the country, and the White House organized planes to fly baby formula to the U.S. Abbott last May signed a legal agreement, called a consent decree, detailing the steps it would need to take to reopen the plant. In the complaint accompanying that civil agreement, the Justice Department said Abbott and several of its employees had caused “adulterated food\" to enter interstate commerce. “Ongoing inadequacies in manufacturing conditions and practices at Defendants’ facilities demonstrate that Defendants have been unwilling or unable to implement sustainable corrective actions to ensure the safety and quality of food manufactured for infants, a consumer group particularly vulnerable to foodborne pathogens,\" the department said in the complaint. Also in May, Abbott Chief Executive Robert Ford apologized for the company’s role in the formula shortage, and said it was making investments to avoid a repeat. The company reopened the plant in June. Limited formula supplies continued into September, however, when adults in roughly one-third of households with infant children on formula had trouble getting it, according U.S. Census Bureau data. By October, in-stock rates had stabilized close to where they had been before the Sturgis plant shut down, federal officials have said. In 2020, the Justice Department filed criminal charges against Texas ice-cream company Blue Bell Creameries LP and its former chief executive following an investigation into a listeria outbreak tied to three deaths and other illnesses. Blue Bell agreed to pay $19 million and plead guilty to two misdemeanor charges related to shipments of contaminated ice cream. The former chief executive has pleaded not guilty to the charges. That same year, Chipotle Mexican Grill Inc. said it would pay a record $25 million to resolve criminal charges stemming from a series of foodborne-illness outbreaks involving its restaurants that sickened more than 1,000 people. In 2015, Stewart Parnell, the former owner of Peanut Corp. of America, was sentenced to 28 years in prison a year after being convicted of presiding over a coverup that led to a deadly salmonella outbreak.  ","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/axis-bank-q3-preview-pat-likely-to-see-strong-yoy-growth-progress-on-citi-deal-among-key-factors-to-watch\/amp-11674387380488.html","pub_date":"2023-01-22T17:11:59+05:30","title":"Axis Bank Q3 preview: PAT likely to see strong YoY growth; progress on Citi deal among key factors to watch","keywords":"Axis Bank Q3 results,Axis Bank Q3 preview,Axis Bank Q3 earnings,Axis Bank share price,Axis Bank Q3 net profit,Axis Bank Q3 NET INTEREST INCOME,Axis Bank Q3 gross NPA,Axis Bank Q3 asset quality,Axis Bank Citi deal,Axis Bank Q3 provisions,Axis Bank Q3 expectations","articles":"During the second quarter, Axis Bank posted a net profit of  ₹5,330 crore up by 70% YoY, and net interest income (NII) of  ₹10,360 crore surging by 31% YoY.  Private lender Axis Bank is set to announce its financial results for the third quarter of FY23 on Monday. The bank's stock will be in focus accordingly. Axis Bank is likely to report robust YoY growth in both the bottom-line and top-line front coupled with margins to improve furthermore. Among key factors to watch would be the bank's comments on the progress of Citi deal. Private lender Axis Bank is set to announce its financial results for the third quarter of FY23 on Monday. The bank's stock will be in focus accordingly. Axis Bank is likely to report robust YoY growth in both the bottom-line and top-line front coupled with margins to improve furthermore. Among key factors to watch would be the bank's comments on the progress of Citi deal. During the second quarter, Axis Bank posted a net profit of  ₹5,330 crore up by 70% YoY, and net interest income (NII) of  ₹10,360 crore surging by 31% YoY. Net interest margin (NIM) for Q2FY23 came at 3.96%, up 57 YOY and 36 QOQ. Provisions dropped to  ₹550 crore, as against  ₹1,735 crore a year ago. Meanwhile, asset quality improved with the gross non-performing asset ratio declining to 2.5% as of 30 September 2022, from 2.76% a quarter ago and 3.53% a year ago. During the second quarter, Axis Bank posted a net profit of  ₹5,330 crore up by 70% YoY, and net interest income (NII) of  ₹10,360 crore surging by 31% YoY. Net interest margin (NIM) for Q2FY23 came at 3.96%, up 57 YOY and 36 QOQ. Provisions dropped to  ₹550 crore, as against  ₹1,735 crore a year ago. Meanwhile, asset quality improved with the gross non-performing asset ratio declining to 2.5% as of 30 September 2022, from 2.76% a quarter ago and 3.53% a year ago. Last week, on Friday, Axis Bank shares closed at  ₹930.70 apiece on BSE marginally up from the previous session. Its market cap is over  ₹2.86 lakh crore. Last week, on Friday, Axis Bank shares closed at  ₹930.70 apiece on BSE marginally up from the previous session. Its market cap is over  ₹2.86 lakh crore. Axis Bank Q3 preview: Axis Bank Q3 preview: In its preview note, ICICI Direct expects Axis Bank to post advance growth of 15.7% YoY, 5.2% QoQ to  ₹7.68 lakh crore while deposits are expected to grow 9.1% YoY, 3.8% QoQ to  ₹8.41 lakh crore wherein CASA should remain steady at ~46%. Net interest income is likely to grow 24.4% YoY, 3.9% QoQ to  ₹10765 crore while NIMs may see improvement at ~4%. CI ratio to be at ~47% vs. ~50% in Q3FY22. On a sequential basis, provisions are expected to go up to  ₹692 crore versus  ₹550 crore. The brokerage added, \"We expect PAT to register growth of 50% YoY at  ₹5,444 crore. Asset quality is likely to improve in Q3FY23 with GNPA ratio at 2.4%, led by lower slippages and healthy recoveries.\" In its preview note, ICICI Direct expects Axis Bank to post advance growth of 15.7% YoY, 5.2% QoQ to  ₹7.68 lakh crore while deposits are expected to grow 9.1% YoY, 3.8% QoQ to  ₹8.41 lakh crore wherein CASA should remain steady at ~46%. Net interest income is likely to grow 24.4% YoY, 3.9% QoQ to  ₹10765 crore while NIMs may see improvement at ~4%. CI ratio to be at ~47% vs. ~50% in Q3FY22. On a sequential basis, provisions are expected to go up to  ₹692 crore versus  ₹550 crore. The brokerage added, \"We expect PAT to register growth of 50% YoY at  ₹5,444 crore. Asset quality is likely to improve in Q3FY23 with GNPA ratio at 2.4%, led by lower slippages and healthy recoveries.\" Meanwhile, Kotak Institutional Equities expects Axis Bank's loan growth at 15% yoy (~6% qoq) with a greater focus on retail and SME. NIM should be stable qoq with marginal upward bias driven stronger loan re-pricing as compared to deposits. Operating profit to grow at ~30% yoy led by normalisation of operating expenses. Meanwhile, Kotak Institutional Equities expects Axis Bank's loan growth at 15% yoy (~6% qoq) with a greater focus on retail and SME. NIM should be stable qoq with marginal upward bias driven stronger loan re-pricing as compared to deposits. Operating profit to grow at ~30% yoy led by normalisation of operating expenses. Further, Kotak's note said, \"We expect slippages of ~Rs35 bn (~2% of loans) mostly led by small ticket loans. Expect strong commentary on asset quality performance and we see an improvement in NPL ratios aided by stronger recovery\/upgradations. Provisions are mainly to reduce net NPL ratios. Progress of the Citi portfolio and direction of operating profit growth will be a key discussion area for the quarter.\" Further, Kotak's note said, \"We expect slippages of ~Rs35 bn (~2% of loans) mostly led by small ticket loans. Expect strong commentary on asset quality performance and we see an improvement in NPL ratios aided by stronger recovery\/upgradations. Provisions are mainly to reduce net NPL ratios. Progress of the Citi portfolio and direction of operating profit growth will be a key discussion area for the quarter.\" Axis Bank has inked a deal with Citi Group to acquire Citibank’s consumer businesses in India for  ₹12,325 crore. Citi's consumer businesses include covering loans, credit cards, wealth management, and retail banking operations in India. Through the acquisition, Axis Bank will gain access to the large and affluent customer franchise of Citibank having a bouquet of fee-oriented and profitable segments, that include a quality credit card portfolio, affluent wealth management clientele, and meaningful deposits with a strong consumer lending portfolio. However, Axis Bank earlier mentioned that the deal is expected to close by March 2023. However, in December last year, it was known that the deal may get pushed further to May. Axis Bank has inked a deal with Citi Group to acquire Citibank’s consumer businesses in India for  ₹12,325 crore. Citi's consumer businesses include covering loans, credit cards, wealth management, and retail banking operations in India. Through the acquisition, Axis Bank will gain access to the large and affluent customer franchise of Citibank having a bouquet of fee-oriented and profitable segments, that include a quality credit card portfolio, affluent wealth management clientele, and meaningful deposits with a strong consumer lending portfolio. However, Axis Bank earlier mentioned that the deal is expected to close by March 2023. However, in December last year, it was known that the deal may get pushed further to May. Thereby, some limelight on the progress of the Citi deal will be expected in the Q3 conference. Thereby, some limelight on the progress of the Citi deal will be expected in the Q3 conference. Also, Emkay Global's note said, \"Axis Bank reported strong core profit growth on the back of robust margin expansion and contained opex, partly offset by subdued treasury performance. This coupled with continued lower LLP led to a beat on PAT.\" Also, Emkay Global's note said, \"Axis Bank reported strong core profit growth on the back of robust margin expansion and contained opex, partly offset by subdued treasury performance. This coupled with continued lower LLP led to a beat on PAT.\"     Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/how-apple-has-so-far-avoided-layoffs\/amp-11674362598525.html","pub_date":"2023-01-22T10:46:46+05:30","title":"How Apple has so far avoided layoffs","keywords":"Apple,Layoffs at Apple,Google,Meta,Tech Layoffs,Tech Layoffs latest news","articles":"The iPhone maker’s workforce grew 20% in the past three years, a far slower pace than rivals  Layoffs have hit the tech industry hard—except at Apple Inc. Layoffs have hit the tech industry hard—except at Apple Inc. The world’s largest company has so far avoided the job cuts rippling through peers including Microsoft Corp., Google, Meta Platforms Inc. and Amazon.com Inc. The world’s largest company has so far avoided the job cuts rippling through peers including Microsoft Corp., Google, Meta Platforms Inc. and Amazon.com Inc. No company is certain to avoid significant cutbacks in an economic environment as volatile as the current one, and Apple isn’t immune to the business challenges that have hit other tech giants. It is expected next month to report its first quarterly sales decline in more than three years. Apple has also slowed hiring in some areas. No company is certain to avoid significant cutbacks in an economic environment as volatile as the current one, and Apple isn’t immune to the business challenges that have hit other tech giants. It is expected next month to report its first quarterly sales decline in more than three years. Apple has also slowed hiring in some areas. But the iPhone maker has been better positioned than many rivals to date in part because it added employees at a much slower clip than those companies during the pandemic. It also tends to run lean, with limited employee perks and businesses focused on hardware products and sales that have so far largely dodged the economic downturn, investors say. But the iPhone maker has been better positioned than many rivals to date in part because it added employees at a much slower clip than those companies during the pandemic. It also tends to run lean, with limited employee perks and businesses focused on hardware products and sales that have so far largely dodged the economic downturn, investors say. An Apple spokesman declined to comment. An Apple spokesman declined to comment. From its fiscal year-end in September 2019 to September 2022, Apple’s workforce grew by about 20% to approximately 164,000 full-time employees. Meanwhile, over roughly the same period, the employee count at Amazon doubled, Microsoft’s rose 53%, Google parent Alphabet Inc.’s increased 57% and Facebook owner Meta’s ballooned 94%. From its fiscal year-end in September 2019 to September 2022, Apple’s workforce grew by about 20% to approximately 164,000 full-time employees. Meanwhile, over roughly the same period, the employee count at Amazon doubled, Microsoft’s rose 53%, Google parent Alphabet Inc.’s increased 57% and Facebook owner Meta’s ballooned 94%. Apple has about 65,000 retail employees working in more than 500 stores who make up roughly 40% of the company’s total workforce. Apple has about 65,000 retail employees working in more than 500 stores who make up roughly 40% of the company’s total workforce. On Friday, Alphabet became the latest tech company to announce widespread layoffs, with a plan to eliminate roughly 12,000 jobs, the company’s largest-ever round of job cuts. On Friday, Alphabet became the latest tech company to announce widespread layoffs, with a plan to eliminate roughly 12,000 jobs, the company’s largest-ever round of job cuts. Alphabet’s cut follows a wave of large layoffs at Amazon, Microsoft and Meta. The tech industry has seen more than 200,000 layoffs since the start of 2022, according to Layoffs.fyi, a website that tracks cuts in the sector as they surface in media reports and company releases. Alphabet’s cut follows a wave of large layoffs at Amazon, Microsoft and Meta. The tech industry has seen more than 200,000 layoffs since the start of 2022, according to Layoffs.fyi, a website that tracks cuts in the sector as they surface in media reports and company releases. The last big round of layoffs at Apple happened way back in 1997, when co-founder Steve Jobs returned to the company, which then cut costs by firing 4,100 employees. The last big round of layoffs at Apple happened way back in 1997, when co-founder Steve Jobs returned to the company, which then cut costs by firing 4,100 employees. So far, Apple’s core business has shown itself to be resilient against broader downturns in the market. The other four tech giants have suffered amid slowdowns in digital advertising, e-commerce and PCs. In its September quarter, Apple reported that sales at its most important business—the iPhone—advanced 9.7% from the previous year to $42.6 billion, surpassing analyst estimates. So far, Apple’s core business has shown itself to be resilient against broader downturns in the market. The other four tech giants have suffered amid slowdowns in digital advertising, e-commerce and PCs. In its September quarter, Apple reported that sales at its most important business—the iPhone—advanced 9.7% from the previous year to $42.6 billion, surpassing analyst estimates. Apple may face a rougher December quarter, which it is scheduled to report on Feb. 2, as the company encountered manufacturing challenges in China, where strict zero-Covid policies damped much economic activity. Many analysts expect that demand hasn’t subsided for its iPhones and as the company continues to ramp back up manufacturing, demand is anticipated to move to the March quarter. Apple may face a rougher December quarter, which it is scheduled to report on Feb. 2, as the company encountered manufacturing challenges in China, where strict zero-Covid policies damped much economic activity. Many analysts expect that demand hasn’t subsided for its iPhones and as the company continues to ramp back up manufacturing, demand is anticipated to move to the March quarter. The company’s business model hasn’t been totally immune to broader slowdowns. Revenue from its services business continued to slow, growing 5% annually to $19.2 billion in the September quarter, shy of the gains posted in recent quarters. The company’s business model hasn’t been totally immune to broader slowdowns. Revenue from its services business continued to slow, growing 5% annually to $19.2 billion in the September quarter, shy of the gains posted in recent quarters. Tom Forte, senior research analyst at investment bank D.A. Davidson & Co., said he expects Apple to reduce head count, but it might do that quietly through employee attrition—by not replacing workers who leave. The company could move in the direction of making other cuts or adjustments to perks that are common in Silicon Valley. Apple doesn’t offer free lunches to employees on its corporate campus, unlike other big tech companies such as Google and Meta. Tom Forte, senior research analyst at investment bank D.A. Davidson & Co., said he expects Apple to reduce head count, but it might do that quietly through employee attrition—by not replacing workers who leave. The company could move in the direction of making other cuts or adjustments to perks that are common in Silicon Valley. Apple doesn’t offer free lunches to employees on its corporate campus, unlike other big tech companies such as Google and Meta. Some of the tech giants cutting jobs have spent heavily on projects that are unlikely to turn into strong businesses anytime soon, said Daniel Morgan, a senior portfolio manager at Synovus Trust Co., which counts Apple among its largest holdings. “Both Meta and Google are terribly guilty of that,\" he said. Some of the tech giants cutting jobs have spent heavily on projects that are unlikely to turn into strong businesses anytime soon, said Daniel Morgan, a senior portfolio manager at Synovus Trust Co., which counts Apple among its largest holdings. “Both Meta and Google are terribly guilty of that,\" he said. Meta has been pouring billions of dollars into its Reality Labs for its new ambitions in the so-called metaverse. Meta Chief Executive Mark Zuckerberg has defended the company’s spending on Reality Labs, suggesting that virtual reality will become an important technological platform. Meta has been pouring billions of dollars into its Reality Labs for its new ambitions in the so-called metaverse. Meta Chief Executive Mark Zuckerberg has defended the company’s spending on Reality Labs, suggesting that virtual reality will become an important technological platform. After announcing the layoffs, Alphabet Chief Executive Sundar Pichai said the company had seen dramatic periods of growth during the past two years. “To match and fuel that growth, we hired for a different economic reality than the one we face today,\" he wrote in a message to employees on Friday. After announcing the layoffs, Alphabet Chief Executive Sundar Pichai said the company had seen dramatic periods of growth during the past two years. “To match and fuel that growth, we hired for a different economic reality than the one we face today,\" he wrote in a message to employees on Friday. Apple also is working on risky future bets, such as an augmented-reality headset due out later this year and a car project whose release date is uncertain, but at a more measured pace. Apple also is working on risky future bets, such as an augmented-reality headset due out later this year and a car project whose release date is uncertain, but at a more measured pace.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/microsoft-kicks-off-tech-earnings-set-to-slump-most-since-2016\/amp-11674346182457.html","pub_date":"2023-01-22T05:46:21+05:30","title":"Microsoft kicks off tech earnings set to slump most since 2016","keywords":"Microsoft,tech companies,Nasdaq,US tech firms,stock market,Wall street,Google,Alphabet Inc,S&amp;P 500 profits","articles":"The tech-heavy Nasdaq 100 Stock Index enters this crucial stretch amid a darkening backdrop that short-circuited a strong start to the year  US technology stocks are about to hit their next hurdle when earnings season for the most influential segment of the S&P 500 Index gets underway in the coming week: vanishing profits. US technology stocks are about to hit their next hurdle when earnings season for the most influential segment of the S&P 500 Index gets underway in the coming week: vanishing profits. The tech-heavy Nasdaq 100 Stock Index enters this crucial stretch amid a darkening backdrop that short-circuited a strong start to the year. Underscoring the risks ahead, Microsoft Corp., which kicks off the group’s reporting Tuesday, joined Amazon. com Inc. in starting to cut thousands of jobs this week as sales slow. Google parent Alphabet Inc. followed with plans of its own to shrink its workforce. The tech-heavy Nasdaq 100 Stock Index enters this crucial stretch amid a darkening backdrop that short-circuited a strong start to the year. Underscoring the risks ahead, Microsoft Corp., which kicks off the group’s reporting Tuesday, joined Amazon. com Inc. in starting to cut thousands of jobs this week as sales slow. Google parent Alphabet Inc. followed with plans of its own to shrink its workforce. Wall Street has been slashing earnings estimates for months for the tech sector, which is projected to be the biggest drag on S&P 500 profits in the fourth quarter, data compiled by Bloomberg Intelligence show. The danger for investors, however, is that analysts still prove too optimistic, with demand for the industry’s products crumbling as the economy cools. “Tech is driving a lot of the overall earnings recession that we’re seeing in the S&P,\" said Michael Casper, an equity strategist with Bloomberg Intelligence. “While there’s a lot baked in, depending on if this recession does emerge and how badly it occurs, there is certainly some negative revision risk for the sector still.\" Firms including Texas Instruments Inc., Lam Research Corp. and Intel Corp. also report next week. Apple Inc., Alphabet and other behemoths announce the week after. The group has huge sway over the path of the overall market, with info-tech accounting for more than 25% of the S&P 500’s market capitalization. Fourth-quarter earnings for tech firms in the benchmark are projected to drop 9.2% from the same period a year earlier, the steepest slide since 2016, data compiled by BI show. The speed of the deterioration in sentiment is notable: Three months ago, Wall Street merely saw profits coming in flat. Revenue growth for these companies is fading relative to the past couple of years, when the pandemic and ensuing lockdowns supercharged sales for everything from digital services to personal computers and the components that power them. Higher costs are also squeezing profits. Valuation Concerns The concern, however, is that valuations are still far from cheap despite last year’s 33% tumble in the Nasdaq 100. The gauge is priced at about 21 times profits projected over the next 12 months, compared with an average of 20.5 for the past decade, and further estimate cuts would only make it look more expensive. The multiple bottomed at 17.7 in 2020 and at 11.3 in 2011, in the wake of the recession that ended in 2009. Still, for Sameer Bhasin, principal at Value Point Capital, most of the bad news has been priced in. He anticipates that first-quarter profit estimates may have further to fall, but says some of the fears are overblown. “Tech isn’t suffering from an industry demand issue, it’s suffering more from a digestion of the excesses that were built in during the pandemic,\" he said. “There’s money on the sidelines that is waiting to be put back into the sector.\" Analysts anticipate that tech profits will return to growth in the second half of the year, data compiled by BI show. That will make executives’ outlooks for the full year all the more critical for stocks. As earnings roll in over the next few weeks, investors will have plenty of risks to monitor. Among them are the possibility that inflation proves to be more entrenched than many expect, as well as the effect of higher rates on profits, says Nick Getaz, a portfolio manager of the Franklin Rising Dividends Fund. “Monetary policy has a lag and we’re likely still in the window of that,\" he said. “We haven’t seen the earnings impact you’d expect to see from rate hikes.\"   This story has been published from a wire agency feed without modifications to the text.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/punjab-and-sind-bank-posts-23-jump-in-net-profit-nii-climbs-by-6-20-yoy-in-q3\/amp-11674304447836.html","pub_date":"2023-01-21T18:11:50+05:30","title":"Punjab and Sind Bank posts 23% jump in net profit, NII climbs by 6.20% YoY in Q3","keywords":"punjab sind bank,punjab sind bank q3,punjab sind bank q3 results,punjab and sind bank,punjab and sind bank q3,punjab and sind bank q3 highlights,punjab and sind bank q3 earnings","articles":"The public sector lender Punjab and Sind Bank (PSB) has declared its Q3FY23 results today.  The public sector lender Punjab and Sind Bank (PSB) has declared its Q3FY23 results today. The bank has posted a net profit of Rs.373 Cr in Q3FY23 against a net profit of Rs.301 Cr for Q3FY22, a growth of 23.92% YoY whereas its operating profit surged by 8.18% (Q-o-Q) and 3.61% (Y-o-Y). The public sector lender Punjab and Sind Bank (PSB) has declared its Q3FY23 results today. The bank has posted a net profit of Rs.373 Cr in Q3FY23 against a net profit of Rs.301 Cr for Q3FY22, a growth of 23.92% YoY whereas its operating profit surged by 8.18% (Q-o-Q) and 3.61% (Y-o-Y). The lender said that in Q3FY23, its Gross Non-Performing Assets (GNPA) ratio decreased by 608 basis points (bps) YoY to 8.36% and its Net Non-Performing Assets (NNPA) ratio decreased by 99 bps YoY to 2.02%. According to Punjab and Sind Bank, Return on Assets (RoA) increases to 1.11%, a growth of 13 bps (Y-o-Y) in Q3FY23, and Capital Adequacy ratio (CRAR) is at 15.57% with a Common Equity Tier 1 (CET-1) ratio of 12.79% at the end of December 2022. The lender said that in Q3FY23, its Gross Non-Performing Assets (GNPA) ratio decreased by 608 basis points (bps) YoY to 8.36% and its Net Non-Performing Assets (NNPA) ratio decreased by 99 bps YoY to 2.02%. According to Punjab and Sind Bank, Return on Assets (RoA) increases to 1.11%, a growth of 13 bps (Y-o-Y) in Q3FY23, and Capital Adequacy ratio (CRAR) is at 15.57% with a Common Equity Tier 1 (CET-1) ratio of 12.79% at the end of December 2022. The bank said that in Q3FY23, its Yield on Advances grew by 42 bps (Y-o-Y) to 8.11%, while Net Interest Income (NII) grew by 6.20% on a YoY basis in Q3FY23. Punjab and Sind Bank (PSB) said that its CASA Deposit climbed by 11.33% YoY and that its percentage of the total deposit climbed to 33.30%, a growth of 67 basis points in Q3FY23. The lender said that Retail Advances climbed by 32.31% to Rs. 14739 Cr. and RAM (Retail, Agriculture & MSME) Advances surged by 19.07% (Y-o-Y) in the quarter ended December 2022. The bank said that in Q3FY23, its Yield on Advances grew by 42 bps (Y-o-Y) to 8.11%, while Net Interest Income (NII) grew by 6.20% on a YoY basis in Q3FY23. Punjab and Sind Bank (PSB) said that its CASA Deposit climbed by 11.33% YoY and that its percentage of the total deposit climbed to 33.30%, a growth of 67 basis points in Q3FY23. The lender said that Retail Advances climbed by 32.31% to Rs. 14739 Cr. and RAM (Retail, Agriculture & MSME) Advances surged by 19.07% (Y-o-Y) in the quarter ended December 2022. According to the bank, agricultural advances grew by 9.63% to Rs.11288 Cr. and MSME advances climbed by 14.92% to Rs.13929 Cr. According to the lender, the Credit-Deposit (CD) ratio increased by 452 bps (Y-o-Y) in Q3FY23 to reach 71.00%. According to the bank, agricultural advances grew by 9.63% to Rs.11288 Cr. and MSME advances climbed by 14.92% to Rs.13929 Cr. According to the lender, the Credit-Deposit (CD) ratio increased by 452 bps (Y-o-Y) in Q3FY23 to reach 71.00%. The bank said that in the third quarter of FY2023, its total business increased by 12.08% YoY to Rs. 187242 Cr and its total deposit increased by 9.11% to Rs. 109497 Cr. Gross Advances increased 16.54% to Rs. 77745 Cr in Q3FY23 from Rs. 66710 Cr in the same quarter the previous year. The bank said that in the third quarter of FY2023, its total business increased by 12.08% YoY to Rs. 187242 Cr and its total deposit increased by 9.11% to Rs. 109497 Cr. Gross Advances increased 16.54% to Rs. 77745 Cr in Q3FY23 from Rs. 66710 Cr in the same quarter the previous year. According to the bank, as of December 2022, it had 18.42 lakh PMJDY accounts and CASA deposits totalling Rs. 539 crore. As of Q3FY23, the bank had 1528 branches, of which 572 were rural, 278 semi-urban, 356 urban, and 322 metro, as well as 803 ATMs and 357 BCs. According to the bank, as of December 2022, it had 18.42 lakh PMJDY accounts and CASA deposits totalling Rs. 539 crore. As of Q3FY23, the bank had 1528 branches, of which 572 were rural, 278 semi-urban, 356 urban, and 322 metro, as well as 803 ATMs and 357 BCs.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/sbi-life-records-16-5-drop-in-q3-pat-to-rs-304-cr-net-premium-income-gains-traction\/amp-11674304234105.html","pub_date":"2023-01-21T18:09:05+05:30","title":"SBI Life records 16.5% drop in Q3 PAT to  ₹304 cr, net premium income gains traction","keywords":"SBI Life Q3 results,SBI Life share price,SBI Life Q3,SBI Life Q3 net profit,SBI Life Q3 earnings,SBI Life Q3 net premium income,SBI Life Q3 premium income","articles":"The insurer's Q3FY23 PAT dropped by 16.46% from  ₹364.06 crore in Q3FY22, however, the sequential drop was by 19.27% as against a profit of  ₹376.74 crore in Q2 of FY23.  SBI Life Insurance Company's profitability in December 2022 quarter dipped in both year-on-year and quarter-on-quarter terms. Q3 PAT came in at  ₹304.13 crore. The insurer's Q3FY23 PAT dropped by 16.46% from  ₹364.06 crore in Q3FY22, however, the sequential drop was by 19.27% as against a profit of  ₹376.74 crore in Q2 of FY23. On the other hand, the insurer's net premium income picked up momentum. SBI Life Insurance Company's profitability in December 2022 quarter dipped in both year-on-year and quarter-on-quarter terms. Q3 PAT came in at  ₹304.13 crore. The insurer's Q3FY23 PAT dropped by 16.46% from  ₹364.06 crore in Q3FY22, however, the sequential drop was by 19.27% as against a profit of  ₹376.74 crore in Q2 of FY23. On the other hand, the insurer's net premium income picked up momentum. Net premium income stood at  ₹19,170.80 crore in Q3FY23 --- rising by 6.35% from  ₹18,025.34 crore in Q3 of the previous fiscal, but up by a huge 16.35% from  ₹16,477.26 crore in the preceding quarter. Net premium income stood at  ₹19,170.80 crore in Q3FY23 --- rising by 6.35% from  ₹18,025.34 crore in Q3 of the previous fiscal, but up by a huge 16.35% from  ₹16,477.26 crore in the preceding quarter. For the nine months of FY23, the company maintained its leadership position in Individual Rated Premium of  ₹111.4 billion with 25.7% private market share. For the nine months of FY23, the company maintained its leadership position in Individual Rated Premium of  ₹111.4 billion with 25.7% private market share. In 9MFY23, the company recorded strong growth in individual new business premiums by 31% to  ₹152.4 billion, while its new business premium (NBP) climbed by 14% to  ₹215.1 billion driven by regular premium which saw an upside of 22%. In 9MFY23, the company recorded strong growth in individual new business premiums by 31% to  ₹152.4 billion, while its new business premium (NBP) climbed by 14% to  ₹215.1 billion driven by regular premium which saw an upside of 22%. Further, in 9MFY23, the insurer's protection new business premium increased by 25% YoY to  ₹25.5 billion led by growth in the individual protection business by 12% YoY and growth in the group protection business by 30% YoY. Gross written premium climbed by 15% YoY due to a 22% growth in regular premium and a 15% upside in renewal premium. Further, in 9MFY23, the insurer's protection new business premium increased by 25% YoY to  ₹25.5 billion led by growth in the individual protection business by 12% YoY and growth in the group protection business by 30% YoY. Gross written premium climbed by 15% YoY due to a 22% growth in regular premium and a 15% upside in renewal premium. SBI Life's distribution network was robust in 9MFY23 with 255,848 trained insurance professionals consisting of agents, CIFs, and SPs along with widespread operations with 990 offices across the country. SBI Life's distribution network was robust in 9MFY23 with 255,848 trained insurance professionals consisting of agents, CIFs, and SPs along with widespread operations with 990 offices across the country. The PAT was at  ₹9.4 billion in 9MFY23 up by 13% YoY. The PAT was at  ₹9.4 billion in 9MFY23 up by 13% YoY. Meanwhile, assets under management as of December 31, 2022, grew by 17% at  ₹2,999.9 billion from  ₹2,568.7 billion in 9MFY22 with a debt-equity mix of 71:29. Over 95% of the debt investments are in AAA and Sovereign instruments. Meanwhile, assets under management as of December 31, 2022, grew by 17% at  ₹2,999.9 billion from  ₹2,568.7 billion in 9MFY22 with a debt-equity mix of 71:29. Over 95% of the debt investments are in AAA and Sovereign instruments. Also, SBI Life's solvency ratio was at 2.25 as on December 31, 2022, as against the regulatory requirement of 1.50 indicating a strong financial position of the company. Also, SBI Life's solvency ratio was at 2.25 as on December 31, 2022, as against the regulatory requirement of 1.50 indicating a strong financial position of the company. As of December 31, 2022, the company's net worth climbed by 12% YoY to  ₹125.8 billion. As of December 31, 2022, the company's net worth climbed by 12% YoY to  ₹125.8 billion. On BSE, SBI Life shares closed at  ₹1,295.45 apiece down by 2.07%. The company's market cap is around  ₹1,29,652.68 crore as of January 20th. On BSE, SBI Life shares closed at  ₹1,295.45 apiece down by 2.07%. The company's market cap is around  ₹1,29,652.68 crore as of January 20th.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/indian-energy-exchange-q3-net-profit-down-at-rs-77-crore\/amp-11674300863640.html","pub_date":"2023-01-21T17:04:23+05:30","title":"Indian Energy Exchange Q3 net profit down at  ₹77 crore","keywords":"IEX,Q3 profit,electricity,electricity trading,gas volumes,coal prices,power sector. electricity prices","articles":"Persistent high spot e-auction coal prices led to average clearing price in the day-ahead market at  ₹4.56 in Q3 FY2023, while lower from  ₹5.40 in the previous quarter, but still high to provide optimization potential for discoms and open access consumers  New Delhi: Indian Energy Exchange (IEX) reported an over 4% year-on-year (YoY) decline in its December quarter consolidated net profit to  ₹77.21 crore. New Delhi: Indian Energy Exchange (IEX) reported an over 4% year-on-year (YoY) decline in its December quarter consolidated net profit to  ₹77.21 crore. “On a consolidated basis, revenue for the quarter increased by 3.1% Quarter on Quarter (QoQ), from  ₹113.8 crore in Q2FY’23 to  ₹117.4 crore in Q3FY’23. PAT grew by 8.4% QoQ from  ₹71.2 crore to  ₹77.2 crore with a margin of 66%,\" the company said in a statement. “On a consolidated basis, revenue for the quarter increased by 3.1% Quarter on Quarter (QoQ), from  ₹113.8 crore in Q2FY’23 to  ₹117.4 crore in Q3FY’23. PAT grew by 8.4% QoQ from  ₹71.2 crore to  ₹77.2 crore with a margin of 66%,\" the company said in a statement. During Q3 FY23, the exchange logged electricity volumes of 23 BU, a growth of 9% QoQ, but down 2% YoY.  Trade volumes were impacted largely due to supply-side constraints, led by high prices of e-auction coal. REC (renewable energy certificates) volumes at 1.2 BU during the third quarter of FY2022-23 witnessed a de-growth of 68 per cent on a YoY basis as the year-ago period had exceptionally high REC volumes to fulfil the pent-up demand caused by stay on REC trading by APTEL for a period of 16 months, it stated. Overall volumes at the exchange was 24.2 BU during Q3 FY23, a 5% rise sequentially across market segments. However, volumes declined 12% YoY, because of power supply side constraints, high prices discovered during Q3 FY 2023 and high REC traded volumes during the quarter under review. In the quarter, price of e-auction coal continued to be high. While the quarterly average price premium declined from 293% in the second quarter of FY23 to 242% in the third, it was considerably higher compared to 35% for special forward e-auction price for the power sector in FY22. As a result, input cost for gencos continued to be high. Persistent high spot e-auction coal prices led to average clearing price in the day-ahead market at  ₹4.56 in Q3 FY2023, while lower from  ₹5.40 in the previous quarter, but still high to provide optimization potential for discoms and open access consumers, it said. Improving coal inventory and reduction in e-auction prices are expected to result in a decline in power prices on the exchange and provide further cost optimisation opportunities to discoms and open access consumers. This is expected to result in higher volumes on the exchange. IGX traded a total gas volumes of 24.42 million MMBtu during Q3 FY23, which was a 568% YoY increase. The growth was, largely, the result of the participation from major domestic gas producers and an increase in the number of participants. ","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/idfc-first-declares-pat-growth-of-115-yoy-asset-quality-improves-in-q3\/amp-11674299403283.html","pub_date":"2023-01-21T16:43:15+05:30","title":"IDFC First Bank declares PAT growth of 115% YoY, asset quality improves in Q3","keywords":"idfc first bank,idfc first bank q3,idfc first bank q3 earnings,idfc first bank q3 results,idfc first bank net profit,idfc first bank q3 casa ratio,idfc first bank q3fy23 results","articles":"IDFC First Bank has declared its Q3FY23 results today and the lender said that it continues to deliver a strong performance on all fronts including profitability, customer deposits, funded asset, capital adequacy, asset quality and net NPA.  IDFC First Bank has declared its Q3FY23 results today and the lender said that it continues to deliver a strong performance on all fronts including profitability, customer deposits, funded asset, capital adequacy, asset quality and net NPA. The bank's net profit for the third quarter of FY23 climbed by 115% YoY, from Rs. 281 crore in Q3-FY22 to Rs. 605 crore in Q3-FY23, as a result of robust growth in core operating income. The bank’s Net Interest Income (NII) grew 27% YOY from Rs. 2,580 crore in Q3-FY22 to Rs. 3,285 crore in Q3-FY23 and Core Operating Income (NII plus Fees, excluding trading gains) grew 32% from Rs. 3,324 crore in Q3-FY22 to Rs. 4,402 crore in Q3-FY23. IDFC First Bank has declared its Q3FY23 results today and the lender said that it continues to deliver a strong performance on all fronts including profitability, customer deposits, funded asset, capital adequacy, asset quality and net NPA. The bank's net profit for the third quarter of FY23 climbed by 115% YoY, from Rs. 281 crore in Q3-FY22 to Rs. 605 crore in Q3-FY23, as a result of robust growth in core operating income. The bank’s Net Interest Income (NII) grew 27% YOY from Rs. 2,580 crore in Q3-FY22 to Rs. 3,285 crore in Q3-FY23 and Core Operating Income (NII plus Fees, excluding trading gains) grew 32% from Rs. 3,324 crore in Q3-FY22 to Rs. 4,402 crore in Q3-FY23. According to IDFC First Bank, its Core Operating Profit (excluding trading gains) increased significantly YoY by 64% from Rs. 745 crore in Q3-FY22 to Rs. 1,225 crore in Q3-FY23. From Rs. 392 crore in Q3-FY22 to Rs. 450 crore in Q3-FY23, the bank's provisions climbed 15% YOY. According to IDFC First Bank, the RoA (annualised) increased from 0.64% in Q3-FY22 to 1.11% in Q3-FY23, while the RoE (annualised) increased from 5.44% in Q3-FY22 to 10.72% in Q3-FY23. According to IDFC First Bank, its Core Operating Profit (excluding trading gains) increased significantly YoY by 64% from Rs. 745 crore in Q3-FY22 to Rs. 1,225 crore in Q3-FY23. From Rs. 392 crore in Q3-FY22 to Rs. 450 crore in Q3-FY23, the bank's provisions climbed 15% YOY. According to IDFC First Bank, the RoA (annualised) increased from 0.64% in Q3-FY22 to 1.11% in Q3-FY23, while the RoE (annualised) increased from 5.44% in Q3-FY22 to 10.72% in Q3-FY23. Customer deposits at IDFC First Bank climbed by 44% between December 31, 2021 and December 31, 2022, from Rs. 85,818 crore to Rs. 1,23,578 crore, while CASA deposits jumped by 39% YoY, from Rs. 47,859 crore in Q3FY22 to Rs. 66,498 crore in Q3FY23. The CASA Ratio decreased from 51.6% as of December 31, 2021 to 50.0% as of December 31, 2022. Retail deposits made up 77% of total customer deposits as of December 31, 2022, according to IDFC First Bank. Customer deposits at IDFC First Bank climbed by 44% between December 31, 2021 and December 31, 2022, from Rs. 85,818 crore to Rs. 1,23,578 crore, while CASA deposits jumped by 39% YoY, from Rs. 47,859 crore in Q3FY22 to Rs. 66,498 crore in Q3FY23. The CASA Ratio decreased from 51.6% as of December 31, 2021 to 50.0% as of December 31, 2022. Retail deposits made up 77% of total customer deposits as of December 31, 2022, according to IDFC First Bank. As of December 31, 2022, the GNPA in the retail and commercial business stood at 1.87%, and the NNPA was 0.70%, compared to GNPA of 2.92% and NNPA of 1.28% as of December 31, 2021. As of December 31, 2022, the bank's overall GNPA and NNPA were 2.96% and 1.03%, respectively, compared to GNPA of 3.96% and NNPA of 1.74% reported in the same quarter of the previous fiscal year. As of December 31, 2022, the Bank's capital adequacy (taking into account 9M FY23 earnings) was excellent at 16.06% and the CET-1 Ratio was 13.49%. As of December 31, 2022, the GNPA in the retail and commercial business stood at 1.87%, and the NNPA was 0.70%, compared to GNPA of 2.92% and NNPA of 1.28% as of December 31, 2021. As of December 31, 2022, the bank's overall GNPA and NNPA were 2.96% and 1.03%, respectively, compared to GNPA of 3.96% and NNPA of 1.74% reported in the same quarter of the previous fiscal year. As of December 31, 2022, the Bank's capital adequacy (taking into account 9M FY23 earnings) was excellent at 16.06% and the CET-1 Ratio was 13.49%. As of December 31, 2022, funded assets (including advances and credit substitutes) were Rs. 1,52,152 crore, a 25% YoY growth from Rs. 1,21,419 crore recorded in Q3FY22. As of December 31, 2022, funded assets (including advances and credit substitutes) were Rs. 1,52,152 crore, a 25% YoY growth from Rs. 1,21,419 crore recorded in Q3FY22. Mr. V Vaidyanathan, Managing Director and CEO, IDFC FIRST Bank, said, “We are happy to state that we have now built a strong foundation for the bank with CASA ratio at 50% and strong retail deposit franchise contributing 77% of the overall customer deposits. The deposit franchise continues to grow strong at the bank based on our customer friendly products & services, excellent customer service, strong brand known for corporate governance, ethics and digital innovations. We are now confident of growing our loan book in a stable manner on this strong platform.\" Mr. V Vaidyanathan, Managing Director and CEO, IDFC FIRST Bank, said, “We are happy to state that we have now built a strong foundation for the bank with CASA ratio at 50% and strong retail deposit franchise contributing 77% of the overall customer deposits. The deposit franchise continues to grow strong at the bank based on our customer friendly products & services, excellent customer service, strong brand known for corporate governance, ethics and digital innovations. We are now confident of growing our loan book in a stable manner on this strong platform.\" “We are happy to share that our asset quality continues to remain strong. On the retail side, where our Bank particularly specializes in, the Gross NPA has come down to 1.87% and the Net NPA has come down to 0.70%, against the guidance of GNPA and Net NPA of 2.0% and 1.0% respectively. Even at the overall bank level, both the Gross and Net NPA improved to 2.96% and 1.03% respectively from 3.96% and 1.74% last year same time. We are confident that our improvement trend would continue going forward as the issues on legacy wholesale book, especially in infrastructure finance, are addressed and the book continue to run down,\" said Mr. V Vaidyanathan. “We are happy to share that our asset quality continues to remain strong. On the retail side, where our Bank particularly specializes in, the Gross NPA has come down to 1.87% and the Net NPA has come down to 0.70%, against the guidance of GNPA and Net NPA of 2.0% and 1.0% respectively. Even at the overall bank level, both the Gross and Net NPA improved to 2.96% and 1.03% respectively from 3.96% and 1.74% last year same time. We are confident that our improvement trend would continue going forward as the issues on legacy wholesale book, especially in infrastructure finance, are addressed and the book continue to run down,\" said Mr. V Vaidyanathan. “We are happy to state that we have registered our highest ever profit of Rs. 605 crore in Q3-FY23 and our return on equity has now moved firmly into double digits. We thank all our stakeholders for the confidence and supported us during the last many years and we believe we are all set to deliver strong financial performance from here on. We continue to focus on building a strong culture of customer friendliness, customer service ethics and high levels of corporate governance in the bank in terms of our customer practices,\" he further added. “We are happy to state that we have registered our highest ever profit of Rs. 605 crore in Q3-FY23 and our return on equity has now moved firmly into double digits. We thank all our stakeholders for the confidence and supported us during the last many years and we believe we are all set to deliver strong financial performance from here on. We continue to focus on building a strong culture of customer friendliness, customer service ethics and high levels of corporate governance in the bank in terms of our customer practices,\" he further added. The bank has grown to include 578 rural business correspondent centres, 253 asset service centres, 867 ATMs, 707 branches, an advanced net and mobile banking platform, and 24\/7 Customer Care services. With a balance sheet of Rs. 2,21,374 crore, IDFC FIRST Bank provides services to clients all throughout the nation. The bank has grown to include 578 rural business correspondent centres, 253 asset service centres, 867 ATMs, 707 branches, an advanced net and mobile banking platform, and 24\/7 Customer Care services. With a balance sheet of Rs. 2,21,374 crore, IDFC FIRST Bank provides services to clients all throughout the nation.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/icici-bank-posts-34-rise-in-q3-pat-to-rs-8-312-cr-nii-surges-by-35\/amp-11674286728078.html","pub_date":"2023-01-21T16:14:13+05:30","title":"ICICI Bank posts 34% rise in Q3 PAT to  ₹8,312 cr, NII surges by 35%","keywords":"ICICI Bank Q3 results,ICICI Bank Q3 earnings,ICICI Bank Q3,ICICI Bank Q3 net profit,ICICI Bank Q3 provisions,ICICI Bank Q3 asset quality,ICICI Bank Q3 gross NPA,ICICI Bank Q3 net interest income,ICICI Bank Q3 financial results,ICICI Bank share price,ICICI Bank shares,ICICI Bank Q3FY23,ICICI Bank Q3 highlights","articles":"In September 2022 quarter, the bank posted a net profit of  ₹7,558 crore up by 37% YoY, while net interest income (NII) jumped by 26% YoY to  ₹14,787 crore.  ICICI Bank announced its financial results for the third quarter ending December 31, 2022 (Q3FY23) period on Saturday. The bank beats street expectations by garnering a net profit of  ₹8,311.85 crore in Q3 of the current fiscal compared to a profit of  ₹6,193.81 crore recorded in the same quarter a year ago, registering a growth of a whopping 34.19% year-on-year. While gross NPA in the Q3FY23 dipped further, however, provisions scaled up during the quarter. ICICI Bank announced its financial results for the third quarter ending December 31, 2022 (Q3FY23) period on Saturday. The bank beats street expectations by garnering a net profit of  ₹8,311.85 crore in Q3 of the current fiscal compared to a profit of  ₹6,193.81 crore recorded in the same quarter a year ago, registering a growth of a whopping 34.19% year-on-year. While gross NPA in the Q3FY23 dipped further, however, provisions scaled up during the quarter. ICICI Bank's Q3 PAT rose by 9.97% from  ₹7,557.84 crore in September 2022 quarter. ICICI Bank's Q3 PAT rose by 9.97% from  ₹7,557.84 crore in September 2022 quarter. Net interest income, meanwhile, soared by a robust 34.6% to  ₹16,465 crore in Q3FY23, compared to  ₹12,236 crore in same the quarter of the previous fiscal. NII was up by 11.35% from  ₹14,786.81 crore in the preceding quarter. Net interest income, meanwhile, soared by a robust 34.6% to  ₹16,465 crore in Q3FY23, compared to  ₹12,236 crore in same the quarter of the previous fiscal. NII was up by 11.35% from  ₹14,786.81 crore in the preceding quarter. Net interest margin also increased to 4.65% in Q3 of the current fiscal compared to 3.96% in Q3FY22 and 4.31% in Q2FY23. Net interest margin also increased to 4.65% in Q3 of the current fiscal compared to 3.96% in Q3FY22 and 4.31% in Q2FY23. Meanwhile, provisions and contingencies in the current quarter scaled up to  ₹2,257.44 crore as against  ₹2,007.30 crore in Q3FY22 and  ₹1.644.52 crore in Q2 of FY23. ICICI Bank highlighted that during Q3, it changed its provisioning norms on nonperforming assets to make them more conservative. This change resulted in higher provisions amounting to  ₹1,196 crore in Q3-2023. Provisions for Q3-2023 also include a contingency provision of  ₹1,500 crore made on a prudent basis.  Meanwhile, provisions and contingencies in the current quarter scaled up to  ₹2,257.44 crore as against  ₹2,007.30 crore in Q3FY22 and  ₹1.644.52 crore in Q2 of FY23. ICICI Bank highlighted that during Q3, it changed its provisioning norms on nonperforming assets to make them more conservative. This change resulted in higher provisions amounting to  ₹1,196 crore in Q3-2023. Provisions for Q3-2023 also include a contingency provision of  ₹1,500 crore made on a prudent basis.  In terms of asset quality, gross NPA dropped to 3.07% as of December 31, 2022, from 3.19% as of September 30, 2022, and 4.13% as of December 31, 2021. The net NPA ratio declined to 0.55% in Q3FY23 from 0.61% in Q2FY23 and 0.85% in Q3FY22. In terms of asset quality, gross NPA dropped to 3.07% as of December 31, 2022, from 3.19% as of September 30, 2022, and 4.13% as of December 31, 2021. The net NPA ratio declined to 0.55% in Q3FY23 from 0.61% in Q2FY23 and 0.85% in Q3FY22. During Q3FY23, ICICI Bank made net additions of  ₹1,119 crore to gross NPAs which is higher than  ₹605 crore in the previous quarter. The overall gross NPA additions were at  ₹5,723 crore in Q3FY23 versus  ₹4,366 crore in Q2FY23. Recoveries and upgrades of NPAs, excluding write-offs and sale, were  ₹4,604 crore in Q3 of FY23 versus  ₹3,761 crore in Q2-2023. Whereas the gross NPAs written-off in Q3-2023 was at  ₹1,162 crore. The provisioning coverage ratio on NPAs was 82.0% as of December 31, 2022. During Q3FY23, ICICI Bank made net additions of  ₹1,119 crore to gross NPAs which is higher than  ₹605 crore in the previous quarter. The overall gross NPA additions were at  ₹5,723 crore in Q3FY23 versus  ₹4,366 crore in Q2FY23. Recoveries and upgrades of NPAs, excluding write-offs and sale, were  ₹4,604 crore in Q3 of FY23 versus  ₹3,761 crore in Q2-2023. Whereas the gross NPAs written-off in Q3-2023 was at  ₹1,162 crore. The provisioning coverage ratio on NPAs was 82.0% as of December 31, 2022. In terms of credit growth, ICICI Bank's retail loan portfolio jumped by 23.4% YoY and comprised 54.3% of the total loan book in Q3FY23. The business banking portfolio climbed by 37.9% YoY, while, the SME portfolio comprising borrowers with a turnover of less than  ₹250 crore soared by 25% YoY. The domestic corporate portfolio was up 18.2% YoY, rural portfolio surged 12.5% YoY. Bank's domestic advances were up 21.4% YoY. In terms of credit growth, ICICI Bank's retail loan portfolio jumped by 23.4% YoY and comprised 54.3% of the total loan book in Q3FY23. The business banking portfolio climbed by 37.9% YoY, while, the SME portfolio comprising borrowers with a turnover of less than  ₹250 crore soared by 25% YoY. The domestic corporate portfolio was up 18.2% YoY, rural portfolio surged 12.5% YoY. Bank's domestic advances were up 21.4% YoY. Overall, the total advances advanced by 19.7% YoY and 3.8% QoQ to  ₹974,047 crore. Overall, the total advances advanced by 19.7% YoY and 3.8% QoQ to  ₹974,047 crore. Furthermore, regarding deposits, the bank posted 14.2% YoY growth in period-end term deposits. Average current account and savings account deposits increased by 10.4% YoY in Q3. Total deposits stood at  ₹11,22,049 crore increasing by 10.3% YoY in Q3FY23. Furthermore, regarding deposits, the bank posted 14.2% YoY growth in period-end term deposits. Average current account and savings account deposits increased by 10.4% YoY in Q3. Total deposits stood at  ₹11,22,049 crore increasing by 10.3% YoY in Q3FY23. Under digital and payments platforms, ICICI Bank said, there have been around 86 lakh activations from non-ICICI Bank account holders on its mobile banking app, iMobile Pay by end of December 31, 2022. Also, about 215,000 registrations from non-ICICI Bank account holders were made on InstaBIZ till December 31, 2022. Under digital and payments platforms, ICICI Bank said, there have been around 86 lakh activations from non-ICICI Bank account holders on its mobile banking app, iMobile Pay by end of December 31, 2022. Also, about 215,000 registrations from non-ICICI Bank account holders were made on InstaBIZ till December 31, 2022. Also, the value of the Bank’s merchant-acquiring transactions through UPI grew by 10.6% sequentially and 78% year-on-year in Q3-2023. The Bank had a market share of 30.6% by value in electronic toll collections through FASTag in Q3-2023, with a 22.2% year-on-year growth in collections. Also, the value of the Bank’s merchant-acquiring transactions through UPI grew by 10.6% sequentially and 78% year-on-year in Q3-2023. The Bank had a market share of 30.6% by value in electronic toll collections through FASTag in Q3-2023, with a 22.2% year-on-year growth in collections. ICICI Bank opened about 300 branches in nine months of FY23. That being said, it has an overall network of 5,718 branches and 13,186 ATMs as of December 31, 2022. ICICI Bank opened about 300 branches in nine months of FY23. That being said, it has an overall network of 5,718 branches and 13,186 ATMs as of December 31, 2022. On BSE, ICICI Bank shares closed at  ₹870.40 apiece on Friday up 0.47%. The bank is the fourth largest company in terms of market share on the exchange. As of January 20, the bank's valuation stood over  ₹6.07 lakh crore. On BSE, ICICI Bank shares closed at  ₹870.40 apiece on Friday up 0.47%. The bank is the fourth largest company in terms of market share on the exchange. As of January 20, the bank's valuation stood over  ₹6.07 lakh crore.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/yes-bank-s-q3-pat-declines-81-to-rs-51-5-cr-gross-npa-contracts-steeply-on-transfer-to-arc\/amp-11674287362741.html","pub_date":"2023-01-21T14:32:54+05:30","title":"Yes Bank's Q3 PAT declines 81% to  ₹51.5 cr, gross NPA contracts steeply on transfer to ARC","keywords":"Yes Bank Q3 results,Yes Bank Q3,Yes Bank Q3 earnings,Yes Bank Q3 net profit,Yes Bank Q3 provisions,Yes Bank Q3 gross NPA,Yes Bank Q3 financial results,Yes Bank Q3 net interest income,Yes Bank share price,Yes Bank shares,Yes Bank NPA transfer ARC,Yes Bank ARC","articles":"During the quarter, net interest income (NII) came in at  ₹1,971 crore up by 11.7% YoY but marginally down by 1% QoQ. Net interest margin (NIM) expanded by 10 bps YoY to 2.5% in Q3FY23, however, was down by 10 bps QoQ.  Mumbai-based Yes Bank presented its third-quarter earnings for FY23 on Saturday. The bank posted a PAT of  ₹51.52 crore in Q3FY23 as against  ₹266.43 crore in the same quarter last year, registering a decline of 80.66%. Also, PAT dropped by 66.28% compared to  ₹152.82 crore in the preceding quarter. Among the major highlights of Q3 is that Yes Bank's gross NPA reached its lowest level since Q3 of FY19, due to the transfer of stressed assets to asset reconstruction company, JC Flowers. Mumbai-based Yes Bank presented its third-quarter earnings for FY23 on Saturday. The bank posted a PAT of  ₹51.52 crore in Q3FY23 as against  ₹266.43 crore in the same quarter last year, registering a decline of 80.66%. Also, PAT dropped by 66.28% compared to  ₹152.82 crore in the preceding quarter. Among the major highlights of Q3 is that Yes Bank's gross NPA reached its lowest level since Q3 of FY19, due to the transfer of stressed assets to asset reconstruction company, JC Flowers. During the quarter, net interest income (NII) came in at  ₹1,971 crore up by 11.7% YoY but marginally down by 1% QoQ. Net interest margin (NIM) expanded by 10 bps YoY to 2.5% in Q3FY23, however, was down by 10 bps QoQ. During the quarter, net interest income (NII) came in at  ₹1,971 crore up by 11.7% YoY but marginally down by 1% QoQ. Net interest margin (NIM) expanded by 10 bps YoY to 2.5% in Q3FY23, however, was down by 10 bps QoQ. The lender sustained improvements in NPA ratios during Q3. The bank's gross NPA dropped by 12.63% to 2.02% in Q3FY23 compared to 14.65% in Q3 of the previous fiscal. Also, gross NPA contracted by 10.87% compared to 12.89% in September 2022 quarter. Net NPA also declined sharply to 1.03% in Q3FY23 versus 5.29% in Q3FY22 and 3.60% in Q2FY23. The lender sustained improvements in NPA ratios during Q3. The bank's gross NPA dropped by 12.63% to 2.02% in Q3FY23 compared to 14.65% in Q3 of the previous fiscal. Also, gross NPA contracted by 10.87% compared to 12.89% in September 2022 quarter. Net NPA also declined sharply to 1.03% in Q3FY23 versus 5.29% in Q3FY22 and 3.60% in Q2FY23. Also, in value terms, gross NPA fell to  ₹3,903.68 crore in the third quarter of FY23, compared to  ₹28,654.49 crore in Q3 of the previous fiscal and  ₹27,419.11 crore in Q2FY23. Also, in value terms, gross NPA fell to  ₹3,903.68 crore in the third quarter of FY23, compared to  ₹28,654.49 crore in Q3 of the previous fiscal and  ₹27,419.11 crore in Q2FY23. Prashant Kumar, MD & CEO said, “During the quarter, the Bank successfully closed two deals which are strategic and transformational in this new journey of the Bank. The successful Capital Raise has aided in significant expansion in our Capital Base, and post full consummation, our CETI Ratio will reach an extremely comfortable level. Moreover, with successful transfer of stressed Assets to the JC Flowers ARC, the GNPA and NNPA Ratios have now declined to 2% and 1% respectively which is the lowest since Q3FY19.\" Prashant Kumar, MD & CEO said, “During the quarter, the Bank successfully closed two deals which are strategic and transformational in this new journey of the Bank. The successful Capital Raise has aided in significant expansion in our Capital Base, and post full consummation, our CETI Ratio will reach an extremely comfortable level. Moreover, with successful transfer of stressed Assets to the JC Flowers ARC, the GNPA and NNPA Ratios have now declined to 2% and 1% respectively which is the lowest since Q3FY19.\" At the same time, Kumar added, \"the operational momentum of the Bank continues with further step-up in Disbursements across segments and highest Operating Profit in the last eight quarters.\" At the same time, Kumar added, \"the operational momentum of the Bank continues with further step-up in Disbursements across segments and highest Operating Profit in the last eight quarters.\" The bank's gross slippages during the quarter were at  ₹1,607 crore. Recoveries and upgrades from fresh slippages were at  ₹500 crore in Q3 -- taking net slippages to  ₹1,100 crore. Yes Bank said, resolution momentum continues with Total Recoveries & Upgrades for Q3FY23 at  ₹1,270 crore, well on track to achieve the FY23 guidance. The bank's gross slippages during the quarter were at  ₹1,607 crore. Recoveries and upgrades from fresh slippages were at  ₹500 crore in Q3 -- taking net slippages to  ₹1,100 crore. Yes Bank said, resolution momentum continues with Total Recoveries & Upgrades for Q3FY23 at  ₹1,270 crore, well on track to achieve the FY23 guidance. However, despite a significant plunge in gross NPA, Yes Bank's provisions and contingencies climbed sharply by 125.48% to  ₹844.75 crore in Q3FY23 compared to  ₹374.64 crore in Q3FY22 and also up by 44.94% from  ₹582.81 crore in Q2FY23. However, despite a significant plunge in gross NPA, Yes Bank's provisions and contingencies climbed sharply by 125.48% to  ₹844.75 crore in Q3FY23 compared to  ₹374.64 crore in Q3FY22 and also up by 44.94% from  ₹582.81 crore in Q2FY23. In regards to the balance sheet, Yes Bank's net advances climbed by 10.4% YoY and 1.2% QoQ to  ₹194,573 crore in Q3FY23. The bank's retail advances mix was at 44% in Q3FY23 versus 41% in Q2FY23. In regards to the balance sheet, Yes Bank's net advances climbed by 10.4% YoY and 1.2% QoQ to  ₹194,573 crore in Q3FY23. The bank's retail advances mix was at 44% in Q3FY23 versus 41% in Q2FY23. The bank's new disbursements were to the tune of  ₹27,311 crore in Q3FY23 --- of which ---  ₹12,667 crore was gross retail assets disbursements,  ₹806 crore rural disbursements,  ₹6,104 crore SME sanctions, and  ₹7,724 crore wholesale banking disbursements. The bank's new disbursements were to the tune of  ₹27,311 crore in Q3FY23 --- of which ---  ₹12,667 crore was gross retail assets disbursements,  ₹806 crore rural disbursements,  ₹6,104 crore SME sanctions, and  ₹7,724 crore wholesale banking disbursements. While total deposits scaled up by 15.9% YoY and 6.8% QoQ to  ₹213,608 crore. CASA ratio at 29.9% up 31% in Q2FY23 and 30.4% in Q3FY23. The bank opened 3.40 lakh CASA accounts in Q3FY23 versus 3.31 lakh in Q2FY23. While total deposits scaled up by 15.9% YoY and 6.8% QoQ to  ₹213,608 crore. CASA ratio at 29.9% up 31% in Q2FY23 and 30.4% in Q3FY23. The bank opened 3.40 lakh CASA accounts in Q3FY23 versus 3.31 lakh in Q2FY23. Yes Bank's average liquidity coverage ratio stood healthy at 113.3% in Q3 of FY23. Yes Bank's average liquidity coverage ratio stood healthy at 113.3% in Q3 of FY23.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/ultratechs-q3-consolidated-pat-drops-by-38-yoy-to-rs-1-058-cr-key-highlights\/amp-11674291085248.html","pub_date":"2023-01-21T14:26:28+05:30","title":"Ultratech Cement's Q3 consolidated PAT drops by 38% YoY to  ₹1,058 cr, revenue rises on strong volumes","keywords":"Ultratech Cement Q3 results,Ultratech Cement Q3,Ultratech Cement Q3 net profit,Ultratech Cement Q3 earnings,Ultratech Cement Q3 net sales,Ultratech Cement financial results,Ultratech Cement Q3 revenue,Ultratech Cement Q3 volumes","articles":"In Q3FY23, the company's domestic grey cement sales volume rose 13% YoY and 12% QoQ, respectively. Energy and raw material costs were up 33% and 13% YoY, while they remained flat on a sequential basis. Also, the company achieved capacity utilisation of 83% as against 75% during Q3FY22.  Leading cement manufacturer, Ultratech Cement witnessed a mixed performance in terms of profitability in December 2022 quarter (Q3FY23), however, revenue garnered strong growth. Consolidated Q3 PAT dropped by 38.03% to  ₹1,058.20 crore compared to  ₹1,707.72 crore in the same quarter a year ago. However, sequentially, the company's PAT rose by 40.02% as against a profit of  ₹755.73 crore posted in the September 2022 quarter.  Leading cement manufacturer, Ultratech Cement witnessed a mixed performance in terms of profitability in December 2022 quarter (Q3FY23), however, revenue garnered strong growth. Consolidated Q3 PAT dropped by 38.03% to  ₹1,058.20 crore compared to  ₹1,707.72 crore in the same quarter a year ago. However, sequentially, the company's PAT rose by 40.02% as against a profit of  ₹755.73 crore posted in the September 2022 quarter.  Consolidated revenue from operations came in at  ₹15,520.93 crore in Q3FY23, rising by 19.53% from  ₹12,984.93 crore in Q3 of the previous fiscal. Also, revenue was up by 11.72% from  ₹13,892.69 crore in the preceding quarter. Consolidated revenue from operations came in at  ₹15,520.93 crore in Q3FY23, rising by 19.53% from  ₹12,984.93 crore in Q3 of the previous fiscal. Also, revenue was up by 11.72% from  ₹13,892.69 crore in the preceding quarter. Notably, UltraTech holds its operating profits with strong volume growth despite cost pressures. EBITDA came in at  ₹2,462 crore during the quarter. Notably, UltraTech holds its operating profits with strong volume growth despite cost pressures. EBITDA came in at  ₹2,462 crore during the quarter. Ultratech is the largest producer and manufacturer of grey cement, ready-mix concrete, and white cement in the country. Ultratech is the largest producer and manufacturer of grey cement, ready-mix concrete, and white cement in the country. In Q3FY23, the company's domestic grey cement sales volume rose 13% YoY and 12% QoQ, respectively. Energy and raw material costs were up 33% and 13% YoY, while they remained flat on a sequential basis. Also, the company achieved capacity utilisation of 83% as against 75% during Q3FY22. In Q3FY23, the company's domestic grey cement sales volume rose 13% YoY and 12% QoQ, respectively. Energy and raw material costs were up 33% and 13% YoY, while they remained flat on a sequential basis. Also, the company achieved capacity utilisation of 83% as against 75% during Q3FY22. During the quarter, Ultratech commissioned 18 MW of WHRS and 7 MW of solar power during the quarter. With these expansions, UltraTech's green energy share has gone up to 19.8% which includes 208 MW of WHRS and 325 MW of solar power. During the quarter, Ultratech commissioned 18 MW of WHRS and 7 MW of solar power during the quarter. With these expansions, UltraTech's green energy share has gone up to 19.8% which includes 208 MW of WHRS and 325 MW of solar power. In grey cement, the company commissioned 5.5 mtpa new capacity during Q3FY23 --- of which ---- 1.9 mtpa greenfield integrated cement plant at Pali Rajasthan; 1.8 mtpa greenfield grinding unit at Dhule, Maharashtra; and 1.8 mpta brownfield 2nd integrated unit at Dhar Madhya Pradesh. In grey cement, the company commissioned 5.5 mtpa new capacity during Q3FY23 --- of which ---- 1.9 mtpa greenfield integrated cement plant at Pali Rajasthan; 1.8 mtpa greenfield grinding unit at Dhule, Maharashtra; and 1.8 mpta brownfield 2nd integrated unit at Dhar Madhya Pradesh. Further, in the grey cement segment, Ultratech said, \"Work on the second phase of growth of 22.6 mtpa announced during Q1FY23 has already commenced. Main plant orders have been placed and civil work started at most sites. Commercial production from these new capacities is expected to go on stream in a phased manner by FY25.\" Further, in the grey cement segment, Ultratech said, \"Work on the second phase of growth of 22.6 mtpa announced during Q1FY23 has already commenced. Main plant orders have been placed and civil work started at most sites. Commercial production from these new capacities is expected to go on stream in a phased manner by FY25.\" Upon completion of these expansions, Ultratech expects its capacity to grow to 159.25 mtpa, reinforcing its position as the third largest cement company in the world, outside of China and the largest in India by far. Upon completion of these expansions, Ultratech expects its capacity to grow to 159.25 mtpa, reinforcing its position as the third largest cement company in the world, outside of China and the largest in India by far. In terms of white cement, Ultratech highlighted that the third Birla White wall care putty plant at Nathdwara, Rajasthan, with a capacity of 4 lac tpa was commissioned during the quarter. The existing two plants are situated at Kharia in Rajasthan and Katni in Madhya Pradesh. UltraTech now has a wall care putty capacity of 13 lac tpa, further strengthening its position in the markets. In terms of white cement, Ultratech highlighted that the third Birla White wall care putty plant at Nathdwara, Rajasthan, with a capacity of 4 lac tpa was commissioned during the quarter. The existing two plants are situated at Kharia in Rajasthan and Katni in Madhya Pradesh. UltraTech now has a wall care putty capacity of 13 lac tpa, further strengthening its position in the markets. Along with its existing white cement manufacturing capacity in India and its investment in Ras Al Khaimah Company for White Cement and Construction Material, UAE, UltraTech is strategically positioned to cater to the white cement and wall care putty market in the country, it said. Along with its existing white cement manufacturing capacity in India and its investment in Ras Al Khaimah Company for White Cement and Construction Material, UAE, UltraTech is strategically positioned to cater to the white cement and wall care putty market in the country, it said. On the outlook ahead, Ultratech said, given the government's focus on infrastructure growth and the consequent rising demand for urban housing, the cement sector is poised for strong growth in the coming years. On the outlook ahead, Ultratech said, given the government's focus on infrastructure growth and the consequent rising demand for urban housing, the cement sector is poised for strong growth in the coming years.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/elon-musk-says-twitter-has-a-headcount-of-about-2300\/amp-11674290989314.html","pub_date":"2023-01-21T14:24:15+05:30","title":"Elon Musk takes witness stand to defend Tesla buyout tweets","keywords":"Elon Musk,Twitter,Twitter headcount,Twitter jobs,Tesla","articles":"Trial over his Tesla tweets comes at a time when Musk has been focusing on Twitter while also serving as the automaker's CEO  Elon Musk took the witness stand Friday to defend a 2018 tweet claiming he had lined up the financing to take Tesla private in a deal that never came close to happening. Elon Musk took the witness stand Friday to defend a 2018 tweet claiming he had lined up the financing to take Tesla private in a deal that never came close to happening. The tweet resulted in a $40 million settlement with securities regulators. It also led to a class-action lawsuit alleging he misled investors, pulling him into court for about a half hour Friday to deliver sworn testimony in front of a nine-person jury and a full room of media and other spectators. The tweet resulted in a $40 million settlement with securities regulators. It also led to a class-action lawsuit alleging he misled investors, pulling him into court for about a half hour Friday to deliver sworn testimony in front of a nine-person jury and a full room of media and other spectators. The trial was then adjourned for the weekend and Musk was told to return Monday to answer more questions. In his initial appearance on the stand, Musk defended his prolific tweeting as “the most democratic way\" to distribute information even while acknowledging constraints of Twitter's 280-character limit can make it difficult to make everything as clear as possible. “I think you can absolutely be truthful (on Twitter),\" Musk asserted on the stand. “But can you be comprehensive? Of course not,\" Musk's latest headache stems from the inherent brevity on Twitter, a service that he has been running since completing his $44 billion purchase of it in October. The trial hinges on the question of whether a pair of tweets that Musk posted on Aug. 7, 2018, damaged Tesla shareholders during a 10-day period leading up to a Musk admission that the buyout he had envisioned wasn’t going to happen. In the first of those those two 2018 tweets, Musk stated “funding secured\" for a what would have been a $72 billion buyout of Tesla at a time when the electric automaker was still grapping with production problems and was worth far less than it is now. Musk followed up a few hours later with another tweet suggesting a deal was imminent. After it became apparent that the money wasn't in place to take Tesla private, Musk stepped down as Tesla’s chairman while remaining CEO as part of the Securities and Exchange Commission settlement, without acknowledging any wrongdoing. The impulsive billionaire came into court wearing a dark suit and tie on the third day of the civil trial in San Francisco that his lawyer unsuccessfully tried to move to Texas, where Tesla is now headquartered, on the premise that media coverage of his tumultuous takeover of Twitter had tainted the jury pool. The jury that was assembled earlier this week focused intently on Musk while he answered questions posed by Nicholas Porritt, a lawyer representing Tesla shareholders. At one point, Musk asked Porritt if he would speak closer to the microphone so he could hear him better. At other times, Musk craned his neck as he gazed around the courtroom. Musk, 51, said he cares “a great deal\" about investors and also railed against short sellers who make investments that reward them when a company's stock price falls. He called short selling an “evil\" practice that should be outlawed, denigrating those who profit from it as “a bunch of sharks.\" When shown communications from Tesla investors urging him to curtail or completely stop his Twitter habit before the 2018 buyout tweet, Musk said he couldn't remember all those interactions from years ago, especially since he gets a “Niagara Falls\" of emails. Even before Musk took the stand, U.S. District Judge Edward Chen had declared that the jurors can consider those two tweets to be false, leaving them to decide whether Musk deliberately deceived investors and whether his statements saddled them with losses. Musk has previously contended he entered into the SEC settlement under duress and maintained he believed he had locked up financial backing for a Tesla buyout during meetings with representatives from Saudi Arabia’s Public Investment Fund. An expert on corporate buyouts hired by shareholder lawyers to study the events surrounding Musk's proposal to take Tesla private spent the bulk of his three hours on the stand Friday deriding the plan as an ill-conceived concept. “This proposal was an extreme outlier,\" said Guhan Subramanian, a Harvard University business and law professor for more than 20 years. “It was incoherent. It was illusory.\" In a lengthy cross examination that delayed Musk's appearance, a lawyer for Tesla's board of directors tried to undermine Subramanian's testimony by pointing out that it relied on graduate student assistance to review some of the material related to the August 2018 tweets. The lawyer, William Price, also noted Subramanian's $1,900-per-hour fee for compiling his report for the case. The trial over his Tesla tweets come at a time when Musk has been focusing on Twitter while also serving as the automaker's CEO and also remaining deeply involved in SpaceX, the rocket ship company he founded. Musk’s leadership of Twitter — where he has gutted the staff and alienated users and advertisers — has proven unpopular among Tesla’s current stockholders, who are worried he has been devoting less time steering the automaker at a time of intensifying competition. Those concerns contributed to a 65% decline in Tesla’s stock last year that wiped out more than $700 billion in shareholder wealth — far more than the $14 billion swing in fortune that occurred between the company’s high and low stock prices during the Aug. 7-17, 2018 period covered in the class-action lawsuit. Tesla’s stock has split twice since then, making the $420 buyout price cited in his 2018 tweet worth $28 on adjusted basis now. The company's shares were trading around $133.42 Friday, down from the company’s November 2021 split-adjusted peak of $414.50. After Musk dropped the idea of a Tesla buyout, the company overcame its production problems, resulting in a rapid upturn in car sales that caused its stock to soar and minted Musk as the world’s richest person until he bought Twitter. Musk dropped from the top spot on the wealth list after the stock market’s backlash to his handling of Twitter. When asked Friday about the challenges that Tesla faced in 2018, he recalled spending many nights sleeping at the automaker's California factory as he tried to keep the company afloat. “The sheer level of pain to make Tesla successful during that 2017, 2018 period was excruciating,\" he recalled.","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/twitter-has-about-2-300-workers-elon-musk-after-report-of-headcount-reduction\/amp-11674289540295.html","pub_date":"2023-01-21T14:23:38+05:30","title":"Twitter has about 2,300 workers: Elon Musk after report of headcount reduction","keywords":"Elon Musk,Twitter,Elon Musk Twitter,Twitter headcount,Twitter update","articles":"A report stated that about 75 of Twitter's 1,300 employees are on leave including about 40 engineers.   New Twitter chief Elon Musk said that the company has about 2,300 active employees. He gave the information about the Twitter headcount in a tweet on Saturday.  New Twitter chief Elon Musk said that the company has about 2,300 active employees. He gave the information about the Twitter headcount in a tweet on Saturday.  Citing internal records, CNBC reported that Twitter's full-time headcount has reduced to about 1,300 active, working employees including fewer than 550 full-time engineers by title, according to news agency Reuters.  Citing internal records, CNBC reported that Twitter's full-time headcount has reduced to about 1,300 active, working employees including fewer than 550 full-time engineers by title, according to news agency Reuters.  The report also stated that about 75 of Twitter's 1,300 employees are on leave including about 40 engineers.  The report also stated that about 75 of Twitter's 1,300 employees are on leave including about 40 engineers.  Responding to a tweet quoting CNBC, the billionaire said, “The note is incorrect. There are about 2300 active, working employees at Twitter. There are still hundreds of employees working on trust & safety, along with several thousand contractors.\" Responding to a tweet quoting CNBC, the billionaire said, “The note is incorrect. There are about 2300 active, working employees at Twitter. There are still hundreds of employees working on trust & safety, along with several thousand contractors.\" Earlier on January 18, sources familiar with the company informed that Twitter is planning to fire 50 employees from its product team in the coming weeks.  Earlier on January 18, sources familiar with the company informed that Twitter is planning to fire 50 employees from its product team in the coming weeks.  The layoffs occur six weeks after Elon Musk, the company's top executive, had allegedly told colleagues there would be no further layoffs. The reports stated that it might result in less than 2,000 people working for the company.  The layoffs occur six weeks after Elon Musk, the company's top executive, had allegedly told colleagues there would be no further layoffs. The reports stated that it might result in less than 2,000 people working for the company.  Fears of an increase in hate speech on Twitter have been fuelled by staff reductions to date, which also affected personnel in the content moderation division. Twitter did not immediately respond to a Reuters request for comment. Fears of an increase in hate speech on Twitter have been fuelled by staff reductions to date, which also affected personnel in the content moderation division. Twitter did not immediately respond to a Reuters request for comment. A top ad executive told during a staff meeting that Twitter's revenue for the fourth quarter dropped by around 35% to $1.025 billion. A top ad executive told during a staff meeting that Twitter's revenue for the fourth quarter dropped by around 35% to $1.025 billion. Musk took over Twitter in October and swiftly moved through a number of product and organizational changes. The company rolled out Twitter-verified Blue check-mark as a paid service and also laid off about 50% staff.  Musk took over Twitter in October and swiftly moved through a number of product and organizational changes. The company rolled out Twitter-verified Blue check-mark as a paid service and also laid off about 50% staff.      (With Reuters inputs) (With Reuters inputs)","scraped_date":"2023-01-23"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/kotak-mahindra-bank-garners-31-rise-in-q3-pat-to-rs-2-972-cr-provisions-scale-up\/amp-11674287914863.html","pub_date":"2023-01-21T13:32:44+05:30","title":"Kotak Mahindra Bank garners 31% rise in Q3 PAT to  ₹2,972 cr, provisions scale up","keywords":"Kotak Mahindra Bank Q3 results,Kotak Mahindra Bank Q3,Kotak Mahindra Bank Q3 earnings","articles":"The bank garnered a standalone net profit of  ₹2,791.88 crore in Q3 of the current fiscal FY23 compared to  ₹2,131 .36 crore a year ago same quarter, registering a growth of a whopping 30.99% year-on-year.  Kotak Mahindra Bank beats street estimates in terms of profitability during December 2022 quarter. The bank garnered a standalone net profit of  ₹2,791.88 crore in Q3 of the current fiscal FY23 compared to  ₹2,131 .36 crore a year ago same quarter, registering a growth of a whopping 30.99% year-on-year. Kotak's asset quality improved with gross NPA declining sharply, however, provisions increased during the quarter. Kotak Mahindra Bank beats street estimates in terms of profitability during December 2022 quarter. The bank garnered a standalone net profit of  ₹2,791.88 crore in Q3 of the current fiscal FY23 compared to  ₹2,131 .36 crore a year ago same quarter, registering a growth of a whopping 30.99% year-on-year. Kotak's asset quality improved with gross NPA declining sharply, however, provisions increased during the quarter. However, Q3 PAT scaled up by 8.17% from the profit of  ₹2,581 crore that was recorded in the September 2022 quarter. However, Q3 PAT scaled up by 8.17% from the profit of  ₹2,581 crore that was recorded in the September 2022 quarter. Net interest income (NII) which is the difference between interest earned and interest expended, came in at  ₹5,653 crore in Q3 of FY23. The latest quarter's NII climbed by 30.43% from  ₹4,334 crore in Q3FY22 and was up by 10.86% from  ₹5,099 crore in Q2FY23. Net interest income (NII) which is the difference between interest earned and interest expended, came in at  ₹5,653 crore in Q3 of FY23. The latest quarter's NII climbed by 30.43% from  ₹4,334 crore in Q3FY22 and was up by 10.86% from  ₹5,099 crore in Q2FY23. Net interest margin (NIM) expanded to 5.47% in Q3FY23 from 4.62% in the year-ago same period. Net interest margin (NIM) expanded to 5.47% in Q3FY23 from 4.62% in the year-ago same period. Noteworthily, the bank witnessed an upside in its provisions and contingencies which came in at  ₹148.83 crore in Q3FY23 compared to a provisions loss of  ₹131 .74 crore in Q3FY22. Also, it was up from provisions of  ₹137 crore in Q2FY23. Noteworthily, the bank witnessed an upside in its provisions and contingencies which came in at  ₹148.83 crore in Q3FY23 compared to a provisions loss of  ₹131 .74 crore in Q3FY22. Also, it was up from provisions of  ₹137 crore in Q2FY23. On the contrary, asset quality continued to improve significantly with gross non-performing assets (NPA) coming under 2% in the current quarter. On the contrary, asset quality continued to improve significantly with gross non-performing assets (NPA) coming under 2% in the current quarter. In Q3FY23, in percentage terms, Kotak posted a gross NPA that stood at 1.90% --- contracting by 81 bps from 2.71% in Q3FY22 and down by 18 bps from 2.08% in Q2FY23. In Q3FY23, in percentage terms, Kotak posted a gross NPA that stood at 1.90% --- contracting by 81 bps from 2.71% in Q3FY22 and down by 18 bps from 2.08% in Q2FY23. Also, net NPA dipped steeply to 0.43% in Q3FY23 versus 0.79% in Q3FY22 and 0.55% in Q2FY23. Also, net NPA dipped steeply to 0.43% in Q3FY23 versus 0.79% in Q3FY22 and 0.55% in Q2FY23. In value terms as well the asset quality bettered in Q3FY23. The gross NPA stood at  ₹5,994.57 crore as of December 31, 2022, compared to  ₹6,982.80 crore and  ₹6,210.23 crore in Q3FY22 and Q2FY23. In value terms as well the asset quality bettered in Q3FY23. The gross NPA stood at  ₹5,994.57 crore as of December 31, 2022, compared to  ₹6,982.80 crore and  ₹6,210.23 crore in Q3FY22 and Q2FY23. Kotak's total advances climbed by 23% YoY and 6% QoQ to  ₹310,734 crore as of December 31, 2022. Under the advances, the bank posted 29% YoY growth in home loans & loans against property to the tune of  ₹89,112 crore, while credit cards came in at  ₹9,159 crore rising by a whopping 85% YoY. Loans for PL, BL, and Consumer Durables climbed by 69% YoY to  ₹14,542 crore. On the other hand, SME loans picked up by 25% YoY to  ₹23,154 crore among others. Kotak's total advances climbed by 23% YoY and 6% QoQ to  ₹310,734 crore as of December 31, 2022. Under the advances, the bank posted 29% YoY growth in home loans & loans against property to the tune of  ₹89,112 crore, while credit cards came in at  ₹9,159 crore rising by a whopping 85% YoY. Loans for PL, BL, and Consumer Durables climbed by 69% YoY to  ₹14,542 crore. On the other hand, SME loans picked up by 25% YoY to  ₹23,154 crore among others. Meanwhile, total deposits were at  ₹344,666 crore up by 12.89% YoY and 5.98% QoQ. Customers' assets came in at  ₹339,313 crore versus  ₹274,569 crore in Q3FY23. CASA ratio stood at 53.3% versus 59.9% in Q3FY22. Meanwhile, total deposits were at  ₹344,666 crore up by 12.89% YoY and 5.98% QoQ. Customers' assets came in at  ₹339,313 crore versus  ₹274,569 crore in Q3FY23. CASA ratio stood at 53.3% versus 59.9% in Q3FY22.","scraped_date":"2023-01-23"}
