{"news_link":"https:\/\/www.livemint.com\/companies\/news\/commercial-business-to-drive-kotak-mahindra-bank-growth-manish-kothari\/amp-11674497924203.html","pub_date":"2023-01-23T23:48:43+05:30","title":"Commercial business to drive Kotak Mahindra Bank growth: Manish Kothari","keywords":"Kotak Mahindra Bank,commercial banking,commercial vehicles,manish Kothari","articles":"Kotak Mahindra Bank expects to grow its commercial banking book to  ₹1 trillion next fiscal, driven by demand for commercial vehicles and equipment, and gold loans  Kotak Mahindra Bank expects to grow its commercial banking book to  ₹1 trillion next fiscal, driven by demand for commercial vehicles and equipment, and gold loans.  Kotak Mahindra Bank expects to grow its commercial banking book to  ₹1 trillion next fiscal, driven by demand for commercial vehicles and equipment, and gold loans.  “Currently, the overall book size is at about  ₹75,000 crore, and we can look at over  ₹1 trillion in the coming fiscal (FY24),\" Manish Kothari, president and head of commercial banking at Kotak Mahindra Bank, said in an interview.  “Currently, the overall book size is at about  ₹75,000 crore, and we can look at over  ₹1 trillion in the coming fiscal (FY24),\" Manish Kothari, president and head of commercial banking at Kotak Mahindra Bank, said in an interview.  Kotak’s commercial banking unit, comprising agriculture finance, tractor finance, commercial vehicles finance, construction equipment finance, microfinance and gold loans, accounted for 23% of its advances as of 31 March 2022. Kotak is optimistic about credit growth as the recovery in economic activity after the pandemic and the government’s infrastructure spending have driven demand for loans for vehicles and construction equipment. The government’s focus on clean water and sanitation, in addition to roads and highways, has also created new opportunities for the bank. The commercial vehicle industry is bouncing back after the pandemic and is likely to grow 25-27% in FY23, Kothari said. The bank, he said, would look to expand its commercial vehicle disbursements at 60%, faster than the overall industry.  “We are ramping up the small commercial vehicle business. The segment where we have a greater market share—of close to 8-9%—is in medium, heavy and light commercial vehicles,\" said Kothari, adding that the bank has about 3% market share in the small commercial vehicles space and is looking to double it in the next couple of years.  In the financing of commercial equipment, Kothari said the bank is ranked No. 3 in the business, although it is very difficult to get the data on the number of units sold because a lot of equipment is not registered. “This year, construction equipment should grow at anywhere 15-20%, and we will be in line with the growth of the industry,\" he said.  Given that the demand for commercial equipment is linked to growth in infrastructure, Kothari said that the government boost to the infrastructure space has been useful.  “A significant amount of government spending continues to happen in the infrastructure space. More segments are opening up beyond roads and highways. I guess water is a space in which there is a significant investment,\" he said. As of 31 December, the aggregate size of its commercial vehicle and commercial equipment loan book stood at  ₹25,814 crore, up 27% from last year.  Kothari said the bank is also looking to accelerate growth in its gold loan business. Currently, gold loans are available in about 500 branches, and the bank is putting the entire business model in place and aims to grow the book next year.  “From February onwards, we will go to market and begin talking about the product. Not too many people are aware that Kotak has gold loans. So, we will look to build it to 2-2.5 times where we are right now,\" he said.  According to him, gold loans need clear infrastructure, and processes must be very different. The customer comes with the gold jewellery into the branch, and so branches need to have safe-keeping, a place for the customer to be attended to and an external valuer to come and value the gold, Kothari said. “So, that is a piece, which largely is in place now. We have covered a lot of branches in the last 12 months in terms of putting the infrastructure in place and will now look to accelerate,\" he said.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/tax-credits-for-charity-spending-by-businesses-may-go\/amp-11674497300630.html","pub_date":"2023-01-23T23:38:20+05:30","title":"Tax credits for charity spending by businesses may go","keywords":"GST,CSR,social responsibility,philanthropy,Finance Bill 2023,amendments  to  GST  law,GST Council","articles":"Govt  may  introduce  amendments  to  GST  law  through  Finance Bill,  2023  The government is likely to introduce amendments to Goods and Services Tax (GST) law through the Finance Bill, 2023, denying businesses credit for the taxes paid while procuring goods and services that they provide to the community under their corporate social responsibility (CSR) obligations. The government is likely to introduce amendments to Goods and Services Tax (GST) law through the Finance Bill, 2023, denying businesses credit for the taxes paid while procuring goods and services that they provide to the community under their corporate social responsibility (CSR) obligations. This would mean that the taxes that are part of the goods and services used in CSR activities cannot be adjusted against the company’s overall GST liability, according to two persons aware about discussions in the Central government. “This would be a major change to the GST law,\" said one of the persons. The plan is to amend sections in the GST Act (16 and 17) dealing with input tax credit or ITC. This would mean that the taxes that are part of the goods and services used in CSR activities cannot be adjusted against the company’s overall GST liability, according to two persons aware about discussions in the Central government. “This would be a major change to the GST law,\" said one of the persons. The plan is to amend sections in the GST Act (16 and 17) dealing with input tax credit or ITC. One of the cornerstones of GST is availability of credit to a business for the taxes paid on purchases so that tax applies only to the value addition at each stage of the supply chain and there is no tax on tax. However, credit for GST paid while procuring goods and services for meeting CSR obligations has been a grey area with different advance ruling authorities giving contradictory orders. This has warranted clearing the air through legislative amendments, said the first person quoted above. It is through the annual Finance Bill, changes in various tax laws such as Income Tax Act, Customs Act, CGST Act and IGST Acts are implemented. The advance ruling authorities in Uttar Pradesh, Telangana, Gujarat and Kerala have examined the issue whether the taxes paid as part of CSR activities is “in the course or furtherance of his business\"—the criteria for credit to be available for taxes paid on purchases--and have given diametrically opposite views. While the Telangana State Authority for Advance Ruling and the Authority for Advance Ruling in Uttar Pradesh said that GST on inputs procured for CSR is available as credit, the authorities in Gujarat and Kerala ordered otherwise on this specific question, showed the orders that are available in the public domain. The Telangana State Authority for Advance Ruling noted in its 20 October 2022 order that CSR spending mandated under Companies Act is an expenditure made in the furtherance of the business. “Hence the tax paid on purchases made to meet the obligations under corporate social responsibility will be eligible for input tax credit under Central GST and State GST Acts,\" said the order. The UP Authority explained in its January 2020 ruling that CSR spending is not voluntary, but is a statutory obligation under company law and hence tax credit on it is not restricted. However, the Gujarat Authority for Advance Ruling in its August 2021 order explained that CSR activities are excluded from normal course of business and therefore not eligible for input tax credit. The move to specify in the CGST Act that input tax credit will not be available to businesses on CSR is relevant for large companies like Reliance Industries, TCS, Tata Sons, HDFC Bank Ltd. and ONGC, the highest CSR spenders as per official data. In FY21, Reliance Industries spent  ₹922 crores on CSR, followed by TCS with a spending of  ₹674 crore and Tata Sons with  ₹546 crores, while HDFC Bank Ltd. spent  ₹534 crores and ONGC Ltd. spent  ₹531 crores. India Inc. spent more than  ₹25,700 crore on CSR in FY21. Spending on corporate social responsibility by the industry has seen a sharp jump in recent years, up from over  ₹14,300 crore spent in FY17. In January 2021, the government gave effect to a penalty provision for defaulting on CSR spending obligation and allowed businesses to spend more than their obligation which could be adjusted against their future spending requirement. Companies with a net worth of  ₹500 crore or more, or a turnover of  ₹1,000 crore or more, or net profit of  ₹five crore or more, are required to spend 2% of their average net profit of the preceding three years on CSR activities. Companies have to spend the amount computed in this way on CSR whether or not they get tax credits. The advantage of getting input tax credit is that it could be used to pay off at least part of the GST liability on the company’s sales. Queries emailed to the spokesperson for the finance ministry and to the GST Council Secretariat on Friday seeking comments for the story remained unanswered at the time of publishing.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/tvs-motors-q3-preview-revenue-to-grow-volume-to-remain-flat\/amp-11674496802331.html","pub_date":"2023-01-23T23:32:36+05:30","title":"TVS Motors Q3 preview: Revenue to grow, volume to remain flat","keywords":"tvs motor,tvs motors q3 preview,tvs motors share price","articles":"Two-wheelers major’s standalone revenue from operations in Q3FY23 is likely to see a growth of 7.3 per cent  while PAT to  increase by 17 per cent  Two-wheeler maker TVS Motors is expected to post growth in revenue while profit is also likely to grow though EBITDA margins is to remain largely flat. TVS Motors will declare it December quarter results 24 January,2023. Two-wheeler maker TVS Motors is expected to post growth in revenue while profit is also likely to grow though EBITDA margins is to remain largely flat. TVS Motors will declare it December quarter results 24 January,2023. In December quarter, two-wheeler demand, especially in the entry segment, failed to revive, even in the festive season. This made OEMs resort to inventory correction in the months of November and December, said HDFC Securities. In December quarter, two-wheeler demand, especially in the entry segment, failed to revive, even in the festive season. This made OEMs resort to inventory correction in the months of November and December, said HDFC Securities. Two-wheelers major’s standalone revenue from operations in Q3FY23 is likely to see a growth of 7.3 per cent at  ₹6,119.9 crore against  ₹5,706 crore earned during the same period a year ago. The company’s Q3 profit after taxes (PAT) is expected to jump 17.7 per cent at  ₹339.4 crore in Q3FY23 vs  ₹288.3 crore during Q3FY22, according to Sharekhan. Two-wheelers major’s standalone revenue from operations in Q3FY23 is likely to see a growth of 7.3 per cent at  ₹6,119.9 crore against  ₹5,706 crore earned during the same period a year ago. The company’s Q3 profit after taxes (PAT) is expected to jump 17.7 per cent at  ₹339.4 crore in Q3FY23 vs  ₹288.3 crore during Q3FY22, according to Sharekhan. TVS Motors' earnings before interest, taxes, depreciation, and amortisation (EBITDA) is likely to grow by 30 bps q-o-q to 11.5%, driven by improved product mix, and softening raw material prices TVS Motors' earnings before interest, taxes, depreciation, and amortisation (EBITDA) is likely to grow by 30 bps q-o-q to 11.5%, driven by improved product mix, and softening raw material prices \"Revenue is expected to grow by 7.3% y-o-y, aided by 7% increase in average realisations and 0.2% volume growth. Average realisation is expected to improve on back of improved product mix. EBITDA margins to increase by 30 bps q-o-q to 11.5%, driven by improved product mix, and softening raw material prices, while PAT to report an increase of 17.7% y-o-y at Rs339 crore in Q3FY23E,\" said brokerage report Sharekhan. \"Revenue is expected to grow by 7.3% y-o-y, aided by 7% increase in average realisations and 0.2% volume growth. Average realisation is expected to improve on back of improved product mix. EBITDA margins to increase by 30 bps q-o-q to 11.5%, driven by improved product mix, and softening raw material prices, while PAT to report an increase of 17.7% y-o-y at Rs339 crore in Q3FY23E,\" said brokerage report Sharekhan. HDFC Securities expect two-wheeler sales to come at 8,35,938 units and total sales at 8,79,423 units driven by domestic sales. HDFC Securities expect two-wheeler sales to come at 8,35,938 units and total sales at 8,79,423 units driven by domestic sales. \"We expect TVS to post a slight improvement in margin QoQ to 10.5%, aided by price hikes and soft input costs. TVS Motors volume remained flat YoY, RE did well by posting 31% YoY volume growth, led by its new launch and over a relatively low base,\" said HDFC Securities. \"We expect TVS to post a slight improvement in margin QoQ to 10.5%, aided by price hikes and soft input costs. TVS Motors volume remained flat YoY, RE did well by posting 31% YoY volume growth, led by its new launch and over a relatively low base,\" said HDFC Securities. On Monday, the company's scrip ended 1.23 per cent up at  ₹981.85 on BSE. On Monday, the company's scrip ended 1.23 per cent up at  ₹981.85 on BSE.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/tata-motors-confirms-delisting-from-nyse-termination-of-ads-programme\/amp-11674493765465.html","pub_date":"2023-01-23T22:47:53+05:30","title":"Tata Motors confirms delisting from NYSE, termination of ADS programme","keywords":"tata motors,american depositary shares","articles":"After Monday, there will be no over-the-counter market trading of the American Depositary Shares (ADSs) in the US due to regulatory restrictions under the Indian law  Tata Motors on Monday said the voluntary delisting of its American Depositary Shares, representing ordinary shares, from the New York Stock Exchange will become effective close of trading on January 23, 2023. Tata Motors on Monday said the voluntary delisting of its American Depositary Shares, representing ordinary shares, from the New York Stock Exchange will become effective close of trading on January 23, 2023. It is after the company filed Form 25 with the Securities and Exchange Commission on January 13, 2023, said Tata Motors in regulatory filing. It is after the company filed Form 25 with the Securities and Exchange Commission on January 13, 2023, said Tata Motors in regulatory filing. After Monday, there will be no over-the-counter market trading of the American Depositary Shares (ADSs) in the US due to regulatory restrictions under the Indian law, Tata Motors said in a regulatory filing. After Monday, there will be no over-the-counter market trading of the American Depositary Shares (ADSs) in the US due to regulatory restrictions under the Indian law, Tata Motors said in a regulatory filing. “As a consequence of the delisting becoming effective, termination of the Amended and Restated Deposit Agreement, dated as of September 27, 2004, as amended by Amendment No. 1 to the Amended and Restated Deposit Agreement, dated as of December 16, 2009 (so amended, the “Deposit Agreement\"), by and among the Company, Citibank, N.A. as Depositary (the “Depositary\") and the Holders and Beneficial Owners of the ADSs, will also become effective close of trading on the NYSE on January 23, 2023. After January 23, 2023, there will be no over-the-counter market trading of the ADSs in the United States due to regulatory restrictions under Indian law,\" said company in its regulatory filing. “As a consequence of the delisting becoming effective, termination of the Amended and Restated Deposit Agreement, dated as of September 27, 2004, as amended by Amendment No. 1 to the Amended and Restated Deposit Agreement, dated as of December 16, 2009 (so amended, the “Deposit Agreement\"), by and among the Company, Citibank, N.A. as Depositary (the “Depositary\") and the Holders and Beneficial Owners of the ADSs, will also become effective close of trading on the NYSE on January 23, 2023. After January 23, 2023, there will be no over-the-counter market trading of the ADSs in the United States due to regulatory restrictions under Indian law,\" said company in its regulatory filing. The ADS holders can surrender their ADSs to the Depositary in exchange for the underlying ordinary shares of the company at any time on or prior to July 24, 2023, it added. The ADS holders can surrender their ADSs to the Depositary in exchange for the underlying ordinary shares of the company at any time on or prior to July 24, 2023, it added. Starting on or about July 25, 2023, the Depositary may sell the then remaining ordinary shares held on deposit upon the terms described in the notice of termination of ADS facility as provided for in the deposit agreement, it said. Starting on or about July 25, 2023, the Depositary may sell the then remaining ordinary shares held on deposit upon the terms described in the notice of termination of ADS facility as provided for in the deposit agreement, it said. \"The above action has no impact on the current listing status or trading of the company's equity shares on the BSE Limited and the National Stock Exchange of India Limited in India,\" it noted. \"The above action has no impact on the current listing status or trading of the company's equity shares on the BSE Limited and the National Stock Exchange of India Limited in India,\" it noted.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/nykaa-ropes-in-p-ganesh-as-chief-financial-officer-effective-from-3-feb\/amp-11674493238187.html","pub_date":"2023-01-23T22:43:09+05:30","title":"Nykaa ropes in P Ganesh as Chief Financial Officer, effective from 3 Feb","keywords":"Nykaa,Nykaa CFO,Nykaa appoints P Ganesh,Nykaa P Ganesh CFO,P Ganesh,Nykaa share price,Nykaa shares record low","articles":"Ganesh joins Nykaa from the TAFE Group, a leading manufacturer and marketer of tractors in India, with iconic brands like Massey Ferguson and Eicher.  Fashion e-retailer, Nykaa on Monday announced the appointment of P Ganesh as their Chief Financial Officer to further strengthen and boost its financial operations and key long-term business strategies. Ganesh is currently CFO of TAFE Group and will take up his role at Nykaa from 3rd February. Fashion e-retailer, Nykaa on Monday announced the appointment of P Ganesh as their Chief Financial Officer to further strengthen and boost its financial operations and key long-term business strategies. Ganesh is currently CFO of TAFE Group and will take up his role at Nykaa from 3rd February. Ganesh is a successor of Arvind Agarwal who resigned from his post of CFO at Nykaa in the month of November last year. Ganesh is a successor of Arvind Agarwal who resigned from his post of CFO at Nykaa in the month of November last year. On the CFO appointment, Falguni Nayar, Founder, and CEO, Nykaa said, \"We are pleased to welcome Ganesh to our leadership team and be part of Nykaa’s growth story that will benefit from his rich financial experience. His knowledge about the Indian financial market and insights into International markets will be valuable in guiding Nykaa’s journey as a leader in beauty and lifestyle omnichannel retail.\" On the CFO appointment, Falguni Nayar, Founder, and CEO, Nykaa said, \"We are pleased to welcome Ganesh to our leadership team and be part of Nykaa’s growth story that will benefit from his rich financial experience. His knowledge about the Indian financial market and insights into International markets will be valuable in guiding Nykaa’s journey as a leader in beauty and lifestyle omnichannel retail.\" Meanwhile, Ganesh said, \"I’m excited to join Team Nykaa and become a part of the remarkable Nykaa growth journey as it expands its presence further by entering new markets, products and geographies. I look forward to leveraging my expertise and contribute to what I believe is an exciting phase in the Nykaa journey as it continues to grow and scale its businesses.’’ Meanwhile, Ganesh said, \"I’m excited to join Team Nykaa and become a part of the remarkable Nykaa growth journey as it expands its presence further by entering new markets, products and geographies. I look forward to leveraging my expertise and contribute to what I believe is an exciting phase in the Nykaa journey as it continues to grow and scale its businesses.’’ Ganesh joins Nykaa from the TAFE Group, a leading manufacturer and marketer of tractors in India, with iconic brands like Massey Ferguson and Eicher. He previously held leadership and senior management roles in India and overseas and has been associated with the Godrej Group, Glenmark Pharma, and Pidilite. Ganesh joins Nykaa from the TAFE Group, a leading manufacturer and marketer of tractors in India, with iconic brands like Massey Ferguson and Eicher. He previously held leadership and senior management roles in India and overseas and has been associated with the Godrej Group, Glenmark Pharma, and Pidilite. He brings with him vast experience in Financial Reporting, Business Finance, Domestic and International Taxation, Investor Relations, Banking, Mergers and Acquisitions, and Corporate Law. He brings with him vast experience in Financial Reporting, Business Finance, Domestic and International Taxation, Investor Relations, Banking, Mergers and Acquisitions, and Corporate Law. Ganesh is a qualified Chartered Accountant, Cost and Management Accountant, and Company Secretary with over 27 years of diverse industry experience in domestic and international markets. Ganesh is a qualified Chartered Accountant, Cost and Management Accountant, and Company Secretary with over 27 years of diverse industry experience in domestic and international markets. Nykaa shares have been in a free fall for the past eight consecutive day. On Monday, Nykaa shares closed at  ₹124.75 apiece down by 1.96% on BSE. Earlier, in the day, Nykaa shares dropped to a new record low of  ₹120.75 apiece. Nykaa shares have been in a free fall for the past eight consecutive day. On Monday, Nykaa shares closed at  ₹124.75 apiece down by 1.96% on BSE. Earlier, in the day, Nykaa shares dropped to a new record low of  ₹120.75 apiece. Nykaa is yet to announce its third-quarter results for FY23. However, in Q2 of the current financial year 2022-23, Nykaa posted a multi-fold increase in its consolidated net profit at  ₹5 crore as compared to  ₹1 crore in the same period a year ago. The consolidated Gross Merchandise Value (GMV) grew 45%year-on-year (YoY) to  ₹2,345.7 crore in Q2 FY23. Nykaa is yet to announce its third-quarter results for FY23. However, in Q2 of the current financial year 2022-23, Nykaa posted a multi-fold increase in its consolidated net profit at  ₹5 crore as compared to  ₹1 crore in the same period a year ago. The consolidated Gross Merchandise Value (GMV) grew 45%year-on-year (YoY) to  ₹2,345.7 crore in Q2 FY23.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/nclt-reserves-order-on-torrent-plea-to-halt-fresh-auction-for-rcap\/amp-11674492869527.html","pub_date":"2023-01-23T22:38:17+05:30","title":"NCLT reserves order on Torrent plea to halt fresh auction for RCap","keywords":"reliance capital,torrent investments,creditor","articles":"Torrent Investments had filed a plea before the tribunal on January 9, seeking to squash the lenders' plans to hold a fresh auction for the debt-ridden Reliance Capital  The National Company Law Tribunal (NCLT) on Monday reserved its order on fresh auction for the Anil Ambani-promoted Reliance Capital, directing lenders to maintain status quo till the final order is passed by the tribunal. The National Company Law Tribunal (NCLT) on Monday reserved its order on fresh auction for the Anil Ambani-promoted Reliance Capital, directing lenders to maintain status quo till the final order is passed by the tribunal. The Mumbai-bench of the NCLT, led by Justice Shyam Babu Gautam and Justice Pradeep Narhari Deshmukh, directed the Committee of Creditors (CoC) to maintain status quo on the 'Challenge Mechanism' till the final order is passed by the tribunal in the week starting January 30. The Mumbai-bench of the NCLT, led by Justice Shyam Babu Gautam and Justice Pradeep Narhari Deshmukh, directed the Committee of Creditors (CoC) to maintain status quo on the 'Challenge Mechanism' till the final order is passed by the tribunal in the week starting January 30. The tribunal had concluded the hearing on Torrent Investments' plea seeking squashing the lenders' plans to hold a fresh auction for the takeover of Reliance Capital on Friday and asked all parties to submit written notes by Monday. \"We have perused the written notes of both sides. Having considered the same and as admittedly interim order is in force till today and the applications are already heard on merits and are closed for orders, we find no reason to not to continue the interim directions... all the more, the applications can be notified for pronouncement for order shortly in the week commencing from January, 30, 2023,\" the order stated. In the circumstances, it said, interim order in force will continue inclusive of stay to second challenge mechanism, the order added. Torrent Investments had filed a plea before the tribunal on January 9, seeking to squash the lenders' plans to hold a fresh auction for the debt-ridden Reliance Capital. Torrent Investment was the highest bidder offering  ₹8,640 crore in the last round of the 'Challenge Mechanism'. Reliance Capital has a consolidated debt of about  ₹40,000 crore. The Reserve Bank of India (RBI) had applied to initiate Corporate Insolvency Resolution Process (CIRP) against the Reliance Group company at NCLT Mumbai. Subsidiaries of Reliance Capital include Reliance General Insurance, Reliance Nippon Life Insurance, Reliance Securities, Reliance Asset Reconstruction Company, Reliance Home Finance, and Reliance Commercial Finance. RBI-appointed Nageswara Rao Y is the administrator of Reliance Capital's insolvency process.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/maruti-suzuki-q3-preview-what-will-third-quarter-be-like-in-price-hikes-scenario\/amp-11674486951770.html","pub_date":"2023-01-23T21:55:38+05:30","title":"Maruti Suzuki Q3 preview: What will third quarter be like in price hikes scenario?\n","keywords":"Maruti Suzuki Q3,Maruti Suzuki Q3 results,Maruti Suzuki Q3 preview,Maruti Suzuki Q3 net sales,Maruti Suzuki Q3 volumes,Maruti Suzuki Q3 net profit,Maruti Suzuki Q3 revenue,Maruti Suzuki Q3 margins,Maruti Suzuki Q3 expectations,Maruti Suzuki Q3 earnings,Maruti Suzuki Q3 financial results,Maruti Suzuki shares,Maruti Suzuki share price","articles":"Management commentary on order book size, UV model launches, and the benefit of commodity deflation are some of the key factors that will be keenly watched.  One of the leading automobile manufacturers, Maruti Suzuki is likely to report a steady performance in the third quarter of FY23 which will be announced on Tuesday. Margins are expected to improve sequentially amidst price hikes scenario during the quarter. However, Maruti is likely to post a drop in net sales in Q3 of FY23 due to a de-growth in volumes. Management commentary on order book size, UV model launches, and the benefit of commodity deflation are some of the key factors that will be keenly watched. One of the leading automobile manufacturers, Maruti Suzuki is likely to report a steady performance in the third quarter of FY23 which will be announced on Tuesday. Margins are expected to improve sequentially amidst price hikes scenario during the quarter. However, Maruti is likely to post a drop in net sales in Q3 of FY23 due to a de-growth in volumes. Management commentary on order book size, UV model launches, and the benefit of commodity deflation are some of the key factors that will be keenly watched. Ahead of Q3 earnings, Maruti shares closed at  ₹8,423.15 apiece down by  ₹20.45 or 0.24% on BSE. The company's market cap is more than  ₹2.54 lakh crore. Ahead of Q3 earnings, Maruti shares closed at  ₹8,423.15 apiece down by  ₹20.45 or 0.24% on BSE. The company's market cap is more than  ₹2.54 lakh crore. In December 2022, Maruti's total sales stood at 139,347 vehicles --- declining from sales of 153,149 units in the same month last year. From April to December of FY23, the company's sales are to the tune of 1,451,237 vehicles --- higher than 1,163,823 units in 9M of FY22. In December 2022, Maruti's total sales stood at 139,347 vehicles --- declining from sales of 153,149 units in the same month last year. From April to December of FY23, the company's sales are to the tune of 1,451,237 vehicles --- higher than 1,163,823 units in 9M of FY22. In Q2FY23, the auto giant posted four folds jump in net profit to  ₹2,061.5 crore year-on-year. Also, revenue from operations jumped by 46% YoY to  ₹29,931 crore. Also, in Q2 of the current fiscal, the company recorded the highest ever quarterly sales of 5.17 lakh vehicles up by 36% YoY. In Q2FY23, the auto giant posted four folds jump in net profit to  ₹2,061.5 crore year-on-year. Also, revenue from operations jumped by 46% YoY to  ₹29,931 crore. Also, in Q2 of the current fiscal, the company recorded the highest ever quarterly sales of 5.17 lakh vehicles up by 36% YoY. What to expect from Maruti in Q3FY23?  What to expect from Maruti in Q3FY23?  Kumar Rakesh, Analyst - IT & Auto, BNP Paribas India expects Maruti's revenue to decline by c6% q-q as volume declined by c10% q-q. In his note, he added, \"EBITDA margin of 9.4% (+16bp q-q) on lower commodity prices, cost control, INR depreciation, and price hikes, and a superior mix, partially offset by negative operating leverage.\" Kumar Rakesh, Analyst - IT & Auto, BNP Paribas India expects Maruti's revenue to decline by c6% q-q as volume declined by c10% q-q. In his note, he added, \"EBITDA margin of 9.4% (+16bp q-q) on lower commodity prices, cost control, INR depreciation, and price hikes, and a superior mix, partially offset by negative operating leverage.\" Meanwhile, in their Q3 preview report, research analysts Shashank Kanodia and Raghvendra Goyal at ICICI Direct said, Maruti is expected to report a steady performance in Q3FY23. Net sales for the quarter are expected at  ₹28,281 crore, down 5.5% QoQ amid 10% QoQ de-growth in volumes at 4.7 lakh units and a 5% QoQ rise in ASPs to  ₹5.8 lakh\/unit. The product mix for Q3FY23 came in positive with a share of UVs in the total volumes mix at 24% vs. 19% in Q2FY23. Meanwhile, in their Q3 preview report, research analysts Shashank Kanodia and Raghvendra Goyal at ICICI Direct said, Maruti is expected to report a steady performance in Q3FY23. Net sales for the quarter are expected at  ₹28,281 crore, down 5.5% QoQ amid 10% QoQ de-growth in volumes at 4.7 lakh units and a 5% QoQ rise in ASPs to  ₹5.8 lakh\/unit. The product mix for Q3FY23 came in positive with a share of UVs in the total volumes mix at 24% vs. 19% in Q2FY23. Also, the duo's note added, \"EBITDA in Q3FY23 is expected at  ₹2,824 crore with EBITDA margins at 10%, up 70 bps QoQ. Consequent PAT is expected at  ₹1,940 crore versus  ₹2,062 crore in Q2FY23.\" Also, the duo's note added, \"EBITDA in Q3FY23 is expected at  ₹2,824 crore with EBITDA margins at 10%, up 70 bps QoQ. Consequent PAT is expected at  ₹1,940 crore versus  ₹2,062 crore in Q2FY23.\" In regards to management commentary, Kumar's note said, \"Current waiting period and order book size; visibility of demand and FY23 volume guidance; rural\/urban demand trends; cost-control initiatives; industry discounting trends; margin profile of product launches; UV model launches; progress on the transition to BS VI phase 2, the benefit of commodity deflation realised in the quarter; commodity outlook for the next quarter and average price hike taken during the quarter.\" In regards to management commentary, Kumar's note said, \"Current waiting period and order book size; visibility of demand and FY23 volume guidance; rural\/urban demand trends; cost-control initiatives; industry discounting trends; margin profile of product launches; UV model launches; progress on the transition to BS VI phase 2, the benefit of commodity deflation realised in the quarter; commodity outlook for the next quarter and average price hike taken during the quarter.\" The BNP analyst has set a buy recommendation on Maruti while lowering the target price of  ₹11,800 from earlier  ₹12,300. His note said, \"Target multiple near the five-year mean NTM P\/E to reflect a strong demand cycle. TP decreased as we lower target multiple as the recovery in sales volume and margin is well underway for MSIL.\" The BNP analyst has set a buy recommendation on Maruti while lowering the target price of  ₹11,800 from earlier  ₹12,300. His note said, \"Target multiple near the five-year mean NTM P\/E to reflect a strong demand cycle. TP decreased as we lower target multiple as the recovery in sales volume and margin is well underway for MSIL.\" Among key downside risks on Maruti as per Kumar will be any incremental supply constraints; the higher-than-expected impact of commodity inflation; a significant increase in the competitive pressure from peers; and the failure of new model launches. Among key downside risks on Maruti as per Kumar will be any incremental supply constraints; the higher-than-expected impact of commodity inflation; a significant increase in the competitive pressure from peers; and the failure of new model launches.     Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/juventus-hit-by-soccer-league-points-penalty-shares-slide\/amp-11674489042562.html","pub_date":"2023-01-23T21:32:11+05:30","title":"Juventus hit by Soccer League points penalty; shares slide","keywords":"Juventus,Soccer League,Juventus Football Club","articles":"The Turin-based club said an Italian court had overruled a previous decision in Juventus’s favor, resulting in a 15-point penalty in the Serie A league  Shares in Juventus Football Club SpA fell sharply Monday after the club was docked 15 points in the Italian soccer league for accounting infringements.  Shares in Juventus Football Club SpA fell sharply Monday after the club was docked 15 points in the Italian soccer league for accounting infringements.  In a statement late Friday, the Turin-based club said an Italian court had overruled a previous decision in Juventus’s favor, resulting in a 15-point penalty in the Serie A league. Sporting Director Federico Cherubini will meanwhile be banned from working in Italian soccer for 16 months and possibly for longer on the international stage.  In a statement late Friday, the Turin-based club said an Italian court had overruled a previous decision in Juventus’s favor, resulting in a 15-point penalty in the Serie A league. Sporting Director Federico Cherubini will meanwhile be banned from working in Italian soccer for 16 months and possibly for longer on the international stage.  The penalty leaves Juventus in ninth place in the league, and its qualification for the lucrative European Champions League in doubt.  At 0942GMT, shares traded 6.1% lower at EUR0.31.  The court decision relates to the accounting of player transfers and capital gains, the club said, adding that it will appeal to the Italian Sport Guarantee Board.  The news comes on the heels of the resignation of Juventus chairman and businessman Andrea Agnelli late last year, along with the rest of the club’s board, amid an accounting probe into the club by the Italian authorities.  Mr. Agnelli also stepped down last week from the boards of Agnelli-family holding company Exor NV–which controls Juventus–and auto maker Stellantis NV, in which Exor holds a minority stake.  Stellantis and Exor both face reputational risk from the Juventus affair, analyst Saima Hussain at Baader Helvea said in a research note. Mr. Agnelli will remain closely linked to Exor despite his stepping down as director, Ms. Hussain said. His departure from the Stellantis board meanwhile raises questions around the balance of power at the auto group between the Agnelli family and fellow shareholders the Peugeot family, the analyst said.  “Such issues do not look good at a time when ESG practices are increasingly important for investors and regulators,\" she noted.MINT PREMIUMSee All\n  This story has been published from a wire agency feed without modifications to the text","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/axis-bank-q3-net-jumps-62-on-interest-income\/amp-11674489262666.html","pub_date":"2023-01-23T21:24:22+05:30","title":"Axis Bank Q3 net jumps 62% on interest income","keywords":"Axis Bank,December quarter,Profit,Provisions,Axis Bank Q3 results","articles":"The bank’s net interest income rose 32% from a year earlier to  ₹11,459 crThe bank’s gross non-performing asset ratio were at 2.38% in the December quarter  Mumbai: Axis Bank on Monday reported a 62% surge in fiscal third quarter net profit as the private lender benefited from higher net interest income. Mumbai: Axis Bank on Monday reported a 62% surge in fiscal third quarter net profit as the private lender benefited from higher net interest income. Profit in the three months ended 31 December climbed to  ₹5,853 crore from  ₹3,614 crore a year earlier. The figure surpassed the  ₹5,342 consensus estimate in a Bloomberg survey of 49 analysts.  Profit in the three months ended 31 December climbed to  ₹5,853 crore from  ₹3,614 crore a year earlier. The figure surpassed the  ₹5,342 consensus estimate in a Bloomberg survey of 49 analysts.  Total provisions and contingencies stood at  ₹1,438 crore, up 7.7% from the previous year. December quarter provisions, Axis Bank said, included  ₹340 crore set aside as a one-time provision.  The bank said it has not utilized covid-19 provisions during the quarter and held cumulative provisions of  ₹5,012 crore at the end of Q3FY23.  Axis Bank’s net interest income (NII)—the difference between interest earned and interest expended—jumped 32% from a year earlier to  ₹11,459 crore and net interest margin (NIM)—a key measure of profitability—stood at 4.26%, an increase of 30 basis points (bps) sequentially.  “We are gaining market share in our focus segments. We delivered strong and balanced growth in domestic advances led by market share gains in Bharat (rural) and small and medium enterprise (SME) segments. We got better on granular and premium deposits. Our credit card business has delivered an industry-leading performance,\" Amitabh Chaudhry, chief executive, Axis Bank, told reporters.  The bank’s gross non-performing asset (NPA) ratio–-bad loans as a percentage of gross advances—stood at 2.38% in Q3FY23, falling 12 bps sequentially and 79 bps from a year earlier. Post provisions, the net NPA ratio was at 0.47% in Q3, down 4 bps sequentially and 44 bps from a year ago.  “Our customer acquisition remains strong. In Q3, we added 2.9 million new customer accounts, a growth of 34% year-on-year 3% quarter-on-quarter. During the quarter, we crossed the milestone of 3 million cards in force of Flipkart-Axis Bank credit card, making it one of the fastest growing co-branded credit cards in the country,\" Chaudhry said.  The bank’s gross slippages in Q3FY23 stood at  ₹3,807 crore, compared with  ₹3,383 crore in Q2FY23 and  ₹4,147 crore in Q3FY22. Recoveries and upgrades from bad loans during the quarter were at  ₹2,088 crore. Net slippages in NPAs (before write-offs) for the quarter was at  ₹1,719 crore as compared with  ₹557 crore in Q2FY23 and  ₹860 crore in Q3FY22.  Axis Bank’s net advances grew 15% from a year earlier and 4% sequentially to  ₹7.62 trillion as of 31 December. Total deposits grew 9% from a year ago and 2% sequentially on quarterly average balance (QAB) basis; and 10% from a year ago and 5% sequentially on period-end basis.  “We are seeing a broad-based growth in corporate loan demand. There is strong activity in segments such as renewables, roads, chemicals, urban energy distribution, commercial real estate and healthcare,\" Chaudhry said, adding that capacity expansion projects are picking up, especially in consumption-driven sectors.  Pricing of loans, he said, has also improved compared with what was seen two or three quarters ago.  On Monday, shares of Axis Bank rose 0.28% to close at  ₹933.35 on the BSE in line with a 0.53% rise in the benchmark index Sensex. .","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/zomato-scraps-10-minute-delivery\/amp-11674489182492.html","pub_date":"2023-01-23T21:23:02+05:30","title":"Zomato scraps 10-minute delivery","keywords":"zomato,zomato instant,10-minute delivery,Deepinder Goyal,Instant delivery,consumer preference","articles":"Zomato’s move to foray into Instant delivery was driven by consumer preference, founder Deepinder Goyal had said in a blogpost last March  Food aggregator Zomato has scrapped its 10-minute delivery service a year after piloting it in Bengaluru, Gurugram and in some areas of Delhi. It is rebranding the business and working on a new menu with its restaurant partners. Food aggregator Zomato has scrapped its 10-minute delivery service a year after piloting it in Bengaluru, Gurugram and in some areas of Delhi. It is rebranding the business and working on a new menu with its restaurant partners. Instant delivery has been off the ordering app since 1 January. “The instant service is not shutting down. All finishing stations remain intact, and no people are impacted by this decision,\" a company spokesperson said on Monday. Instant delivery has been off the ordering app since 1 January. “The instant service is not shutting down. All finishing stations remain intact, and no people are impacted by this decision,\" a company spokesperson said on Monday. The news was first reported by ET Prime on Monday.  To be sure, in March 2022, Zomato announced plans to roll out Instant—a 10-minute food delivery service. Orders were fulfilled via small hubs or stations operating mini assembly kitchens for popular dishes of restaurant partners, offering a limited set of food and beverage options to customers. Zomato’s move to foray into Instant delivery was driven by consumer preference, founder Deepinder Goyal had said in a blogpost last March. “The fulfilment of our quick delivery promise relies on finishing stations, located in close proximity to high-demand customer neighbourhoods. Sophisticated demand prediction algorithm and future-ready in-station robotics are employed to ensure the food is sterile, fresh and hot at the time it is picked up by a delivery partner.\" So far, it had set up only five food stations, but could not scale it, said people privy with Zomato’s plans. The move comes after a string of high-level exits at Zomato. Gunjan Patidar, the company’s co-founder and chief technology officer, resigned earlier this month. In November, co-founder Mohit Gupta quit the food-tech company. Rahul Ganjoo, the head of new initiatives, left the company in November. Siddharth Jhawar, Zomato’s vice president of global growth, resigned that month as well.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/analysts-divided-over-tariff-hikes-arpu-for-fy24\/amp-11674489057235.html","pub_date":"2023-01-23T21:20:56+05:30","title":"Analysts divided over tariff hikes, ARPU for FY24","keywords":"jio,airtel,vi,arpu,results","articles":"Airtel and Vi may announce results next month, but sector watchers don’t expect a large uptick in ARPUs  NEW DELHI :Reliance Jio may report muted growth in average revenue per user (ARPU) for FY24, despite an increase in data consumption on the back of 5G expansions, as telecom companies may not be inclined to raise tariffs during the financial year, analysts at JP Morgan said. NEW DELHI :Reliance Jio may report muted growth in average revenue per user (ARPU) for FY24, despite an increase in data consumption on the back of 5G expansions, as telecom companies may not be inclined to raise tariffs during the financial year, analysts at JP Morgan said. “Jio’s profit after tax was a miss driven by higher depreciation and flattish ARPUs. Net subscriber additions were 5.3 million on-quarter. Given our expectations of no tariff hikes in FY24, we expect muted year for Jio,\" they added. “Jio’s profit after tax was a miss driven by higher depreciation and flattish ARPUs. Net subscriber additions were 5.3 million on-quarter. Given our expectations of no tariff hikes in FY24, we expect muted year for Jio,\" they added. Jio’s net profit was at  ₹4,638 crore in the December quarter, up 3% sequentially, while earnings before interest, taxes, depreciation and amortization (Ebitda) margins were at 52.2% up by 120 basis points sequentially, due to lower spectrum usage charges. The results of India’s largest telco with 432.9 million subscribers showed ARPU was flattish at  ₹178, versus  ₹177 in the previous quarter. A section of brokerages, however, expect telcos to undertake tariff hikes in the coming quarters leading to higher profits and ARPU growth. “A slowdown in revenue growth in the absence of tariff hikes and the significant investment on 5G network rollout makes us believe that tariff hikes will happen sooner than later. We stick to the view that 4G prepaid tariff hikes will happen in mid-2023,\" said IIFL Securities analysts in a note. “Uncertainty continues to loom around the next round of tariff hikes. But, we do expect 5G and tariff hike (whenever it happens) to drive up ARPU, leading to Ebidta growth,\" said analysts at Novuma Wealth Management. Airtel and Vodafone Idea are expected to announce results next month, but sector watchers do not expect a large uptick in ARPUs or profit despite Airtel raising entry-level tariffs for some plans in Odisha and Haryana circles on a trial basis. But they do make the case for tariff increases given ongoing plans on the rolling out of pan-India 5G services, that will result in advancing capex in FY24 to a large extent. Limited ARPU growth for the second straight quarter implies that tariff hikes are needed for further increase in ARPU. Rapid roll-out of 5G will support growth in mobile and home broadband market,\" said analysts at Jeffries. They expect ARPUs to reach  ₹206 by FY25, and 10% tariff hikes each over Q4FY23, FY24 and FY25. For Airtel, ARPU may grow 2% over Q1 2022, from  ₹190 to  ₹194 while Vodafone Idea may see 2.5% rise to  ₹134 from  ₹131. Airtel’s consolidated EBITDA is expected to grow 2.6% on-quarter and 22.7% on-year to  ₹18000 crore, while VIL’s EBITDA may be flattish at  ₹4100 crore due to the benefit of premiumisation and non-mobile revenue growth. However, its net loss is seen at  ₹7300 crore. Telcos last raised tariffs in November 2021 on the pre-paid plans by 20-25%. Top executives from Airtel and Vodafone have said that tariffs needed to rise as they were the lowest in the world. Sunil Mittal, the chairman of Bharti Enterprises, the parent of Bharti Airtel, said last week that tariffs should rise to  ₹300 a month while Vodafone Idea top executives have previously said that tariffs needed to go up in order to ensure sustainability of the capital-intensive telecoms business.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/elliott-management-takes-big-stake-in-salesforce\/amp-11674488427493.html","pub_date":"2023-01-23T21:18:58+05:30","title":"Elliott Management takes big stake in Salesforce","keywords":"Salesforce,Elliott Management","articles":"Activist investor makes a multibillion-dollar investment in the business-software provider  Activist investor Elliott Management Corp. has made a multibillion-dollar investment in Salesforce Inc., according to people familiar with the matter, adding to the pressures facing the business-software provider.  Activist investor Elliott Management Corp. has made a multibillion-dollar investment in Salesforce Inc., according to people familiar with the matter, adding to the pressures facing the business-software provider.  While details of the campaign couldn’t be learned, Elliott, one of the biggest and most prolific activists, often seeks board representation and pushes for companies to make operational improvements and other changes.  While details of the campaign couldn’t be learned, Elliott, one of the biggest and most prolific activists, often seeks board representation and pushes for companies to make operational improvements and other changes.  “Salesforce is one of the pre-eminent software companies in the world, and having followed the company for nearly two decades, we have developed a deep respect for [Co-Chief Executive] Marc Benioff and what he has built,\" Jesse Cohn, managing partner at Elliott, said.  “We look forward to working constructively with Salesforce to realize the value befitting a company of its stature,\" added Mr. Cohn, who has previously served on the boards of companies including Citrix, eBay Inc. and Twitter.  It has been a turbulent stretch for Salesforce. Earlier this month, the company said it was laying off 10% of its workforce and reducing its office space in certain markets.  Mr. Benioff said many customers are taking a more cautious approach to spending, something more software companies are facing amid fears of an economic slowdown. Mr. Benioff, who also serves as chairman, said Salesforce hired too many people as revenue surged earlier in the Covid-19 pandemic, echoing other tech executives as industrywide layoffs intensify.MINT PREMIUMSee All\n  Salesforce had nearly 80,000 employees globally as of Oct. 31, up from more than 49,000 as of Jan. 31, 2020, according to company filings. Salesforce reported revenue for its fiscal third quarter ended Oct. 31 of $7.84 billion, up 14% from the prior year. That marked a sharp slowdown from 27% revenue growth in the same quarter a year earlier. The company also declined to issue guidance for its fiscal year 2024. Salesforce’s stock, a stellar performer for years, has taken a beating, down by about half from a late-2021 high and giving the company a market capitalization of roughly $150 billion. The shares rose about 2% in early trading Monday on the news. There has been upheaval, meanwhile, in Salesforce’s top ranks. Co-CEO Bret Taylor is expected to vacate his position on Jan. 31, ending the company’s second experiment in recent years with dual leadership. Mr. Taylor had shared the top role with Mr. Benioff for about a year. (Mr. Benioff is to become sole leader again and continue to serve as the company’s chairman.) Mr. Benioff, who co-founded the business in 1999, became frustrated about how Mr. Taylor was spending his time, The Wall Street Journal previously reported. Stewart Butterfield, the chief executive and co-founder of Slack Technologies, the workplace-messaging app Salesforce acquired during the pandemic, announced his departure last month. PHOTOS: From Twitter to Meta: Tech Layoffs by the Numbers The company had been an active acquirer in recent years. Last year, Salesforce completed the deal for Slack, for more than $27 billion. Two years prior, it spent around $15 billion for data-analytics platform Tableau Software Inc. A year before that, the company shelled out more cash and stock in a $6 billion-plus deal for MuleSoft. This isn’t the first time lately that Salesforce has drawn activist interest. In October, Starboard Value LP revealed it had taken a stake in Salesforce, arguing that the company’s mix of growth and profitability is far below that of its peers. Starboard founder Jeff Smith‘s ambition for change at the company has appeared more modest, with the firm so far stopping short of calling for specific measures. Elliott is known for taking on tech companies and others and forcing changes that also include sales and executive shake-ups. Its targets have included PayPal Holdings Inc., AT&T Inc., Dell Technologies Inc. and Twitter. Late last year, it struck an agreement with Pinterest Inc. to add Marc Steinberg, a senior Elliott portfolio manager, to the social-media company’s board. With more than $55 billion in assets under management as of June, Elliott also has a private-equity arm that sometimes bids on companies that are targets of its activist campaigns. This story has been published from a wire agency feed without modifications to the text","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/govt-should-raise-maximum-loan-amount-for-coverage-under-msme-credit-guarantee-scheme-sbi-research\/amp-11674487319451.html","pub_date":"2023-01-23T20:58:14+05:30","title":"Govt should raise maximum loan amount for coverage under MSME credit guarantee scheme: SBI Research","keywords":"MSME credit,SBI Research,ECLG scheme","articles":"SBI Research recommended that guarantee coverage for the units having women promoters should be increased to 100% to give fillip to women entrepreneurship  NEW DELHI :Around a week ahead of the union budget, a report by SBI Research has suggested that there is an urgent need to revamp the credit guarantee scheme for MSMEs. NEW DELHI :Around a week ahead of the union budget, a report by SBI Research has suggested that there is an urgent need to revamp the credit guarantee scheme for MSMEs. The report released on Monday suggested that government should raise the maximum loan amount for coverage under Credit Guarantee Fund Trust for Micro and Small Enterprises (CGTMSE) to  ₹5 crore for all activities under manufacturing, services and trade sector from the current limit of  ₹2 crore. The report released on Monday suggested that government should raise the maximum loan amount for coverage under Credit Guarantee Fund Trust for Micro and Small Enterprises (CGTMSE) to  ₹5 crore for all activities under manufacturing, services and trade sector from the current limit of  ₹2 crore. “There is an urgent need to revamp the Credit Guarantee Scheme for the MSME sector. The U.S. Small Business Administration (US-SBA) could be the template for evolving CGTMSE as a friend-philosopher-guide-mentor for MSMEs proliferation, credit linkage, scaling and integration into the value chain,\" it said. It also recommended that guarantee coverage for the units having women promoters should be increased to 100% to give fillip to women entrepreneurship. The SBI Research report said that in the post-Covid period, credit growth to MSMEs in the industrial sector was distinctly higher on both, year-on-year (YoY) basis as well as in comparison with credit growth to large industries.  “Incentives provided by the Emergency Credit Line Guarantee Scheme (ECLGS), coupled with lower GNPA ratios have helped in boosting credit to MSMEs. Additionally, beginning FY22, there is evidence of MSME units getting bigger with several units crossing the threshold of  ₹250 crores turnover and turning mid sized corporates by the new definition of MSME units,\" it said. Observing that SME units are becoming larger with the rise in economic activity, the report said that it will increase the ability of MSME units to raise capital through debt markets.  Further, only 410 companies currently have till date listed on the BSE SME platform but nearly 40% of them have moved up to mainstream platform, indicating capital market listing helps in gaining further scale much quickly. On the progress made by the Emergency Credit Line Guarantee Scheme (ECLGS) launched amid the first wave of the pandemic in 2020, the report said at least 14.6 lakh MSMEs accounts were saved due to the scheme. “In absolute terms, MSME loan accounts worth  ₹2.2 lakh crore improved since inception of ECLGS for entire banking industry. This means that around 12% of the outstanding MSME credit has been saved from slipping into NPA because of the ECLG scheme,\" it said. Of 14.6 lakh MSMEs accounts that are saved due to ECLG scheme, almost 93.8% were in micro and small category. As per analysis of SBI Research, if such units slipped into NPA, then 1.65 crore workers would have become unemployed.  “Thus, the ECLG scheme has saved the livelihood for 6.6 crores,\" it said.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/zomato-to-rebrand-its-10-minute-delivery-service-instant\/amp-11674485808842.html","pub_date":"2023-01-23T20:30:16+05:30","title":"Zomato to rebrand its 10-minute delivery service Instant","keywords":"zomato,zomato instant","articles":"The service has been disabled the option of the service  Food aggregator Zomato Ltd on Monday said that the company is looking to rebrand its 10-minutes delivery service, Zomato Instant. Food aggregator Zomato Ltd on Monday said that the company is looking to rebrand its 10-minutes delivery service, Zomato Instant. Zomato said that the firm is working on a new menu and all its finishing stations will remain intact. The firm said that no people or employees will be impacted by this decision. Zomato said that the firm is working on a new menu and all its finishing stations will remain intact. The firm said that no people or employees will be impacted by this decision. \"Instant is not shutting down. We are working on a new menu with our partners and rebranding the business. All finishing stations remain intact, and no people are impacted by this decision,\" said Zomato's spokesperson. \"Instant is not shutting down. We are working on a new menu with our partners and rebranding the business. All finishing stations remain intact, and no people are impacted by this decision,\" said Zomato's spokesperson. Zomato Instant, the 10-minute food delivery was launched in March 2022. \"Nobody in the world has so far delivered hot and fresh food in under 10 minutes at scale, and we were eager to be the first to create this category, globally,\" wrote CEO Deepinder Goyal at the time of launch. Zomato Instant, the 10-minute food delivery was launched in March 2022. \"Nobody in the world has so far delivered hot and fresh food in under 10 minutes at scale, and we were eager to be the first to create this category, globally,\" wrote CEO Deepinder Goyal at the time of launch. The service was offered through Zomato's 'finishing station' which had 20-30 best selling dishes based on demand and local preferences. The service was launched in National Capital Region and Bengaluru. The service was offered through Zomato's 'finishing station' which had 20-30 best selling dishes based on demand and local preferences. The service was launched in National Capital Region and Bengaluru. Zomato has disabled the option of the service. Zomato has disabled the option of the service. This comes at a time when co-founder and chief technology office Gunjan Patidar has quit the company after more than ten years in the company on January 2, 2023. It was another big exit from the company after Zomato co-founder Mohit Gupta has quit the company after four and half year stint in November last year. This comes at a time when co-founder and chief technology office Gunjan Patidar has quit the company after more than ten years in the company on January 2, 2023. It was another big exit from the company after Zomato co-founder Mohit Gupta has quit the company after four and half year stint in November last year. Recently, the food aggregator had laid off under 3 per cent of its staff across the organisation. The company said that the laying offs are based on regular performance. Recently, the food aggregator had laid off under 3 per cent of its staff across the organisation. The company said that the laying offs are based on regular performance. Zomato’s net loss for the September quarter narrowed to  ₹250.8 crore compared to  ₹434.9 in the corresponding quarter last fiscal. Meanwhile, revenue from operations rose by 62.20 per cent to  ₹1,661.3 crore. Zomato’s net loss for the September quarter narrowed to  ₹250.8 crore compared to  ₹434.9 in the corresponding quarter last fiscal. Meanwhile, revenue from operations rose by 62.20 per cent to  ₹1,661.3 crore. The company's food delivery business September quarter sales have grown only 22 per cent to  ₹6,631 crore from  ₹5,410 crore in corresponding quarter last fiscal. The company's food delivery business September quarter sales have grown only 22 per cent to  ₹6,631 crore from  ₹5,410 crore in corresponding quarter last fiscal.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/microsoft-adds-10-billion-to-investment-in-chatgpt-maker-openai\/amp-11674485677175.html","pub_date":"2023-01-23T20:28:20+05:30","title":"Microsoft adds $10 billion to investment in ChatGPT maker OpenAI","keywords":"Microsoft,OpenAI,ChatGPT,DALL-E,Alphabet,Google,investments in ChatGPT","articles":"Microsoft, which plowed $1 billion into OpenAI in 2019, is seeking an inside edge on some of the most popular and advanced artificial intelligence systems  Microsoft Corp. is making a $10 billion investment over several years in OpenAI, the pioneering artificial intelligence research lab behind ChatGPT and DALL-E. Microsoft Corp. is making a $10 billion investment over several years in OpenAI, the pioneering artificial intelligence research lab behind ChatGPT and DALL-E. The news comes less than a week after the company said it’s laying off 10,000 workers as a weakening economy crimps software demand. Microsoft noted in that announcement that it will still invest and hire in key priority areas. The software maker reports fiscal second-quarter earnings on Tuesday. While Microsoft didn’t disclose the value of its investment on Monday, a person familiar with the discussions said it totals $10 billion over multiple years. The news comes less than a week after the company said it’s laying off 10,000 workers as a weakening economy crimps software demand. Microsoft noted in that announcement that it will still invest and hire in key priority areas. The software maker reports fiscal second-quarter earnings on Tuesday. While Microsoft didn’t disclose the value of its investment on Monday, a person familiar with the discussions said it totals $10 billion over multiple years. The investment from Microsoft “will allow us to continue our independent research and develop AI that is increasingly safe, useful, and powerful,\" OpenAI said in a statement. Microsoft, which plowed $1 billion into OpenAI in 2019, is seeking an inside edge on some of the most popular and advanced artificial intelligence systems as it competes with Alphabet Inc., Amazon.com Inc. and Meta Platforms Inc. to dominate the fast-growing industry. OpenAI needs Microsoft’s funding and cloud-computing power to crunch massive volumes of data and run the increasingly complex models that allow DALL-E to generate realistic images based on a handful of words, and ChatGPT to create astonishingly human-like conversational text in response to prompts or queries.  ChatGPT has lit up the internet since its introduction in late November, gathering a million users in less than a week. Its ability to imitate the way real people talk and write has sparked concern about its potential to supplant professional writers and do students’ homework for them. The tool has also been called a potential threat to Google’s core search business.   This story has been published from a wire agency feed without modifications to the text.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/bharat-biotech-recalls-several-vials-of-rabies-vaccines-due-to-theft\/amp-11674484619707.html","pub_date":"2023-01-23T20:15:24+05:30","title":"Bharat Biotech recalls several vials of rabies vaccines due to theft","keywords":"Bharat Biotech,rabies vaccines,ChiroRabâ Vaccine,Healthcare","articles":"This action was initiated due to the theft of Chirorabâ from the shipping services provider in Karnataka  NEW DELHI :Pharma major Bharat Biotech on Monday announced voluntary product Recall ChiroRabâ Vaccine---a rabies vaccines with specific batch number due to theft of its multiple vials.  NEW DELHI :Pharma major Bharat Biotech on Monday announced voluntary product Recall ChiroRabâ Vaccine---a rabies vaccines with specific batch number due to theft of its multiple vials.  “We have issued a voluntary product recall of a specific batch of Chirorabâ with batch number 4188. This action was initiated due to the theft of Chirorabâ from the shipping services provider in Karnataka. In accordance with company and regulatory requirements, batch --4188 was fully tested and released,\" said Bharat Biotech in a statement.  “We have issued a voluntary product recall of a specific batch of Chirorabâ with batch number 4188. This action was initiated due to the theft of Chirorabâ from the shipping services provider in Karnataka. In accordance with company and regulatory requirements, batch --4188 was fully tested and released,\" said Bharat Biotech in a statement.  While only part of the shipment was stolen, for which cold chain storage conditions are unknown, the action to recall the entire batch has been initiated, the company said.   Meanwhile, the company has requested that batch 4188 not be sold and returned to the company. “Healthcare providers are requested not to administer Chirorabâ with batch #4188. We are undertaking this voluntary action in accordance with the Principle of Abundant Precaution, keeping patient safety and the public interest in mind,\" said the company.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/start-ups\/globevestor-co-founder-launches-micro-vc-firm-with-presence-in-us-india-and-canada\/amp-11674483943423.html","pub_date":"2023-01-23T20:00:36+05:30","title":"Globevestor co-founder launches micro-VC firm with presence in US, India and Canada","keywords":"SME,MSME,Globevestor,Momentum Capital,Indian startups,Ankur,global micro-VC firm","articles":"Momentum Capital focuses on seed-stage Indian startups and leverages its strong international network to help them grow globally  NEW DELHI :Globevestor founder recently announced the launch of a new global micro-VC firm called Momentum Capital. With a presence in Canada, India and the US, Momentum Capital focuses on seed-stage Indian startups and leverages its strong international network to help them grow globally. NEW DELHI :Globevestor founder recently announced the launch of a new global micro-VC firm called Momentum Capital. With a presence in Canada, India and the US, Momentum Capital focuses on seed-stage Indian startups and leverages its strong international network to help them grow globally. Ankur, who co-founded Globevestor in 2013, has invested in over 40 startups including Agnikul, Springboard, Zoomcar, Devtron, Good Health Company, Flintobox and many more success stories. His past investments are spread across several industries, including SaaS, climate, health, and EdTech. His prior portfolio startups have raised over USD 500 million in funding from Sequoia, Accel, Y Combinator, Khosla Ventures, Menlo Ventures, Insight Partners, Foundation Capital, etc. and are collectively valued at over USD 1.5 billion now. Ankur, who co-founded Globevestor in 2013, has invested in over 40 startups including Agnikul, Springboard, Zoomcar, Devtron, Good Health Company, Flintobox and many more success stories. His past investments are spread across several industries, including SaaS, climate, health, and EdTech. His prior portfolio startups have raised over USD 500 million in funding from Sequoia, Accel, Y Combinator, Khosla Ventures, Menlo Ventures, Insight Partners, Foundation Capital, etc. and are collectively valued at over USD 1.5 billion now. \"At Globevestor, we successfully pioneered a focused cross-border, hybrid-VC approach to investing across the US-India corridor to support Indian startup founders. Momentum Capital is an organic jump in the journey to deeply leverage our global network & cross-border presence for the benefit of Indian startup founders,\" Ankur Shrivastava (Founder & Managing Partner, Momentum Capital) shared. Momentum Capital has a cross-border team & deep network in Canada, India & the US, and it actively helps founders scale across the globe. Its strong and impressive advisory and partner network include Bill Draper (Founder, Sutter Hill Ventures), Adam Draper (Founder, Boost VC), Adeo Ressi (Chairman, Founder Institute), Mike Suprovici (Head of Acceleration, VC Lab), Abhilash Singh (Founding Partner, Auctus Advisors), and several global CXOs from leading VC\/PE firms, tech giants, blitzscaling startups and top consulting firms. \"We've consciously chosen a strong set of advisors, investors, and venture partners across continents and verticals, to supercharge access to global capital and knowledge for Indian founders at the seed stage itself. I've shifted base to North America recently to double down on this further,\" Ankur added. The firm has finalized a couple of stealth investments already, and while being largely sector-agnostic, it will have affinity for technology startups in climate, health and SaaS as key themes. India has seen a few globally competitive startups being built at home already in recent years, but the firm believes that the next decade will belong to a drove of global tech leaders born in India. \"Despite the ongoing funding winter, it remains a great time to build for Indian entrepreneurs. We aim to work with passionate founders building for India and the world with more financial discipline. We are here to support them in their quest to win anywhere in the world,\" Ankur signed off. Momentum Capital is a global micro-VC firm with a presence in Canada, US & India, and invests in Indian technology startups at the pre-seed and seed stage across sectors, with affinity for climate, SaaS, and health. With a strong set of advisors, investors, and partners who have deep investing experience spread across continents & verticals, the firm supercharges global network leverage for Indian founders at the earliest stages.  ","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/adb-to-provide-131-mn-for-maharashtra-s-jln-port-upgradation-boost-trade\/amp-11674483762316.html","pub_date":"2023-01-23T19:59:20+05:30","title":"ADB to provide $131 mn for Maharashtra’s JLN Port upgradation, boost trade","keywords":"ADB,JLN Port,trade,Nhava Sheva Freeport,Jawaharlal Nehru Port,JM Baxi Ports,CMA Terminals","articles":"The financing package comprises $61.4 million from ADB’s ordinary capital resources and $69.6 million from Leading Asia’s Private Infrastructure Fund administered by ADB  NEW DELHI :The Asian Development Bank (ADB) and Nhava Sheva Freeport Terminal Private Limited (NSFTPL) have signed a USD 131 million (about  ₹1,066 crore) loan agreement to upgrade the Jawaharlal Nehru Port Container Terminal, Navi Mumbai, to enhance international trade in India through efficient, transparent, and state-of-the-art logistics infrastructure.  NEW DELHI :The Asian Development Bank (ADB) and Nhava Sheva Freeport Terminal Private Limited (NSFTPL) have signed a USD 131 million (about  ₹1,066 crore) loan agreement to upgrade the Jawaharlal Nehru Port Container Terminal, Navi Mumbai, to enhance international trade in India through efficient, transparent, and state-of-the-art logistics infrastructure.  NSFTPL is a special purpose vehicle jointly owned by J M Baxi Ports and Logistics Limited (JMBPL) and CMA Terminals. NSFTPL is a special purpose vehicle jointly owned by J M Baxi Ports and Logistics Limited (JMBPL) and CMA Terminals. The financing package comprises $61.4 million from ADB’s ordinary capital resources and $69.6 million from Leading Asia’s Private Infrastructure Fund (LEAP) administered by ADB, the Manila-based multilateral lending agency said in a statement. The funds will be used to upgrade existing berths and yards and install additional energy efficient equipment such as electric quay cranes. These upgrades will expand the terminal’s container handling capacity and attract vessels operating on important international shipping lanes. “Global trade and supply chains are vulnerable to shocks, and enhancing countries’ capacity for trade is critical to the region’s recovery from COVID-19 and its ongoing prosperity,\" said ADB Vice-President for Private Sector Operations and Public–Private Partnerships Ashok Lavasa. “Long-term financial support from ADB can boost economic competitiveness in India by developing world-class mega ports and boosting the efficiency of containerized cargo terminal operations.\"  “We are absolutely delighted to sign the Financing Agreement with ADB, which is the largest loan agreement signed by us so far, and we appreciate ADB’s commitment and agility in bringing this deal to a smooth closure in record time,\" said NSFTPL Board member and JMBPL Managing Director Dhruv Kotak.  “Nhava Sheva Freeport Terminal is a key terminal for the country and this deal underscores India’s potential in becoming a $10 trillion economy by 2035. We are proud to have ADB support us in our endeavor to make international trade seamless, and this partnership is a testimony of our shared value system of the highest level of governance, transparency, and compliance\" he added.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/start-ups\/sequoia-mulls-auditing-south-asia-investments-after-alleged-lapses-in-zilingo-gomechanic\/amp-11674483302220.html","pub_date":"2023-01-23T19:55:17+05:30","title":"Sequoia weighs audit of  investments  in  Asia","keywords":"Sequoia Capital,South Asia investments,financial irregularities,Zilingo,GoMechanic,SME,MSME","articles":"Sequoia Capital India will also be more selective when taking board seats at companies and, in some cases, might replace junior members from their team on boards with more senior partners, people familiar with the decision said  Sequoia mulls auditing South Asia investments after allegat lapses in Zilingo, GoMechanic  Sequoia mulls auditing South Asia investments after allegat lapses in Zilingo, GoMechanic  Sequoia Capital’s regional arm in South and Southeast Asia is weighing special audits of several investments in the region following allegations of financial irregularities at firms such as Zilingo Pte and GoMechanic. Sequoia Capital’s regional arm in South and Southeast Asia is weighing special audits of several investments in the region following allegations of financial irregularities at firms such as Zilingo Pte and GoMechanic. The venture capital firm will work with Ernst & Young on some of these audits and will increase budget allocations to help investee companies put governance guardrails in place, according to people familiar with the decision who asked not to be named discussing private information. Sequoia Capital India will also be more selective when taking board seats at companies and, in some cases, might replace junior members from their team on boards with more senior partners, the people said.  That’s a departure from previous practice where Sequoia limited due diligence to companies before investing, the people added. “As a matter of practice, Sequoia Capital India & Southeast Asia conducts due diligence ahead of new, first-time investments. We may conduct diligence ahead of a follow-on round; at this juncture, we have not put a mandate for special audits,\" a Mumbai-based spokesperson for the company said in an emailed statement. Sequoia Capital India & Southeast Asia is the regional arm of the Silicon Valley fund that backed Apple Inc. and Google. In the latest headache for Sequoia Capital India, a due diligence run by EY on its portfolio company GoMechanic for other prospective investors had unearthed bookkeeping improprieties, missteps the startup’s co-founder accepted in a public statement last week. The prospective investor group that hired EY pulled out of talks to fund GoMechanic and informed Sequoia about the lapses, Bloomberg News reported last week.  Sequoia, which has been backing GoMechanic since 2019 and is its largest shareholder with a 27% stake, according to Tracxn, was not aware of the bookkeeping problems, it said in a joint emailed statement with other investors. The India and Southeast Asia team had stalled announcing the raising of $2.85 billion across three funds by almost a month, last year, after alleged irregularities at some of its portfolio firms, the people said.  Since starting in India more than 16 years back, Sequoia Capital India has broadened its geographical reach to Southeast Asia and invested in more than 400 startups. BharatPe and Trell are among other companies backed by them that have faced allegations of flouting rules.  ","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/bharat-bhasker-to-be-new-director-at-iim-ahmedabad\/amp-11674481048786.html","pub_date":"2023-01-23T19:16:09+05:30","title":"Bharat Bhasker to be new director at IIM Ahmedabad","keywords":"Bharat Bhasker,IIM Ahmedabad,Arindam Banerjee,IIM Lucknow","articles":"Bhasker currently holds the position of professor of Information Technology and Systems at IIM Lucknow  NEW DELHI :Indian Institute of Management Ahmedabad (IIMA) on Monday announced the appointment of professor Bharat Bhasker as the director of IIMA for a period of five years with effect from March 1, 2023. NEW DELHI :Indian Institute of Management Ahmedabad (IIMA) on Monday announced the appointment of professor Bharat Bhasker as the director of IIMA for a period of five years with effect from March 1, 2023. Bhasker currently holds the position of professor of Information Technology and Systems at Indian Institute of Management (IIM) Lucknow. In the interim, the Board of Governors has appointed Arindam Banerjee as the director-in-charge for the period February 1 to 28, 2023. Bhasker currently holds the position of professor of Information Technology and Systems at Indian Institute of Management (IIM) Lucknow. In the interim, the Board of Governors has appointed Arindam Banerjee as the director-in-charge for the period February 1 to 28, 2023. “I would like to congratulate and welcome Professor Bharat Bhasker as the new Director of IIMA. As a successful leader and a Professor of technology with experience of working in India and across the globe, I am confident that he will carry forward the legacy and lead the institute to newer horizons in today’s digital, globalised world,\" said Pankaj R Patel, Chairperson, IIMA Board of Governors. The IIMA Board of Governors set a committee for the selection of IIM Ahmedabad director. The committee had shortlisted 13 candidates for the position. All the IIMA faculty members who had applied for the position were interviewed, along with the external applicants. “\"The selection committee had a detailed consultation with IIMA faculty members and other relevant stakeholders and conducted the final round of interviews. Based on the search and selection committee’s recommendations, the Board of Governors announced the appointment of Bharat Bhasker as the next Director for the institute, during a meeting held today at the IIMA campus,\" said a press release. Bhasker is an experienced Information Technology leader with almost three decades of experience in industry, research, teaching, and consulting in India and globally. Until recently, he has served a five-year term as the Director of IIM Raipur from March 2017 to March 2022.  Before joining IIM Raipur, he has been associated with IIM Lucknow for over two decades having served in various capacities including being the acting Director of IIM Lucknow for a period of five months during July and November 2015. He has also served as the Dean Planning & Development at IIM Sirmaur from 2003 to 2005. He has been a visiting professor at ESSEC Business School, Paris, France and University of Texas, Dallas, US. “He was a Distinguished Professor at Chung- Ang University, Seoul, Korea, was a Research Professor at University of California, Riverside, USA and Adjunct Faculty at Information Systems, Univ. of Maryland, College Park,\" it added.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/hotels-embrace-blue-collar-workers-to-prop-up-sagging-business-travel\/amp-11674479398119.html","pub_date":"2023-01-23T18:49:05+05:30","title":"Hotels embrace blue-collar workers to prop up sagging business travel","keywords":"Hotels,blue-collar workers,business travel,Small and medium-size businesses,Covid-19 pandemic restrictions,corporate travel","articles":"Small and medium-size businesses are driving the recovery of business travel across the US  Hotels Embrace Blue-Collar Workers to Prop Up Sagging Business Travel  Hotels Embrace Blue-Collar Workers to Prop Up Sagging Business Travel  BY WILL FEUER | UPDATED JAN 23, 2023 08:00 AM EST  BY WILL FEUER | UPDATED JAN 23, 2023 08:00 AM EST  Small and medium-size businesses are driving the recovery of business travel across the U.S.  Hotel owners are lamenting a drop-off in corporate travel during the pandemic as finance, tech and other professionals spend less time on the road. But hoteliers are cheering the boom in travel by blue-collar workers.  Construction crews, travel nurses, truckers and sales teams from small and medium-size businesses have packed hotels for much of the past three years.  Leisure travel has been thriving since Covid-19 pandemic restrictions eased. Pent-up demand exploded over the past two years and lifted resort rates to a record-high average daily rate of $275.58 in 2022, according to hotel data-and-analytics firm STR. Business travel, however, continues to lag behind activity seen in 2019, initially because of infection concerns and more recently amid layoffs and a looming recession.  But the gap is closing. In the third quarter this past year, business travel reached 71% of prepandemic levels, according to data from American Express Global Business Travel. That is up from 35% during the same quarter in 2021.  Small and medium-size businesses are driving the recovery. Transactions by this segment reached 80% of prepandemic levels in the third quarter, according to Amex GBT. Travel by global and multinational firms, by contrast, is back to only 61% of prepandemic levels.  “There’s a pretty healthy gap,\" said Evan Konwiser, chief marketing and strategy officer for Amex GBT. “That’s been pretty consistent really since the early days of the recovery.\"MINT PREMIUMSee All\n  Individual business travel and small internal meetings by companies bringing remote workers together represent the fastest-growing forms of business travel coming out of the pandemic, according to Amex GBT. Hotels are upgrading their food and beverage offerings and adding or expanding on-premise workspaces as they compete to host these small meetings, Mr. Konwiser said. Travel from blue-collar crews and small businesses has especially boosted demand for hotels in smaller cities across the U.S., lodging executives said. Those kinds of guests can range from sales teams looking to get face time with regional customers to specialized construction crews getting put up near a job site that would otherwise be too far to commute to each day. Those travelers tend to favor extended-stay hotels that cater to those visiting for at least a week and other hotels that offer lower- and mid-priced rates. An influx of federal spending, including the $1 trillion infrastructure bill signed into law in 2021, and this past year’s $280 billion funding allocation by Congress for U.S. semiconductor production will help boost workforce business travel for years. “This surge is real,\" said Choice Hotels International Inc.’s Chief Executive Pat Pacious. “Middle class, small business, construction, logistics—those industry verticals—that’s going to continue to expand.\" Choice Hotels’ sales team that focuses on securing workforce travel contracts has seen a 52% jump in the number of accounts it is servicing since 2019, Mr. Pacious said. About two-thirds of Hilton Worldwide Holdings Inc.’s business guests drove to their hotels rather than flying in the past year, Chief Executive Chris Nassetta said. That marks a reversal from prepandemic travel patterns and is a sign that bigger companies were slower to resume travel while small and medium-size businesses are hitting the road more often. Hoteliers are looking to retain and boost bookings by these guests through a variety of measures that appeal more to blue-collar workers, executives for several major hotel chains said. Ryan Bushby, 41 years old, noticed these sorts of changes at the Best Western in Milpitas, Calif., where he has been staying most weeknights while working at a construction site in the Bay Area. The hotel bar, previously stocked with IPAs and craft beers, now serves Coors Light on tap. The kitchen has changed its hours to accommodate guests who work the night shift. “From the way this hotel really puts everything together, you can tell, they honestly cater to us, skilled labor or craft-type people,\" said Mr. Bushby, from Ukiah, Calif., who stays at the hotel during the week while working for Granite Construction Inc. BWH Hotel Group, parent company of Best Western, is focused on expanding its major workforce travel accounts and retaining the bump in demand it got from traveling medical personnel during the pandemic, Chief Executive Larry Cuculic said. About 10 years ago, BWH established a sales team dedicated to strengthening relationships with companies that often need worker housing, from utility providers to railroad companies and trucking firms, Mr. Cuculic said. When there is a natural disaster or emergency, BWH’s sales team gets in touch with companies that might be responding by sending workers, he said. Spending from three major accounts in the company’s workforce-travel segment grew 15% the past year from 2021, he said. Choice Hotels started buying and building brands that cater to skilled workers five years ago. In 2018, the company acquired the WoodSpring Suites brand, a move that Mr. Pacious said was in response to growing demand for midscale business travel. The company also signed a 21-hotel development deal this past year to expand its Everhome Suites brand, which was launched in 2020 to cater to the midscale business traveler, he said.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/icici-bank-to-offer-financing-solutions-to-tata-motors-electric-vehicles-dealers\/amp-11674477581268.html","pub_date":"2023-01-23T18:39:43+05:30","title":"ICICI Bank to offer financing solutions to Tata Motors electric vehicles dealers","keywords":"tata motors electric vehicle deals,icici bank tata motors electric vehicles dealers financing solutions,tata motors icici bank partnership,icici bank,tata motors,tata motors electric vehicles,tata motors icici bank EV dealers financing,tata motors icici bank deal","articles":"Tata Motors has been pioneering the Indian automotive market with its ground-breaking efforts and is currently leading the e-mobility wave in India with a commanding market share of 85.8%  Auto giant Tata Motors partnered with leading private lender ICICI Bank on Monday to encourage the adoption of electric vehicles in the country. Under the tie-up, ICICI Bank will provide inventory funding to EV dealers of Tata Motors. This would be one of its kind inventory financing programme for dealers of Tata Motors Auto giant Tata Motors partnered with leading private lender ICICI Bank on Monday to encourage the adoption of electric vehicles in the country. Under the tie-up, ICICI Bank will provide inventory funding to EV dealers of Tata Motors. This would be one of its kind inventory financing programme for dealers of Tata Motors This new financing solution is in addition to the bank's funding to dealers for diesel and petrol models. This new financing solution is in addition to the bank's funding to dealers for diesel and petrol models. The EV dealers can avail of flexible repayment tenures under this facility. Shailesh Chandra, Managing Director, of Tata Motors Passenger Vehicles Ltd., and Tata Passenger Electric Mobility said, \"As the pioneers of EVs in the country, we take responsibility for their successful adoption. In our aim towards achieving complete electrification and promoting green mobility, we are happy to partner with ICICI Bank to assist our authorized passenger electric vehicle dealer partners with an exclusive financing program.\" Chandra added, \"Our dealer network forms a part of our core support pillars, and through their constant effort, we ride the electrification wave in India. We are confident that through this tie-up, we will make EVs more accessible and the EV purchase process a seamless and memorable experience for our customers.\" Further, Rakesh Jha, Executive Director, of ICICI Bank believes the electric vehicle industry is growing at a rapid pace with the rising consumer demand for environment-friendly electric vehicles. He added, \"ICICI Bank has a legacy of supporting innovative technological initiatives. In line with this philosophy, we are delighted to partner with Tata Motors to offer an electric vehicle financing programme for the authorised dealers of the country’s leading automotive company.\" The latest partnership with Tata Motors reflects ICICI Bank's continued participation in India’s journey toward a sustainable future. Tata Motors has been pioneering the Indian automotive market with its ground-breaking efforts and is currently leading the e-mobility wave in India with a commanding market share of 85.8%, with over 57,000 EVs produced to date in personal and fleet segments. Earlier in January, Tata Motors acquired Ford India's Sanand manufacturing plant, and vehicle manufacturing plant along with machinery and equipment for  ₹725.7 crore.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/cleartrip-aims-to-expand-hotel-biz-in-2023\/amp-11674477558315.html","pub_date":"2023-01-23T18:09:17+05:30","title":"Cleartrip aims to expand hotel biz in 2023","keywords":"travel,hospitality,cleatrip,ficci,tofler,katrina kaif,vicky kaushal","articles":"Cleartrip also plans to add alternative accommodations such as guest houses and villas to its portfolio  Hotels will be the single biggest focus area for Flipkart-owned travel portal Cleartrip following the relaunch of the vertical about seven months ago, with aims to expand its partner hotel network from 20,000 to 80,000 this year, across two- to five-star categories. Hotels will be the single biggest focus area for Flipkart-owned travel portal Cleartrip following the relaunch of the vertical about seven months ago, with aims to expand its partner hotel network from 20,000 to 80,000 this year, across two- to five-star categories. In 2023, Cleartrip intends to add 60,000 more hotels to its listings, chief executive officer Ayyappan R. said in an interview. “In three years, we want hotels to be our number one business and not air. Even during the best of times, hotel had only 60-65% occupancy in the country, and is a very perishable inventory. We need to have a solution for it. In the online travel aggregator (OTA) space, even the largest player has air as its biggest business vertical. For us, we are very clear, it will commercially be a very important segment as it will not just be about taking the share away from other OTAs, but building ourselves a new segment.\" In 2023, Cleartrip intends to add 60,000 more hotels to its listings, chief executive officer Ayyappan R. said in an interview. “In three years, we want hotels to be our number one business and not air. Even during the best of times, hotel had only 60-65% occupancy in the country, and is a very perishable inventory. We need to have a solution for it. In the online travel aggregator (OTA) space, even the largest player has air as its biggest business vertical. For us, we are very clear, it will commercially be a very important segment as it will not just be about taking the share away from other OTAs, but building ourselves a new segment.\" About 50% of airline transactions happen online, while it is just 20% for hotels, he said. Cleartrip will also add alternative accommodations such as guest houses and villas to its portfolio, a category adopted by its rivals MakeMyTrip, Saffron Stays and Stay Vista for a while now. With this category it intends to target millennials and the youth who may not be spending much on travel, but looking to book longer holidays, he added. The behaviour of Indian travellers has changed post-covid and as the hybrid work culture continues for many companies, the average holiday length has gone up from two-night stays to three-four nights, he said. Travellers are also exploring leisure packages beyond destinations such as Goa and Coorg, to, say, the North East or Jodhpur in Rajasthan. “People also want a shorter booking window with many travellers choosing to book closer to the travel dates, instead of planning in advance like they did pre-pandemic. For flying, a high proportion of travellers would typically take a 30-day booking window, but now it’s happening within 2-3 weeks.\" In India, ticket prices have seen a slight correction for the first time in about a year by 10% due to a reduction in crude oil and ATF prices, which was passed onto the consumers, especially for metro routes, he added. However, from pre-covid levels, airfares have increased by at least 30% on most sectors, and will continue to remain high. “Since demand is still very high with over 390,000 daily passengers on around 2,800 domestic flights and airlines running at 90% capacity, they see no reason to drop their tariffs,\" Ayyappan said. The market has seen 10-15% lower bookings in December and that has prompted many companies to offer a sale in the early weeks of January. Cleartirp has pushed the paddle on marketing efforts in the last calendar year. It roped in actors Katrina Kaif and Vicky Kaushal for about a month for its TV and digital campaign, which the company is considering reviving. In FY21, the online travel company, which has offices in Mumbai and Dubai, reported declining revenue with its net loss widening to  ₹358.61 crore, from  ₹18.23 crore in the previous fiscal. As per the registrar of companies filings of the company, accessed via the business intelligence platform Tofler, its revenue from operations declined marginally to  ₹54.74 crore in the fiscal, from  ₹58.47 crore. One of the major expense buckets for the firm was advertising and marketing costs, which also grew twenty times. India has a large travel market, which is projected to reach $125 billion by FY’27 from an estimated $75 billion in FY20, according to a report by industry body FICCI.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/amazon-development-centre-leases-office-space-in-pune-it-sez\/amp-11674474076817.html","pub_date":"2023-01-23T18:05:57+05:30","title":"Amazon Development Centre leases office space in Pune IT SEZ","keywords":"Amazon Development Centre,KRC Infrastructure,K Raheja Corp","articles":"Amazon has taken four floors on lease along with 205 carparks, across roughly 1.94 lakh sq ft, in a building in the project Gera Commerzone, an IT special economic zone  Bengaluru: Amazon Development Centre India Pvt Ltd has taken up commercial office space on lease in suburban Pune’s Kharadi, from KRC Infrastructure and Projects Pvt Ltd, a subsidiary of real estate firm K Raheja Corp. Bengaluru: Amazon Development Centre India Pvt Ltd has taken up commercial office space on lease in suburban Pune’s Kharadi, from KRC Infrastructure and Projects Pvt Ltd, a subsidiary of real estate firm K Raheja Corp. Amazon has taken four floors on lease along with 205 carparks, across roughly 1.94 lakh sq ft, in a building in the project Gera Commerzone, an IT special economic zone (SEZ), according to documents accessed by real estate data and analytics firm Propstack. The transaction has been signed for a five-year lease tenure, where rent commences on 16 February. The rent payable is around  ₹75 per sq ft on for the initial 36 months after which there is a 15% escalation over the last payable rent. Amazon has taken four floors on lease along with 205 carparks, across roughly 1.94 lakh sq ft, in a building in the project Gera Commerzone, an IT special economic zone (SEZ), according to documents accessed by real estate data and analytics firm Propstack. The transaction has been signed for a five-year lease tenure, where rent commences on 16 February. The rent payable is around  ₹75 per sq ft on for the initial 36 months after which there is a 15% escalation over the last payable rent. Amazon and K Raheja Corp spokespeople didn’t respond to queries. Amazon has multiple entities operating in India including Amazon Cloud Services, Amazon Seller Services, Amazon Fulfillment Services and Amazon Development Centre (ADC). “…ADC develops technology products including their award-winning text to speech that is part of voice user interface of mobile devices. Their IVONA software includes a wide range of technology solutions for business, telecommunications, mobile and home use with new offerings constantly being developed. In many ways, this expansion shows Amazon’s long-term intent in India, and will result in a significant number of new roles in an otherwise challenging macro business environment,\" said Raja Seetharaman co-founder, Propstack. Last year, Amazon Data Services India had inked an agreement with K Raheja Corp subsidiary Newfound Properties and Leasing to lease a commercial tower with a built-up area of 4.51 lakh sq ft through a long-term sub-lease of over 15 years in Thane, in suburban Mumbai, to set up a data center.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/indigrid-to-acquire-100-stake-in-khargone-transmission-for-rs-1-497-crore\/amp-11674474260910.html","pub_date":"2023-01-23T17:14:20+05:30","title":"IndiGrid to acquire 100% stake in Khargone Transmission for  ₹1,497 crore","keywords":"IndiGrid,Infrastructure investment trust India Grid Trust,Khargone Transmission","articles":"KTL was envisaged with the objective of improving power supply and grid reliability by delivering 1320MW of thermal power from Khargone power plant to consumers in the domestic, commercial, agricultural, and industrial segments in Madhya Pradesh and Maharashtra.  New Delhi: Infrastructure investment trust India Grid Trust (IndiGrid) will acquire a 100% equity stake in Khargone Transmission at an enterprise value of about  ₹1,497.5 crore.  New Delhi: Infrastructure investment trust India Grid Trust (IndiGrid) will acquire a 100% equity stake in Khargone Transmission at an enterprise value of about  ₹1,497.5 crore.  IndiGrid signed a share purchase agreement on 21 January for acquisition of a 100% shareholding and economic interest, in one or more tranches, in Khargone Transmission Ltd from Sterlite Power Transmission Ltd. (one of the sponsors of IndiGrid), the company said in a notification to the exchanges. IndiGrid signed a share purchase agreement on 21 January for acquisition of a 100% shareholding and economic interest, in one or more tranches, in Khargone Transmission Ltd from Sterlite Power Transmission Ltd. (one of the sponsors of IndiGrid), the company said in a notification to the exchanges. “The completion of the acquisition would depend upon receipt of unitholders’ consent, regulatory and other relevant approvals as well as completion of contractual obligations,\" it added. The Khargone Transmission was incorporated on 28 November 2015. The project has six elements - one substation element, three transmission line, one LILO element and one line bay. The project is located in the state of Madhya Pradesh and Maharashtra.  KTL was envisaged with the objective of improving power supply and grid reliability by delivering 1320MW of thermal power from Khargone power plant to consumers in the domestic, commercial, agricultural, and industrial segments in Madhya Pradesh and Maharashtra. IndiGrid’s consolidated net profit almost doubled to  ₹125.79 crore in the September quarter, aided by higher revenues. ","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/vistara-turns-profitable-in-q3-for-first-time-since-touching-the-sky\/amp-11674472644316.html","pub_date":"2023-01-23T16:57:24+05:30","title":"Vistara turns profitable in Q3, for first time since touching the sky","keywords":"Vistara Q3 profits,Vistara reports profits first time ever,Vistara Q3 results,Vistara Q3 performance,Vistara revenue,Vistara profits,Vistara additions,air india,tata group,air asia","articles":"The carrier's top-line front is said to have crossed $1 billion, while its bottom-line basket turned profitable. However, the airline did not disclose the figures for profit in Q3.  Tata SIA Airlines, a joint venture between Tata Sons and Singapore Airlines, which operates as Vistara recorded profits in December 2022 quarter, for the first ever since it started flying in the skies both domestically and internationally. The carrier's top-line front is said to have crossed $1 billion, while its bottom-line basket turned profitable. However, the airline did not disclose the figures for profit in Q3. Tata SIA Airlines, a joint venture between Tata Sons and Singapore Airlines, which operates as Vistara recorded profits in December 2022 quarter, for the first ever since it started flying in the skies both domestically and internationally. The carrier's top-line front is said to have crossed $1 billion, while its bottom-line basket turned profitable. However, the airline did not disclose the figures for profit in Q3. According to a Reuters report, Vistara said its revenue crossed $1 billion and it clocked a net profit, excluding foreign currency loss and non-operating income, in the October-December quarter. The profit numbers were not disclosed. According to a Reuters report, Vistara said its revenue crossed $1 billion and it clocked a net profit, excluding foreign currency loss and non-operating income, in the October-December quarter. The profit numbers were not disclosed. Notably, this Tata carrier turned profitable at a time when Tata Group is seeking to consolidate its three brands --- Vistara, Air Asia, and former national carrier Air India. The move is to boost its aviation business. Notably, this Tata carrier turned profitable at a time when Tata Group is seeking to consolidate its three brands --- Vistara, Air Asia, and former national carrier Air India. The move is to boost its aviation business. Also, Reuters earlier reported that Tata is also set to place an order for some 495 new planes for Air India as it looks to revamp the airline and merge it with Vistara to create a bigger full-service carrier to take on Middle Eastern rivals like Emirates. Also, Reuters earlier reported that Tata is also set to place an order for some 495 new planes for Air India as it looks to revamp the airline and merge it with Vistara to create a bigger full-service carrier to take on Middle Eastern rivals like Emirates. TATA SIA Airlines is a 51:49 joint venture between Tata Son and Singapore Airlines. The brand Vistara commenced its operation on January 9, 2015, with an aim to set new standards in the aviation industry in India and connect destinations across the country and abroad. TATA SIA Airlines is a 51:49 joint venture between Tata Son and Singapore Airlines. The brand Vistara commenced its operation on January 9, 2015, with an aim to set new standards in the aviation industry in India and connect destinations across the country and abroad. Vistara has a fleet of 52 aircraft, including 42 Airbus A320, five Airbus A321neo, two Boeing 737-800NG, and three Boeing 787-9 Dreamliner aircraft, and has flown more than 42 million customers since starting operations. Vistara has a fleet of 52 aircraft, including 42 Airbus A320, five Airbus A321neo, two Boeing 737-800NG, and three Boeing 787-9 Dreamliner aircraft, and has flown more than 42 million customers since starting operations. In 2022, Vistara's international network climbed by over 180%, and its domestic network jumped by over 50%. The airline added new destinations and routes amid a rebound in travel demand post-pandemic. In 2022, Vistara's international network climbed by over 180%, and its domestic network jumped by over 50%. The airline added new destinations and routes amid a rebound in travel demand post-pandemic. Last week, Vistara announced the addition of Manohar International Airport (New Goa International Airport, Goa) to its domestic network with daily connectivity to and from Bengaluru along with 6x weekly flights to and from Mumbai, starting 14 February 2023. Last week, Vistara announced the addition of Manohar International Airport (New Goa International Airport, Goa) to its domestic network with daily connectivity to and from Bengaluru along with 6x weekly flights to and from Mumbai, starting 14 February 2023. As of December 31, 2022, Vistara's market share in the domestic aviation industry is 9.2%, while Air India's share is around 6.2% and low-cost carrier Air Asia's market share is 0.6%. As of December 31, 2022, Vistara's market share in the domestic aviation industry is 9.2%, while Air India's share is around 6.2% and low-cost carrier Air Asia's market share is 0.6%.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/start-ups\/fintech-unicorn-pine-labs-acquires-saluto-wellness\/amp-11674473011071.html","pub_date":"2023-01-23T16:53:30+05:30","title":"Fintech unicorn Pine Labs acquires Saluto Wellness","keywords":"Pine Labs,Saluto Wellness,point of sale ","articles":"In March last year, Pine Labs had raised $50 million at a $5 billion valuation from Vitruvian Partners. Prior to that, it had raised around $150 million from Alpha Wave Ventures in a funding round.  BENGALURU: IPO-bound fintech unicorn Pine Labs has acquired enterprise platform Saluto Wellness Pvt. Ltd for an undisclosed amount.  BENGALURU: IPO-bound fintech unicorn Pine Labs has acquired enterprise platform Saluto Wellness Pvt. Ltd for an undisclosed amount.  The company did not comment on any queries regarding transaction value.  The company did not comment on any queries regarding transaction value.  Sequoia-backed Pine Labs offers solutions to merchants across sectors such as electronics, food and beverage, fashion, pharmacy, telecom and airlines. In 2019, it had acquired Qwikcilver, a brand through which it offers prepaid, stored value, and gift card solutions to companies in sectors such as e-commerce, fast-moving consumer goods, banking and financial services sector among others.  The deal will help Pine Labs to improve its issuing business Qwikcilver’s offerings across employee rewards and recognition, customer loyalty and channel partner programs for medium and large enterprises. “With Saluto’s platform, we expect to enhance our leadership across enterprise rewards, recognition, incentive and engagement programmes,\" Kumar Sudarsan, president - issuing business, Pine Labs, said. “Their solution, integrated with our offerings, will help us deliver more programs to our existing enterprise clients – resulting in larger and more long-term engagements.\" Founded in 2017 by Siva Kumar and Anoop Nambiar, Bengaluru-based Saluto offers a digital platform to companies to improve engagement with employees, consumers and channel partners. It designs programmes for employee rewards, recognition and wellness, customer referrals, promotions, loyalty, among others. “Our enterprise solutions are today being used across diverse industry verticals and with this acquisition by Pine Labs, we will be able to scale our business further,“ said K Siva Kumar, chief executive, Saluto Wellness. In March last year, Pine Labs had raised $50 million at a $5 billion valuation from Vitruvian Partners. Prior to that, it had raised around $150 million from Alpha Wave Ventures in a funding round.  The company has since acquired stakes in multiple companies. It acquired Bengaluru-based Setu, an API (application programming interface) infrastructure fintech startup for $70 million to $75 million in June 2022 and payment solutions provider Mosambee in April 2022.   In February, it acquired payments startup Qfix Infocomm, for an undisclosed amount.  The point-of-sale (PoS) major has also invested to scale Plural, its brand for online payments products, to grow beyond offline channels. Last week, Pine Labs said it has forayed into the United Arab Emirates (UAE) market through partnerships with local banks and financial institutions, expanding in the global footprint beyond India and Malaysia.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/axis-bank-q3-update-net-profit-at-rs-5-853-cr-up-62-provisions-pick-up\/amp-11674465191712.html","pub_date":"2023-01-23T16:02:08+05:30","title":"Axis Bank Q3 update: Net profit at  ₹5,853 cr, up 62%; provisions pick up","keywords":"Axis Bank Q3 results,Axis Bank Q3 earnings,Axis Bank share price","articles":"During the second quarter, Axis Bank posted a net profit of  ₹5,330 crore up by 70% YoY, and net interest income (NII) of  ₹10,360 crore surging by 31% YoY.  One of the leading private lenders, Axis Bank announced its financial results for the third quarter ending December 31, 2022 (Q3FY23) period. The bank posted strong growth of 62% year-on-year growth in net profit to  ₹5,853.1 crore in Q3FY23. However, in the quarter, the bank's provisions scaled up sharply on a quarter-on-quarter basis, but asset quality improves further. One of the leading private lenders, Axis Bank announced its financial results for the third quarter ending December 31, 2022 (Q3FY23) period. The bank posted strong growth of 62% year-on-year growth in net profit to  ₹5,853.1 crore in Q3FY23. However, in the quarter, the bank's provisions scaled up sharply on a quarter-on-quarter basis, but asset quality improves further. The Q3 PAT rose by 9.82% from a profit of  ₹5,329.77 crore in September 2022 quarter. The Q3 PAT rose by 9.82% from a profit of  ₹5,329.77 crore in September 2022 quarter. Net interest income (NII) came in at  ₹11,459 crore in Q3FY23, registering a growth of 32% YoY and 11% QoQ. Net interest margins (NIM) expanded b 73 bps YoY and 30 bps QoQ to 4.26% in the quarter. Net interest income (NII) came in at  ₹11,459 crore in Q3FY23, registering a growth of 32% YoY and 11% QoQ. Net interest margins (NIM) expanded b 73 bps YoY and 30 bps QoQ to 4.26% in the quarter. Also, the bank's provisions scaled up sharply to  ₹1,437.73 crore in Q3FY23 compared to  ₹549.78 crore in Q2 of the same fiscal. The provisions are marginally up from  ₹1,334.83 crore in December 2021 quarter. Also, the bank's provisions scaled up sharply to  ₹1,437.73 crore in Q3FY23 compared to  ₹549.78 crore in Q2 of the same fiscal. The provisions are marginally up from  ₹1,334.83 crore in December 2021 quarter. According to Axis Bank, the provisions in Q3FY23 also included  ₹340 crore of non-recurring, one-time\/prudent provisions. According to Axis Bank, the provisions in Q3FY23 also included  ₹340 crore of non-recurring, one-time\/prudent provisions. On the contrary, gross NPA came in at 2.38% in Q3FY23 compared to 2.50% in Q2FY23 and 3.17% in Q3FY22 --- declining by 79 bps YoY and 12 bps QoQ. Net NPA as well contracted by 44 bps YoY and 4 bps QoQ to 0.47%. The provision coverage ratio stood healthy at 81%. On the contrary, gross NPA came in at 2.38% in Q3FY23 compared to 2.50% in Q2FY23 and 3.17% in Q3FY22 --- declining by 79 bps YoY and 12 bps QoQ. Net NPA as well contracted by 44 bps YoY and 4 bps QoQ to 0.47%. The provision coverage ratio stood healthy at 81%. Amitabh Chaudhry, MD&CEO, Axis Bank commented, “In the midst of global uncertainty, India stands as a bright spot offering great stability and opportunities for the economy and businesses.\" Amitabh Chaudhry, MD&CEO, Axis Bank commented, “In the midst of global uncertainty, India stands as a bright spot offering great stability and opportunities for the economy and businesses.\" On the merger deal with Citi Group, Chaudhry said, \"The Citi merger has been shaping very well, and we are extremely happy with the response we are getting from customers and employees alike. We are excited to welcome them all to the Axis family.\" On the merger deal with Citi Group, Chaudhry said, \"The Citi merger has been shaping very well, and we are extremely happy with the response we are getting from customers and employees alike. We are excited to welcome them all to the Axis family.\" The MD stated that the banking sector is in a good position to leverage this great momentum built over the last few quarters. Axis Bank has been steadily enhancing its capabilities, buoyed by good business growth and great partnerships. The MD stated that the banking sector is in a good position to leverage this great momentum built over the last few quarters. Axis Bank has been steadily enhancing its capabilities, buoyed by good business growth and great partnerships. Axis Bank's balance sheet grew 10% YOY and stood at  ₹12,23,509 crore as of December 31, 2022. Total deposits jumped by 9% YoY and 2% QoQ on a quarterly average balance (QAB) basis. In the quarter, current account deposits soared by 9% YoY, and 10% QoQ savings account deposits also surged by 10% YoY and 1% QoQ. Total term deposits picked up by 9% YoY and 2% QoQ, while the share of CASA deposits stood at 44%. Axis Bank's balance sheet grew 10% YOY and stood at  ₹12,23,509 crore as of December 31, 2022. Total deposits jumped by 9% YoY and 2% QoQ on a quarterly average balance (QAB) basis. In the quarter, current account deposits soared by 9% YoY, and 10% QoQ savings account deposits also surged by 10% YoY and 1% QoQ. Total term deposits picked up by 9% YoY and 2% QoQ, while the share of CASA deposits stood at 44%. Meanwhile, net advances stood at  ₹7,62,075 crore in Q3FY23 up by 15% YoY and 4% QoQ. Meanwhile, net advances stood at  ₹7,62,075 crore in Q3FY23 up by 15% YoY and 4% QoQ. During the quarter, home loans grew 9% YoY, Small Business Banking (SBB) grew 60% YoY, and the rural loan portfolio grew 27% YoY. Unsecured personal loans grew 21% YoY and credit card advances grew 39% YoY. SME book remains well diversified across geographies and sectors, growing 24% YoY and 5% QoQ to  ₹82,190 crore. Corporate loan book grew 8% YoY and 9% QoQ to  ₹2,50,572 crore. During the quarter, home loans grew 9% YoY, Small Business Banking (SBB) grew 60% YoY, and the rural loan portfolio grew 27% YoY. Unsecured personal loans grew 21% YoY and credit card advances grew 39% YoY. SME book remains well diversified across geographies and sectors, growing 24% YoY and 5% QoQ to  ₹82,190 crore. Corporate loan book grew 8% YoY and 9% QoQ to  ₹2,50,572 crore. Notably, Axis Bank issued 1.04 million new credit cards in Q3FY23. Notably, Axis Bank issued 1.04 million new credit cards in Q3FY23. As of December 31, 2022, the bank's network stood at 4,849 domestic branches and extension counters situated in 2,734 centres compared to 4,700 domestic branches and extension counters situated in 2,665 centres as of December 31, 2021. Also, the bank had 15,674 ATMs and cash recyclers spread across the country. The Bank’s Axis Virtual Centre is present across six centres with over 1,500 Virtual Relationship Managers as of December 31, 2022. As of December 31, 2022, the bank's network stood at 4,849 domestic branches and extension counters situated in 2,734 centres compared to 4,700 domestic branches and extension counters situated in 2,665 centres as of December 31, 2021. Also, the bank had 15,674 ATMs and cash recyclers spread across the country. The Bank’s Axis Virtual Centre is present across six centres with over 1,500 Virtual Relationship Managers as of December 31, 2022. On BSE, Axis Bank shares closed at  ₹933.35 apiece marginally up from the previous session. On BSE, Axis Bank shares closed at  ₹933.35 apiece marginally up from the previous session.    ","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/lemon-tree-signs-new-franchised-hotel-in-rajasthan\/amp-11674467202174.html","pub_date":"2023-01-23T15:16:41+05:30","title":"Lemon Tree signs new franchised hotel in Rajasthan","keywords":"hotel rooms,hospitality consultancy,hotelivate,lemon tree hotels,rajasthan,vilas pawar,mountain tree resorts private limited","articles":"The company currently operates about 8,350 rooms in 87 hotels across and is expecting to have 11,200 rooms in 122 hotels across by the end of calendar year 2025. The group runs seven brands including Aurika Hotels & Resorts, Lemon Tree Premier, Red Fox Hotels, Keys Prima etc  New Delhi: Lemon Tree Hotels has announced the signing of a franchised hotel in Rajasthan. Under its Lemon Tree Resort brand, the company has opened its hotel in Kumbhalgarh. The property is franchised by the listed entity, Lemon Tree Hotels Ltd., and is expected to open by December 2023. New Delhi: Lemon Tree Hotels has announced the signing of a franchised hotel in Rajasthan. Under its Lemon Tree Resort brand, the company has opened its hotel in Kumbhalgarh. The property is franchised by the listed entity, Lemon Tree Hotels Ltd., and is expected to open by December 2023. The hotel will have 59 rooms, a restaurant, a bar, and meeting rooms.  The hotel will have 59 rooms, a restaurant, a bar, and meeting rooms.  Vilas Pawar, CEO of the franchise business for the listed hotel entity, said, “This hotel has been signed with Mountain Tree Resorts Pvt. Ltd. We are expanding our footprint across the state of Rajasthan and this property will be an addition to our six existing hotels and resorts in the state. Lemon Tree Hotels signed 19 hotels in the last calendar year, and we are looking to top that number this year with numerous signings and openings planned across different segments in the coming months.\" The company currently operates about 8,350 rooms in 87 hotels across and is expecting to have 11,200 rooms in 122 hotels across by the end of calendar year 2025. The group runs seven brands including Aurika Hotels & Resorts, Lemon Tree Premier, Red Fox Hotels, Keys Prima etc. Earlier this week, another hospitality player Brij Hotels launched another 41-room hotel in Rajasthan under the brand, Brij Gaj Kesri in Bikaner. The property is spread on 16 acres of land is the group’s fourth hotel in Rajasthan, and sixth across India. According to a report by hospitality consultancy Hotelivate, the demand for hotel rooms will outpace supply in the next five years and there is likely to be a shortage of supply of hotel rooms. India currently has about 1.5 lakh branded hotel rooms and the projected upcoming supply of 35,000 rooms (which are being actively developed), just about 7,000 rooms are going to be added per year. This is just a 4.5% growth in supply.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/pepsico-india-s-kurkure-brand-launches-second-tv-commercial-for-playz\/amp-11674467010410.html","pub_date":"2023-01-23T15:13:30+05:30","title":"Pepsico India’s Kurkure brand launches second TV commercial for Playz","keywords":"neha prasad,kurkure,kurkure playz,statista,vikram pandey,leo burnett,television commercial,india's tv commercials,advertising in india","articles":"WIth the second television commercial, Kurkure hopes to keep everyone entertained in the brand’s style  New Delhi: Pepsico India-owned snack brand Kurkure has launched its second television commercial for Kurkure Playz snack’s ‘Halke Mein Lo’ campaign which aired last month. New Delhi: Pepsico India-owned snack brand Kurkure has launched its second television commercial for Kurkure Playz snack’s ‘Halke Mein Lo’ campaign which aired last month. Following the first TVC film that captured a banter between a young protagonist and ghost, this film shows a family enjoying teatime in the front yard of their bungalow when there’s a sudden disturbance on the radio playing next to them. Following the first TVC film that captured a banter between a young protagonist and ghost, this film shows a family enjoying teatime in the front yard of their bungalow when there’s a sudden disturbance on the radio playing next to them. When they look up, they find a spaceship hovering over the lawn amid dark clouds with strong winds. Two aliens appear with a plan to abduct the family, beckoning the protagonist to get on the ship right away. While spooked at first, a bite of the snack transforms the youngster’s fear into a take-it-easy attitude, the company said in a statement. This leads him to make witty wisecracks diffusing an intimidating situation into a laughing riot. Vikram Pandey, the national creative director of Leo Burnett -- the company behind the campaign -- said, “This second film continues the light-hearted quirky tonality set by the first film with our proposition. In this film we find the protagonist’s family facing an alien invasion, but they manage to put off their abduction by stalling the aliens. We hope that the audiences will enjoy this film as much as the first one.\" Neha Prasad, associate director and brand lead for the snack brand said, “Our first film received an overwhelmingly positive response for its unique storytelling format. This propelled us to bring forth the second television commercial that we hope will once again keep everyone entertained in the brand’s style.“ According to analysis website Statista, the snack food segment in India is projected to grow by 7.52% from 2023 to have a market volume of $89.45 billion in 2027.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/company-results\/idbi-bank-q3-profit-surges-60-to-all-time-high-of-rs-927-crore-nii-up-23\/amp-11674465197868.html","pub_date":"2023-01-23T14:44:13+05:30","title":"IDBI Bank Q3 profit surges 60% to all-time high of  ₹927 crore, NII up 23%","keywords":"idbi bank","articles":"Net interest income (NII) which is the difference between interest earned and interest expended, came in at  ₹2,925 crore for the December quarter.  IDBI Bank on Monday reported a 60 per cent rise in standalone net profit to  ₹927 crore for the December 2022 quarter as asset quality improved . This is against a net profit of  ₹578 crore in the year-ago period, IDBI Bank said in a regulatory filing. IDBI Bank on Monday reported a 60 per cent rise in standalone net profit to  ₹927 crore for the December 2022 quarter as asset quality improved . This is against a net profit of  ₹578 crore in the year-ago period, IDBI Bank said in a regulatory filing. Net interest income (NII) which is the difference between interest earned and interest expended, came in at  ₹2,925 crore for the December quarter. The latest quarter's NII climbed by 23 per cent from  ₹2,383 crore in Q3FY22 and was up by 7 per cent from  ₹2,738 crore in Q2FY23. Net interest income (NII) which is the difference between interest earned and interest expended, came in at  ₹2,925 crore for the December quarter. The latest quarter's NII climbed by 23 per cent from  ₹2,383 crore in Q3FY22 and was up by 7 per cent from  ₹2,738 crore in Q2FY23. The net advances grew by 17 per cent year-on-year to  ₹1,48,213 crore as against  ₹1,26,372 as on December 31, 2021. The net advances grew by 17 per cent year-on-year to  ₹1,48,213 crore as against  ₹1,26,372 as on December 31, 2021. Net interest margin (NIM) improved to 4.59 per cent for December quarter as compared to 3.88% for corresponding quarter last fiscal. NIM stood at 4.37% (4.22% excluding interest on IT refund) for Q2FY2023. Net interest margin (NIM) improved to 4.59 per cent for December quarter as compared to 3.88% for corresponding quarter last fiscal. NIM stood at 4.37% (4.22% excluding interest on IT refund) for Q2FY2023. Provisions and contingencies which came in at  ₹ ₹784.28 crore in Q3FY23 down by 2.18 per cent as compared to  ₹801.81 crore in the corresponding quarter last fiscal.  Provisions and contingencies which came in at  ₹ ₹784.28 crore in Q3FY23 down by 2.18 per cent as compared to  ₹801.81 crore in the corresponding quarter last fiscal.  In Q3FY23, in percentage terms, IDBI Bank posted a gross NPA that stood at 13.82 per cent as on December 31, 2022 as against 21.68 per cent on a year-on-year basis. Gross NPA stood at 16.51 per cent as on September 30, 2022. In Q3FY23, in percentage terms, IDBI Bank posted a gross NPA that stood at 13.82 per cent as on December 31, 2022 as against 21.68 per cent on a year-on-year basis. Gross NPA stood at 16.51 per cent as on September 30, 2022. Also, net NPA improved to 1.07% as on December 31, 2022 as against 1.81% as on December 31, 2021. Net NPA ratio stood at 1.15% as on September 30, 2022. Also, net NPA improved to 1.07% as on December 31, 2022 as against 1.81% as on December 31, 2021. Net NPA ratio stood at 1.15% as on September 30, 2022. IDBI Bank stock traded at  ₹54.95 on the BSE, up by 0.64 per cent. IDBI Bank stock traded at  ₹54.95 on the BSE, up by 0.64 per cent.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/apple-targets-raising-india-production-share-to-up-to-25-piyush-goyal\/amp-11674459177799.html","pub_date":"2023-01-23T13:41:36+05:30","title":"Apple targets raising India production share to up to 25%: Piyush Goyal","keywords":"Apple Inc,Apple India,Apple India production,Union Commerce Minister Piyush Goyal,Apple production","articles":"Cupertino, California-based Apple has bet big on India since it began iPhone assembly in the country in 2017 via Wistron and later with Foxconn, in line with the Indian government's push for local manufacturing.  Apple Inc wants India to account for up to 25% of its production from about 5% to 7% now, Union Commerce Minister Piyush Goyal said on Monday. The iPhone maker continues to move its manufacturing away from China, according to news agency Reuters.  Apple Inc wants India to account for up to 25% of its production from about 5% to 7% now, Union Commerce Minister Piyush Goyal said on Monday. The iPhone maker continues to move its manufacturing away from China, according to news agency Reuters.  “Apple, another success story,\" Piyush Goyal said, pitching India as a competitive manufacturing destination.  “Apple, another success story,\" Piyush Goyal said, pitching India as a competitive manufacturing destination.  “They are already at about 5-7% of their manufacturing in India. If I am not mistaken, they are targeting to go up to 25% of their manufacturing. They launched the most recent models from India, manufactured in India,\" the minister told in a press conference.  “They are already at about 5-7% of their manufacturing in India. If I am not mistaken, they are targeting to go up to 25% of their manufacturing. They launched the most recent models from India, manufactured in India,\" the minister told in a press conference.  However, he did not say when Apple wants to meet the target and the company did not immediately respond to a request for comment.  However, he did not say when Apple wants to meet the target and the company did not immediately respond to a request for comment.  Cupertino, California-based Apple has bet big on India since it began iPhone assembly in the country in 2017 via Wistron and later with Foxconn, in line with the Indian government's push for local manufacturing.  Cupertino, California-based Apple has bet big on India since it began iPhone assembly in the country in 2017 via Wistron and later with Foxconn, in line with the Indian government's push for local manufacturing.  Last year, sources told Reuters that Foxconn plans to quadruple the workforce at its iPhone factory in India over two years. Information Technology minister Ashwini Vaishnaw on Monday tweeted that Apple's exports from India had hit $1 billion in December.  Last year, sources told Reuters that Foxconn plans to quadruple the workforce at its iPhone factory in India over two years. Information Technology minister Ashwini Vaishnaw on Monday tweeted that Apple's exports from India had hit $1 billion in December.  China's Covid-19 related lockdowns and restrictions, and rising trade and geopolitical tensions between Beijing and Washington, have influenced Apple's plans to shift production elsewhere.  China's Covid-19 related lockdowns and restrictions, and rising trade and geopolitical tensions between Beijing and Washington, have influenced Apple's plans to shift production elsewhere.  JP Morgan analysts estimated last year that a quarter of all Apple products would be made outside China by 2025, from current 5%. JP Morgan analysts estimated last year that a quarter of all Apple products would be made outside China by 2025, from current 5%. Meanwhile, more than a dozen of Apple Inc.’s Chinese suppliers are receiving initial clearance by India to expand in the country, helping the tech giant’s efforts to diversify its assembly network beyond China. Meanwhile, more than a dozen of Apple Inc.’s Chinese suppliers are receiving initial clearance by India to expand in the country, helping the tech giant’s efforts to diversify its assembly network beyond China. AirPods and iPhone assembler Luxshare Precision Industry Co. and a unit of lensmaker Sunny Optical Technology Group Co. are among the companies gaining approval, people familiar with the matter said, asking not to be named because the permits aren’t public. AirPods and iPhone assembler Luxshare Precision Industry Co. and a unit of lensmaker Sunny Optical Technology Group Co. are among the companies gaining approval, people familiar with the matter said, asking not to be named because the permits aren’t public.     (With Reuters inputs) (With Reuters inputs)","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/sterlite-power-bags-orders-worth-rs-3800-cr-across-its-solutions-business\/amp-11674460926666.html","pub_date":"2023-01-23T13:32:06+05:30","title":"Sterlite Power bags orders worth  ₹3800 cr across its solutions business","keywords":"Sterlite Power,power transmission,power lines,transmission projects","articles":"As part of the solutions business, Sterlite Power manufactures and sells a diversified portfolio of products, covering high performance conductors, OPGW and EHV insulated power cables, to international as well as domestic customers  New Delhi: Power transmission developer Sterlite Power said on Monday that it secured orders worth around  ₹3,800 crore across its solutions business in domestic and international markets during the first three quarters FY23, a growth of 90% year-on-year. New Delhi: Power transmission developer Sterlite Power said on Monday that it secured orders worth around  ₹3,800 crore across its solutions business in domestic and international markets during the first three quarters FY23, a growth of 90% year-on-year. “The new order wins are for uprate of existing power transmission lines for 132 kV, 220 kV and 400kV of Power Grid Corp. of India and state utilities like Meghalaya Power Transmission Corporation Ltd. , and West Bengal State Electricity Transmission Company Ltd.,\" the company said in a statement. “The new order wins are for uprate of existing power transmission lines for 132 kV, 220 kV and 400kV of Power Grid Corp. of India and state utilities like Meghalaya Power Transmission Corporation Ltd. , and West Bengal State Electricity Transmission Company Ltd.,\" the company said in a statement. For Haryana Vidyut Prasaran Nigam Ltd., the company will supply and install OPGW for fiberisation of the state’s existing transmission network for 66 kV, 132 kV, 220 kV and 400kV.  In products business, the company has bagged orders for conductors and OPGW from large customers in India, Americas, SAARC, and MEA region. Orders include supplies for major green energy transmission projects in India and abroad.  The company has also acquired strategic orders for the supply of extra high voltage (EHV) cables to state utilities like Maharashtra State Electricity Transmission Company Ltd. and Rajasthan Rajya Vidyut Prasaran Nigam Ltd.  The company has also been marking its presence in Turnkey EHV cable projects including substation at various state utilities. “We are delighted with the multiple order wins for our transmission uprate projects, high-performance conductors and EHV products that are positively impacting communities and businesses by enabling access to reliable, and high-quality electricity, worldwide,“ said Manish Agarwal, director & CEO India Transmission Business, Sterlite Power. “With power utilities facing increased pressure due to a rapidly growing population, increased demand and ageing infrastructure, there is an urgent need for uprates and upgrades. Our bespoke solutions are helping address the challenges of time, space, and capital by establishing capacity augmentation in an economic manner, within shortest possible time and with minimum disruption,\" he said. As part of the solutions business, Sterlite Power manufactures and sells a diversified portfolio of products, covering high performance conductors, OPGW and EHV insulated power cables, to international as well as domestic customers, including central and state electricity transmission companies, power transmission infra developers and transmission engineering, procurement, and construction contractors.  Under its infrastructure business unit, the company has six transmission projects under development including the recently won inter-state transmission system projects in J&K as well as northeast India which will play a pivotal role in connecting clean and green power to the national grid.  The company is also building its largest green energy transmission corridor in Gujarat, aimed at meeting India’s renewable energy target of installing 500 GW. This transmission corridor will connect the wind energy zones of Bhuj to the load centers in Maharashtra and Gujarat.  It is also constructing projects such as Mumbai Urja Marg Limited, Goa Tamnar Transmission Project, and Udupi Kasargode Transmission Limited. Sterlite Power is a leading private sector power transmission infrastructure developer and solutions provider with a portfolio of 30 projects covering approximately 14,602 circuit km of transmission lines across India and Brazil. The company has a portfolio of high-performance power conductors, extra high voltage (EHV) cables and optical ground wires (OPGW).","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/lt-construction-bags-significant-orders-for-various-businesses\/amp-11674459990312.html","pub_date":"2023-01-23T13:16:29+05:30","title":"L&amp;T construction bags ‘significant’ orders for various businesses","keywords":"L&amp;T Construction,renewable energy,power transmission","articles":"The renewables arm of the power transmission and distribution business has received a turnkey EPC order to establish a 112.5MW solar power plant in south-western part of West Bengal  New Delhi: Larsen and Toubro (L&T) on Monday said its construction arm has won various \"significant\" contracts for its businesses, including power transmission and distribution and building and factories. New Delhi: Larsen and Toubro (L&T) on Monday said its construction arm has won various \"significant\" contracts for its businesses, including power transmission and distribution and building and factories. L&T construction won the orders with value in the range of  ₹ 1,000 crore -  ₹ 2,500 crore, according to a BSE filing. L&T construction won the orders with value in the range of  ₹ 1,000 crore -  ₹ 2,500 crore, according to a BSE filing. “The renewables arm of the power transmission and distribution business has received a turnkey EPC order to establish a 112.5MW Solar Power Plant in south-western part of West Bengal,\" the company said in a statement. The state undertaking, which is implementing this project with financing from a foreign development bank, has awarded this package on an international competitive bidding basis. In central-western part of Uttar Pradesh, the business has received an order to undertake works for the development of power distribution infrastructure under the revamped reforms-linked distribution scheme, it added. The scope includes loss reduction works including GIS asset mapping. Further in the overseas market, the business has won an order to implement the electrical system along with the associated civil and instrumentation works for an energy company in the Middle East. The multinational conglomerate’s business of building and factories has secured an order from Nanavati Max Super Specialty Hospital to construct a state-of-the-art 600-bed super specialty hospital at Vile Parle, Mumbai. The scope of work in this brownfield project includes turnkey construction of a total of 7.3 lakh sq ft in two phases, it said. Phase 1 is to be completed in 23 months and phase 2 in 17 months with a three-month gap between both phases for shifting and demolishing existing buildings. Larsen & Toubro is an Indian multinational engaged in EPC projects, manufacturing, and services. It operates in over 50 countries worldwide. Shares of L&T were trading 0.82% lower at  ₹2,231.50 on the BSE today.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/canara-bank-q3-net-profit-rises-92-shares-surge\/amp-11674455748024.html","pub_date":"2023-01-23T12:17:58+05:30","title":"Canara Bank Q3 net profit rises 92%; shares surge","keywords":"canara bank q3 results,canara bank shares,canara bank profit,bank stocks","articles":"Canara Bank shares were trading more than a per cent higher at  ₹324 apiece on the BSE in afternoon deals  Canara Bank on Monday reported a 92% rise in net profit during the third quarter ended December 2022 at  ₹2,881.5 crore as compared to  ₹1,502 crore in the same quarter a year ago. Shares of Canara Bank were trading nearly a per cent higher at  ₹324 apiece on the BSE in afternoon deals. Canara Bank on Monday reported a 92% rise in net profit during the third quarter ended December 2022 at  ₹2,881.5 crore as compared to  ₹1,502 crore in the same quarter a year ago. Shares of Canara Bank were trading nearly a per cent higher at  ₹324 apiece on the BSE in afternoon deals. Meanwhile, the lender's net interest income or NII, which is the difference between the interest earned and expended, rose about 24% to  ₹8,600 crore as against  ₹6,945 crore year-on-year (YoY). Its net interest margin (NIM) stood at 3.04% as compared to 2.83% in the previous quarter. Meanwhile, the lender's net interest income or NII, which is the difference between the interest earned and expended, rose about 24% to  ₹8,600 crore as against  ₹6,945 crore year-on-year (YoY). Its net interest margin (NIM) stood at 3.04% as compared to 2.83% in the previous quarter. On the asset quality front, Canara Bank's gross non-performing assets (NPAs) declined at 5.89% as against 6.37% in the September 2022 quarter whereas net NPAs dipped to 1.96% from 2.19% from the previous quarter. On the asset quality front, Canara Bank's gross non-performing assets (NPAs) declined at 5.89% as against 6.37% in the September 2022 quarter whereas net NPAs dipped to 1.96% from 2.19% from the previous quarter. The bank's provisions and contingencies declined to  ₹3,121 crore from  ₹3,636.8 crore quarter-on-quarter (QoQ) and versus  ₹2,244.8 crore in the year ago period. Its loan growth stood at 18% (YoY). The capital adequacy ratio rose to 16.72% in December quarter as against 16.51% QoQ and 14.80% YoY. The bank's provisions and contingencies declined to  ₹3,121 crore from  ₹3,636.8 crore quarter-on-quarter (QoQ) and versus  ₹2,244.8 crore in the year ago period. Its loan growth stood at 18% (YoY). The capital adequacy ratio rose to 16.72% in December quarter as against 16.51% QoQ and 14.80% YoY. Last week, Canara Bank said that is planning to sell its stake in Russian joint venture Commercial Indo Bank LLC (CIBL) to the other venture partner State Bank of India (SBI) for about  ₹114 crore. CIBL, incorporated in 2003, is a joint venture (JV) in Russia between SBI (60%) and Canara Bank (40%). Last week, Canara Bank said that is planning to sell its stake in Russian joint venture Commercial Indo Bank LLC (CIBL) to the other venture partner State Bank of India (SBI) for about  ₹114 crore. CIBL, incorporated in 2003, is a joint venture (JV) in Russia between SBI (60%) and Canara Bank (40%). Canara Bank has entered into a share sale agreement in relation to sale of equity shares held by it in Moscow-based CIBL with SBI, the bank said in an exchange filing, adding that based on share sale agreement and with the consent of Central Bank of Russia, entire shares held by Canara Bank have been transferred to SBI on November 30, 2022. The Bengaluru-based state-owned bank entered into the agreement for sale on November 11, 2022.  Canara Bank has entered into a share sale agreement in relation to sale of equity shares held by it in Moscow-based CIBL with SBI, the bank said in an exchange filing, adding that based on share sale agreement and with the consent of Central Bank of Russia, entire shares held by Canara Bank have been transferred to SBI on November 30, 2022. The Bengaluru-based state-owned bank entered into the agreement for sale on November 11, 2022. ","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/bharat-petroleum-to-shut-down-its-bina-refinery-in-this-june-here-s-why\/amp-11674442810623.html","pub_date":"2023-01-23T08:38:47+05:30","title":"Bharat Petroleum to shut down its Bina refinery in this June - here's why","keywords":"Bharat Petroleum Corp Ltd,India's BPCL,BPCL's Bina refinery,BPCL to shut down Bina refinery,Bina refinery closed","articles":"Indian refiners have to shut units at refineries once every four years for maintenance and inspection.  India's Bharat Petroleum Corp plans to shut its 156,000 barrels-per-day (bpd) Bina refinery in central India for about a month in June for maintenance, two sources familiar with the plan said. India's Bharat Petroleum Corp plans to shut its 156,000 barrels-per-day (bpd) Bina refinery in central India for about a month in June for maintenance, two sources familiar with the plan said. The state-run refiner also plans to shut half of its 240,000 bpd Mumbai refinery in western India for three to four weeks in September-October for maintenance, the sources said. The state-run refiner also plans to shut half of its 240,000 bpd Mumbai refinery in western India for three to four weeks in September-October for maintenance, the sources said. BPCL's spokesperson did not respond to a Reuters' request for comments. BPCL's spokesperson did not respond to a Reuters' request for comments. Sources said the details of the shutdown plan are \"tentative\" and dates will be finalised later. Sources said the details of the shutdown plan are \"tentative\" and dates will be finalised later. \"As of now plan is to shut Bina refinery from June 1, once Numaligarh (refinery) is back from its shutdown,\" one of the sources said. \"As of now plan is to shut Bina refinery from June 1, once Numaligarh (refinery) is back from its shutdown,\" one of the sources said. Indian refiners have to shut units at refineries once every four years for maintenance and inspection. Indian refiners have to shut units at refineries once every four years for maintenance and inspection. Numaligarh Refinery Ltd plans to shut its 60,000-bpd plant in the northeast for about 40 days up to the end of April for maintenance, a company spokesperson told Reuters. Numaligarh Refinery Ltd plans to shut its 60,000-bpd plant in the northeast for about 40 days up to the end of April for maintenance, a company spokesperson told Reuters. Sources said the planned shutdown of units at BPCL's refineries will not lead to shortages and the company will meet its supply commitments. Sources said the planned shutdown of units at BPCL's refineries will not lead to shortages and the company will meet its supply commitments. This story has been published from a wire agency feed without modifications to the text. Only the headline has been changed.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/it-startups-may-cut-up-to-20-000-jobs-in-next6months\/amp-11674408539192.html","pub_date":"2023-01-22T22:58:58+05:30","title":"IT, startups may  cut  up to 20,000  jobs  in next  6 months","keywords":"layoffs,job cuts,Indian IT,startups,employees,hiring frenzy,salary costs","articles":"Pressure from investors, an expected global recession and the domino impact of global layoffs have resulted in staff cuts  India’s IT and startup sectors may lay off 15,000 to 20,000 employees in the next six months, battling slowing demand after the hiring frenzy of the last two years inflated salary costs.  India’s IT and startup sectors may lay off 15,000 to 20,000 employees in the next six months, battling slowing demand after the hiring frenzy of the last two years inflated salary costs.  Recruitment consultants expect fewer hiring mandates in the months ahead and have decided not to enter new businesses for now. Recruitment consultants expect fewer hiring mandates in the months ahead and have decided not to enter new businesses for now. However, even as some IT and startup companies will shed staff to manage costs, others within the same sectors are hiring, too. “We expect about 20,000 layoffs over the next few quarters. Over the last year, companies faced the fear of missing out on talent hiring and recruited in large numbers and paid them many folds more than inflation and market standards,\" said Lohit Bhatia, president of workforce management for recruitment firm Quess Corp.  The cost of maintaining that talent has begun to hurt IT firms and startups, Bhatia added. In FY23 so far, the two sectors have laid off more than 20,000 employees, including 1,400 in the first two weeks of January. Many IT product and services firms, edtechs and fintechs are struggling after the over-hiring of pandemic years, when they snapped up talent at steep salaries assuming continued growth. Today, pressure from investors, an expected global recession and the domino impact of global layoffs have combined to result in staff cuts. Last week, Google fired 12,000 employees, joining tech giants such as Meta, Amazon and Microsoft, which have laid off 11,000, 18,000 and 11,000 workers, respectively. “Fifteen thousand employees will get retrenched over the next six months, but this will be the last leg of the recession. However, there are skilled employees who are getting absorbed into the industry. Attrition in many of the product or IT service firms are upwards of 15%, which means despite layoffs, there is room for lateral hirings,\" said Kamal Karanth, co-founder of Xpheno, which specializes in technology and startup hiring. IT services companies such as Tata Consultancy Services Ltd, Infosys Ltd, Wipro Ltd and HCL Tech face high employee costs, even though overall headcount has fallen.  The impact is mostly on junior and middle-level employees, but search firms in charge of senior hiring in tech and startup sectors said leadership hiring had slowed as well. “There are a couple of cases where the decision-making is getting delayed, but that’s about it. In fact, as a side effect of this retrenchment news, clients have raised their expectations, imagining that a lot of talent is now available,\" said Amit Agarwal, managing director, Singapore and India, Stanton Chase. “However, the matter of fact is companies are not letting go of their key talent or high performers at the top. So, the battle for leadership only intensifies,\" he added. Rituparna Chakraborty, co-founder and executive director of TeamLease Services, expects employers to remain cautious for at least the first quarter of the new fiscal. “IT hiring has gone down, and there is tepidness in the market,\" Chakraborty said.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/rbitoappealbombay-hc-order-onyesbankat1bonds\/amp-11674407344086.html","pub_date":"2023-01-22T22:39:03+05:30","title":"RBI  may  appeal  Bombay HC  order on  Yes  Bank  AT-1  bonds","keywords":"RBI,Bombay high court,Yes Bank,additional tier-I bonds,AT-I","articles":"Bombay high court ruling could have a huge sectoral impact.  The Reserve Bank of India will likely appeal the Bombay high court ruling that quashed the regulator and Yes Bank administrator’s decision to write off additional tier-I (AT-I) bonds to save the lender from collapsing, according to two officials familiar with the matter.  The Reserve Bank of India will likely appeal the Bombay high court ruling that quashed the regulator and Yes Bank administrator’s decision to write off additional tier-I (AT-I) bonds to save the lender from collapsing, according to two officials familiar with the matter.  This high court on Friday granted six weeks to Yes Bank to file its appeal against the order in the Supreme Court.  This high court on Friday granted six weeks to Yes Bank to file its appeal against the order in the Supreme Court.  “RBI believes the writ petition is not maintainable and the order could have a huge sectoral impact. The central bank also believes that the administrator had all the powers of the board to write off the bonds and, therefore, the court’s argument is not valid,\" said one of the two officials aware of the matter, requesting anonymity.  RBI approved the Yes Bank administrator’s March 2020 decision to write off the AT-I bonds as part of a restructuring plan to save bank depositors from losing their savings.  You might also like   India’s rupee trade bid and the math behind it  How GST brought cheer to some states, not others  How a non-compete clause pushed Roongta to RIA practice  The decision was then challenged in court by a group of aggrieved bondholders.MINT PREMIUMSee All\n  AT-I bonds are unsecured bonds with no maturity date and are used by banks to shore up their capital base and comply with Basel III norms. An email sent to a spokesperson for RBI went unanswered. The high court, in its order, said that the administrator appointed by the RBI exceeded his powers to write off the AT-I bonds as the decision was taken after the final reconstitution scheme was notified on 13 March 2020. It said that the scheme came into force on 13 March 2020, and the bank stood reconstructed on the same day. The court ruled that AT-I bonds could only be written down before the bank’s reconstruction. It also pointed out that the government-approved reconstruction scheme for Yes Bank did not include a clause for writing down these bonds. However, the court did not consider whether the writing off of the AT-1 bonds was necessary but only looked at the decision-making process. Yes Bank argued that Section 36 AC of the RBI Act allows the administrator to exercise the board’s powers until a new board takes charge. “The court order is based on two grounds—the date of reconstruction and the administrator did not have the power after the scheme was notified. As far as the first ground is concerned, it is incorrect to say that the date of reconstruction could be the same as the date of notification because it does not take into account the period of implementation of the reconstruction. The second reason is contrary to the RBI Act that merely because the scheme was notified, the administrator cannot exercise any powers,\" said Rohan Dakshini, a lawyer representing Yes Bank and a partner at law firm Rashmikant and Partners. “The court’s observation on the deletion of the provision of the write-down from the final scheme makes no difference to the exercise by the bank of its contractual rights,\" he added. Following the Bombay high court ruling, bondholders of Lakshmi Vilas Bank also plan to seek an urgent hearing in the Madras high court against the RBI’s decision to write off tier-II bonds worth  ₹320 crore, as the government’s approved merger scheme also does not mention write-downs for these bonds. Elsewhere in Mint In Opinion, Manu Joseph says it’s a wonder what most Indian politicians actually do. CM Eknath Shinde writes Mahrashtra was a magnet for investment MoUs at Davos. L. Viswanathan & Madhav Kanoria explain how govt's proposals will strengthen insolvency code. Long Story tells how to explain the budget to your grandma.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/we-want-to-maximize-hni-retail-interest-in-adani-fpo\/amp-11674407211222.html","pub_date":"2023-01-22T22:36:50+05:30","title":"‘We want to maximize HNI, retail interest in Adani FPO’","keywords":"Adani Enterprises,fpo,sale,adani cfo,retail investors,Adani FPO","articles":"Adani group has been running investor outreach programmes for 3 years, says group CFO  Adani Enterprises Ltd, the flagship of the diversified Adani group, is exploring ways to garner maximum participation from retail investors and high-net worth individuals for its proposed  ₹20,000-crore follow-on public offer, which will be India’s largest so far. Adani Enterprises Ltd, the flagship of the diversified Adani group, is exploring ways to garner maximum participation from retail investors and high-net worth individuals for its proposed  ₹20,000-crore follow-on public offer, which will be India’s largest so far. “The FPO aims to maximize retail and HNI categories as they are inter-generational investors unlike mutual funds or domestic institutional investors, who have a much shorter horizon for investments,\" said Jugeshinder Singh, chief financial officer, Adani group. “There are some large family offices that can participate as institutions also, so they don’t have to participate as HNI. If they participate as institutions, that gives us more space for HNIs and regular investors, and allows us to have greater HNI and retail participation,\" he said when asked about interest evinced by institutional firms, given the meteoric rise in valuations of Adani Enterprises in the past few years. “The FPO aims to maximize retail and HNI categories as they are inter-generational investors unlike mutual funds or domestic institutional investors, who have a much shorter horizon for investments,\" said Jugeshinder Singh, chief financial officer, Adani group. “There are some large family offices that can participate as institutions also, so they don’t have to participate as HNI. If they participate as institutions, that gives us more space for HNIs and regular investors, and allows us to have greater HNI and retail participation,\" he said when asked about interest evinced by institutional firms, given the meteoric rise in valuations of Adani Enterprises in the past few years. “Having a core infra portfolio, these companies will be massively valuable, but their value accrues over a period of time. If you see Adani Transmission, the value accrued over a nine-year period; we started in 2012. Adani Green, we started incubating in 2011, and the value is now emerging. So we need those kinds of investors,\" he added. To draw retail investors, Adani Enterprises will offer an added discount of  ₹64 per partly paid-up share from the cut-off price. The price range for the FPO, running through 27- 31 January, has been fixed at  ₹3,112-3,276. Mutual funds, he said, had monetized less than 2% of Indian household wealth, allowing the group to potentially access a vast swathe of savings. It has been engaged in domestic investor outreach for the last three years, he said. “We have been running roadshows to reach domestic investors across cities: Delhi, Kolkata and Surat for five years, and next month, we will hit Rajkot to increase their count as shareholders across our group verticals. Our aim is to have 10 million retail investors. I am told by some investors that at the roadshows, they are seeing huge interactions between corporate and domestic investors, decades after what Dhirubhai Ambani would do on outreach programmes for domestic investors.\"  On steep valuations of group companies becoming a roadblock for potential retail investors, Singh said: “High equity valuations imply that people value our growth and this reduces our risk premium, which in turn will boost the value of our utility business.\" “We feel across infra like airports, for one, we can reduce tariffs and compete with the best like in Sydney,\" he added. After the  ₹20,000-crore proposed FPO, retail investors’ holding in Adani Enterprises will increase from around 1.4% to over 3%, while promoter shareholding will drop by 3.6 percentage points. Adani Enterprises’ shares have soared 174% from their 52-week lows in less than 10 months to  ₹4189.55 on 21 December. The stock has since corrected to  ₹3,456 apiece on 20 January. On why brokerages avoid including Adani group companies in their coverage universe, Singh said utility businesses are not tracked widely by analysts. But, this would change with time, he added. The follow-on public offer will see the group invest  ₹10,869 crore for capital expenditure requirements of the company’s subsidiaries in the green hydrogen ecosystem projects, existing airports and for construction of a greenfield expressway, while  ₹4,165 crore will be used to repay debt either partly or fully as well as for three subsidiaries—Adani Airport Holdings Ltd, Adani Road Transport Ltd, and Mundra Solar Ltd. The rest will be used for general corporate purposes, according to the offer document.  The group is also confident that its green hydrogen business will be operational in four years. “We are confident that by 2026, hydrogen will be at an operating cost of 25-30 cents. Depending on the rate of return requirement, we will sell it for between $1.80 and 2.30 a kg, which is lower than India’s LNG import cost. So, already it will compete without any government subsidy,\" said Singh. The group has invested $1.6 billion in the hydrogen ecosystem and has signed a memorandum of understanding with French energy major Total. It will be investing 25% equity in the business, he said. The Adani group is also looking at various partnerships for the airport business, he added.  “We have entered a joint venture in the duty-free area. In airports, you have specific elements that address a specific consumer base, and we are looking at other JVs in fuel services and public entertainment space, among others,\" Singh said.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/ongc-totalenergies-plan-joint-venture\/amp-11674406803927.html","pub_date":"2023-01-22T22:30:03+05:30","title":"ONGC, TotalEnergies plan joint venture","keywords":"ongc,totalenergies,jv,Oil and gas exploration,Andaman islands,Open Acreage Licensing Programme","articles":"Talking of the tie-ups and joint ventures, Rawat said apart from Total, the company is also looking for tie-ups with other major players in exploration and production, as well as carbon capture, among others  State-run energy major ONGC plans to tie up with French giant TotalEnergies for exploration and production of oil and gas in the Andaman islands, said Sushma Rawat, director, exploration at ONGC Ltd. In an interview, Rawat said that prospective hydrocarbon blocks are expected to be auctioned at the next round of auctions under the Open Acreage Licensing Programme for which both companies may bid as a joint venture. State-run energy major ONGC plans to tie up with French giant TotalEnergies for exploration and production of oil and gas in the Andaman islands, said Sushma Rawat, director, exploration at ONGC Ltd. In an interview, Rawat said that prospective hydrocarbon blocks are expected to be auctioned at the next round of auctions under the Open Acreage Licensing Programme for which both companies may bid as a joint venture. “For deepwater, talks are underway with Total. Andamans, which is coming up, is mostly deepwater. The government has an Island Exploration Project, a lot of seismic data is being acquired in the Andamans which will be processed and analysed. Within a month we will know whether Total would be coming there with us and in what way. With Total we still have to sign an MoU. The talks are in the final stages,\" she added. “For deepwater, talks are underway with Total. Andamans, which is coming up, is mostly deepwater. The government has an Island Exploration Project, a lot of seismic data is being acquired in the Andamans which will be processed and analysed. Within a month we will know whether Total would be coming there with us and in what way. With Total we still have to sign an MoU. The talks are in the final stages,\" she added. While the initial survey is being done by the Centre, she said the blocks would be up for auction either through the open acreage licensing policy (OALP-XI) round of auction or there may be a separate round for deepwater exploration and production. “We have prepared the blocks, we need to submit them,\" she said. The Centre has been ambitious with the National Island Exploration Project, seeking to reduce its import dependence for crude oil in a volatile global market scenario. Talking of the tie-ups and joint ventures, Rawat said apart from Total, the Maharatna company is also looking for tie-ups with other major players in exploration and production, as well as carbon capture, among others. “For international partnerships we had a global outreach programme, which was initiated 2-3 years ago by the then chairman-managing director of ONGC. In that area we have gone ahead, and held a lot of technical discussions and four MoUs have been signed right from ExxonMobil to Equinor to Chevron and all. So, we are looking forward to tie ups with Total and others right from exploration and enhanced oil recovery to carbon capture and renewables.\" In August 2022 ONGC signed an agreement with American oil and gas major ExxonMobil for deepwater exploration at India’s east and west coasts. The tie-up is expected to firm up by March-end, she said. “ExxonMobil (contract) is totally (for) deepwater. They have been looking at the data both at the east cost and west coast. They will let us know at the end of March, when their entire study is complete, and identify areas they would like to go for acreage bidding, or may be it will be a joint venture with ONGC,\" she said. She further said: “We are looking at joint venture between ONGC and ExxonMobil. Right now the technical teams are sitting together and analyzing the data we processed. With ExxonMobil its little bit ahead in terms of but they have given their timeline as March end for them to decide, whether they will come in for a partnership for bidding and exploration.\" Rawat added that ONGC is likely to announce a partnership with French company IFP in a month’s time for technical domain, software model building and interpretation in order to reduce uncertainty and assure risk management. Speaking on company pilot project for carbon capture, utilization and storage (CCUS) for which ONGC has tied up with Norwegian state-owned energy company Equinor, the director (exploration) said that both the companies will discuss the timeline for the project, required investment and if other players need to be involved in the project. She also said that talks are underway with Indian Oil Corporation Ltd (IOCL) for the procurement of carbon dioxide from the company and the required investment amount would depend upon the cost for carbon dioxide procurement. “We want to take in carbon dioxide and pump it underground, store it in the field which has been producing for a very long time now. So, that is Gandhar in the Cambay basin. For that we have a tie up with the Equinor. They have their project Northern Lights in the North Sea. We would be requiring carbon dioxide from Indian Oil Corporation. For them it is a waste product that we will pump in into the reservoir.\"","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/automation-to-pick-up-pace-during-recession-shukla\/amp-11674406395835.html","pub_date":"2023-01-22T22:23:15+05:30","title":"Automation to pick up pace during recession: Shukla","keywords":"Automation Anywhere,Mihir Shukla,automation,RPA,robotic process automation,ChatGPT,recession","articles":"India has been a great source of talent and innovation for us and it continues to be. We are strengthening our place in India with two R&D centres in Bengaluru and Baroda, said Shukla  After covid-led business disruptions prompted firms to turn to robotic process automation, or RPA, robotics solution providers are expecting another wave of mass adoption on the fear of a recession, and resultant layoffs. Mihir Shukla, chief executive, Automation Anywhere Inc., a US-based RPA solutions company, believes it will play a key role for firms and sectors due to its speed and scale. After covid-led business disruptions prompted firms to turn to robotic process automation, or RPA, robotics solution providers are expecting another wave of mass adoption on the fear of a recession, and resultant layoffs. Mihir Shukla, chief executive, Automation Anywhere Inc., a US-based RPA solutions company, believes it will play a key role for firms and sectors due to its speed and scale. In an interview, Shukla spoke about how firms are adopting automation, disruptive role of platforms like ChatGPT and more. Edited excerpts: In an interview, Shukla spoke about how firms are adopting automation, disruptive role of platforms like ChatGPT and more. Edited excerpts: We heard about Automation Anywhere’s IPO plan. Has it been delayed? We are growing fast, creating a very compelling product on cloud automation, which is being used by more than 70% of our new customers. We are very excited with the business we’re building and will look for an opportune moment to float our public offer. Your key markets are North America and Europe but have you seen faster growth in India after the covid-19 led digital transformation wave? India has been a great source of talent and innovation for us and it continues to be. We are strengthening our place in India with two R&D centres in Bengaluru and Baroda. We are seeing growing interest from local enterprises in adopting automation. With well-known brands in India scaling their businesses, they find a need for speed and scale. We are seeing some large private banks, oil and gas companies adopting and scaling automation, and are seeing traction in healthcare, telecom, and manufacturing in India, and a great deal of interest from governments. Has the economic crisis impacted the adoption of automation? Because of speed and scale automation is the solution to turn to in a time of recession and inflationary pressures, as we all are experiencing. I think you will have seen this in past recessions as well. You will see even faster adoption of automation across all enterprises. What are your plans in India in terms of hiring and investments? We are strengthening our teams in India:R&D and to serve enterprises. Over 50% of our global workforce sits in India and that speaks for itself. The team has led the work on some of the most cutting-edge products we have launched recently. Many firms are working on integrating ChatGPT into their services. Will it become mainstream soon? Most technologies start as entertainment initially. Technologies that have capabilities like ChatGPT will become more and more mainstream. ChatGPT is an example of where we are going and what’s to come. AI can be a great tool to answer questions. I think one of the things we as humans will have to get better at is thinking about what are the right questions. There is no AI software in the world that can tell you what the right question is.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/commodity-prices-may-be-range-bound-in-23-jsw-cfo\/amp-11674406188924.html","pub_date":"2023-01-22T22:19:48+05:30","title":"Commodity prices may be range bound in ‘23: JSW CFO","keywords":"JSW,Steel,domestic prices,Seshagiri Rao,commodity prices,earnings","articles":"JSW Steel Ltd’s net profit plunged 90% in the December quarter from a year earlier, and the earnings also trailed analysts’ expectations  JSW Steel Ltd’s net profit plunged 90% in the December quarter from a year earlier, and the earnings also trailed analysts’ expectations. However, Seshagiri Rao, joint managing director and group chief financial officer, said a sequential analysis would do more justice to the financial performance. JSW Steel Ltd’s net profit plunged 90% in the December quarter from a year earlier, and the earnings also trailed analysts’ expectations. However, Seshagiri Rao, joint managing director and group chief financial officer, said a sequential analysis would do more justice to the financial performance. “The results have to be seen in the context of Q3 versus Q2, rather than year-on-year because last fiscal year was an aberration,\" he said in an interview. “Last year, steel prices were very high, and raw material price increase took some time to catch up, resulting in exceptionally robust margins posted by steel companies. However, the current year saw steel price corrections post-May, and margins also got normalized.\"  “The results have to be seen in the context of Q3 versus Q2, rather than year-on-year because last fiscal year was an aberration,\" he said in an interview. “Last year, steel prices were very high, and raw material price increase took some time to catch up, resulting in exceptionally robust margins posted by steel companies. However, the current year saw steel price corrections post-May, and margins also got normalized.\"  “We have booked inventory losses in Q1 and Q2 of this fiscal year, and added to that, the rupee has depreciated from 75 to 82 to a dollar. Therefore, a quarter-on-quarter comparison will be appropriate,\" he added.  After reporting a loss of  ₹915 crore in the September quarter, the company posted a net profit of  ₹474 crore in Q3 compared to  ₹4,516 crore a year earlier. “It is a big turnaround with a swing of almost  ₹1,400 crore,\" Rao said.  The sequential rise was helped by the highest-ever production for JSW Steel, besides a bigger share of business in the automotive sector at 33% on the back of record domestic vehicle sales. Steel dispatches to makers of tinplate, appliances, and wind and solar energy have also increased.  Nevertheless, despite good domestic volumes, JSW Steel’s inventories rose to 180,000 tonnes in Q3, primarily due to a steep drop in exports, which fell by 32% and accounted for 7% of production. Consequently, total sales volume was lower by 2% sequentially.  Rao said JSW Steel’s financial turnaround on a sequential basis was made possible by a reduction in costs by  ₹7,900 per tonne, which improved earnings before interest, taxes, depreciation and amortization (Ebitda) per tonne from  ₹3,460 in Q2 to  ₹8,150 in Q3. The performance of its units also improved compared to Q2 from  ₹10 crore to  ₹517 crore, resulting in consolidated Ebitda rising to  ₹4,547 crore, he added. Rao expects steel demand to stay robust in Q4, as is normally the case in the last quarter of a financial year. The auto sector typically sees an uptick in sales in Q4, compared to Q3, and state governments also have more budgets. That apart, higher agriculture-related capex and increased activities for residential real estate would result in more demand for construction equipment as well as compressors, textile machinery, paper machinery, and wagon and locomotive manufacturing, which will boost demand for steel, he added.  Steel demand in Q3 was 30 million tonnes, which Rao expects to grow by two million tonnes in Q4, taking total demand to 118 mt for FY23, up 11%. Exports may also improve due to the rollback of duty in November and the easing of covid policy in China, resulting in the restocking of material globally.  “Prices have become attractive for exports, and removal of export duty will help us compete in international markets,\" Rao said. Indian steel prices are at a 6% discount to imports, which may lead to price hikes for domestic steel.  Rao, however, said commodity prices would remain range bound in 2023. “The rate hike cycle in the global economy is likely to continue though the pace may reduce. Inflation in Europe and the US is very high, and inflation targeting remains at 2%. Debt-to-GDP ratio in many countries is also very high, and so we are not very optimistic about global demand recovery,\" said Rao.  The only area for all the triggers is from China opening up. “Commentary coming is that the Chinese government is more focused on consumption-led growth than investment-led growth. Prices have improved in China and Europe, in the US, too, compared to November; however, they are still down from the highs in March-April,\" Rao added.  With raw material prices rising from the lows in November, Rao said coal and iron ore prices would not sustain. Most steel companies have announced capex and expansion plans to meet demand in the domestic market. JSW Steel, too, is increasing capacity by 10mt. Out of the capex allocation of  ₹49,000 crore,  ₹15,000 crore will be spent in FY23, and  ₹34,000 crore over the next two years, said Rao.  Meanwhile, JSW Steel is scouting for more iron ore mines and will participate in auctions. It is investing in iron ore beneficiation plants in Odisha and slurry pipelines to cut the cost of transportation to ports. Rao said JSW Steel’s units would perform better in the March quarter. He said carrying forward of coking coal inventory from Q3 to Q4 will ensure that there won’t be any impact of the current spike in coking coal prices.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/people\/travel-biz-recovery-to-pick-up-in-2023-says-thomas-cook\/amp-11674405728686.html","pub_date":"2023-01-22T22:12:08+05:30","title":"Travel biz recovery to pick up in 2023, says Thomas Cook","keywords":"teavel,aviation industry,menon,thomas cook,G20 summit","articles":"Aviation industry is grinding through a shortage in supply of new aircraft, and many airlines have not returned to their full seat capacity. These factors have driven up fares, but Menon expects fares to fall towards the end of the year  As concerns about a severe recession in the West recede, India’s travel business will recover stronger than before in 2023 on the back of high domestic travel demand, recovery in business travel and India’s hosting of the G20 summit, said Madhavan Menon, chairman and managing director, Thomas Cook India Ltd. As concerns about a severe recession in the West recede, India’s travel business will recover stronger than before in 2023 on the back of high domestic travel demand, recovery in business travel and India’s hosting of the G20 summit, said Madhavan Menon, chairman and managing director, Thomas Cook India Ltd. “India’s travel recovery has stood out globally at an economic level and that is very visible in our industry also. People are going to continue to take holidays,\" Menon said in an interview. “India’s travel recovery has stood out globally at an economic level and that is very visible in our industry also. People are going to continue to take holidays,\" Menon said in an interview. Aviation industry is grinding through a shortage in supply of new aircraft, and many airlines have not returned to their full seat capacity. These factors have driven up fares, but Menon expects fares to fall towards the end of the year. On the other hand, hotel rates will be set by supply and demand. Globally, they may settle down only after the second quarter of the new fiscal year. “Domestic demand, though, is huge in India, especially in locations like Goa, Rajasthan and Kashmir. Even city hotels are exhibiting high prices and the domestic demand, both tourism and business-linked, will continue to stay high,\" said Menon. Fairfax-owned Thomas Cook India was earlier focused heavily on European travel in terms of international outbound leisure tourism, but today, Asia and domestic travel dominate its business, with Europe re-emerging and the US expected to re-emerge later. Menon is confident that for long-haul travel too, this year will be better than last when it suffered due to visa issues, capacity caps and high airfares. “Covid changed the way we viewed the customer. We value them much more than we did before. There is a so-called “new customer\" who had never transacted with us before. We discovered a younger generation approaching us, and this was partly aided by the fact that we updated our technology and made it an omni-channel approach,\" added Menon. Earlier, only about 4% of the company’s transactions happened digitally. Today, that number has grown to 14%. It intends to take these up to 35%. India’s presidency of the G20 could also add to hotel demand, for which the company is providing services to the government. While Menon did not comment on how much he expects the government to spend, industry estimates peg it at  ₹900-1,200 crore.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/pleasantly-surprised-with-quality-of-indian-merchandise-authentic-brands-stupp\/amp-11674403626290.html","pub_date":"2023-01-22T22:00:14+05:30","title":"Pleasantly surprised with quality of Indian merchandise: Authentic Brands’ Stupp","keywords":"Authentic Brands,Walt Disney,Reebok,Brooks Brothers,Nautica,Forever21","articles":"Identifying the right collaboration partners is key to our India strategy. The demand for Indian fashion is increasing, and we’re seeing it, Stupp said  MUMBAI :Authentic Brands Group, the world’s second-largest brand owner and licensor globally after Walt Disney, sees India as a significant market for licensing its brands, including Reebok, Brooks Brothers, Nautica, and Forever21, to retailers. The group is scouting for more partners across retail, wholesale and manufacturers and is hoping to collaborate and take some Indian brands to global markets, too, said Henry Stupp, president of India and EMEA at Authentic Brands. In an interview, he spoke about opening an office in India and why it’s an exciting market. Edited excerpts: MUMBAI :Authentic Brands Group, the world’s second-largest brand owner and licensor globally after Walt Disney, sees India as a significant market for licensing its brands, including Reebok, Brooks Brothers, Nautica, and Forever21, to retailers. The group is scouting for more partners across retail, wholesale and manufacturers and is hoping to collaborate and take some Indian brands to global markets, too, said Henry Stupp, president of India and EMEA at Authentic Brands. In an interview, he spoke about opening an office in India and why it’s an exciting market. Edited excerpts: Are you looking at opening an office in India? Are you looking at opening an office in India? Yes, very soon, probably within the year. The idea is to always identify the best-in-class partners, whether they’re wholesalers, manufacturers or retailers. And once they’re identified, we have to remain engaged constantly. We want to understand their business. We want to be the connective tissue, bringing a wholesaler to a retailer and introducing the retailers to our licensing partners. You just can’t do that remotely. You have to be in the markets, and we’re seeing a lot of success in putting in-country managers and country teams in certain markets. And dotting the i’s and crossing the t’s has been a very, very effective way of working. What kind of opportunity do you see here? We have about 15 partners in India, and are still in the early stages. While these are some exceptional partners, we need to do a lot more. We probably have tripled the number of partners in 12 months, but many of our brands still haven’t been licensed. We’re still in the process of identifying the right partners, whether they’re wholesalers or retailers. And so I’m spending more and more time here. This is my third trip here in the last 12 months, and I’ll be back again in March. Identifying the right brands or collaboration partners is going to be critical to our India strategy. The demand for Indian fashion is increasing, and we’re seeing it. I think, eventually, it’s going to break through into many other global markets. So when we look at our brands like Brooks Brothers, there should be an Indian component. It should be designed in India and probably produced here. And then there’s the whole opportunity of doing Indian collaborations with our brands to make them relevant for each market. That’s sort of the strategy that we’re planning on following. And then, to be honest with you, I think that in time, there will be brand opportunities that will come out of India that we’ll want to introduce to other parts of the world. Will you be looking to take Indian brands to other markets? Absolutely. I have a very simple belief that a good product should be accessible to anyone, anywhere, anytime. What is your view of manufacturers in India? I’ve watched the evolution of the manufacturing base in India get better and better each and every year. I have not left without being pleasantly surprised on my last few trips about the quality of the merchandise being produced, and I’m excited to see where you’re going to be in the coming years. Certainly, the government is encouraging domestic manufacturing through some of the new importation rules that have been put in place that should allow the domestic industry to catch up to other markets. You have the technology, labour force, and natural resources. It’s just a matter of time before I think that it will continue to grow. The interesting thing is, will the rise of domestic manufacturing and the affluence associated with it result in more Indian goods remaining in India, which is what we saw in China. For Authentic Brands, where does India stand? India is an emerging market for us, and that’s why I felt that it was an incredible opportunity for me to be able to work in India and take a view of working on developing a strategy that’s unique for India. There are also important lessons to be learnt from other emerging markets, including the Gulf, North Africa, and Sub-Saharan East Africa, and shared between all these different regions. I look at what Authentic Brands is doing in Turkey, which has some of the most amazing dynamic operators and is able to take good lessons learned and introduce them to other markets. It’s actually one of the more exciting parts of my job. And how big is the luxury brands market in India? Data says it’s about $5 billion today in retail value, and it’s anticipated to grow 10 to 12% a year, which is slightly ahead of your GDP, which I think is running about 8% right now. So it is a very, very resilient category. It’s highly sought after, and in the overall scheme of things, even though $5 billion is a significant market, it’s still a small piece, and that’s why it retains such resiliency. Who are your big partners in India? Reliance, Aditya Birla, Myntra, Flipkart, and KG Denim are a few of our partners here. I believe we have a good group of partners. What is your view on the regulatory environment regarding the retail sector in India? Every country has challenges in one way or another. I think that India is moving in a direction to address it. What is really going to drive changes in legislation is how technology is going to lead to more organised retail, where right now, it’s still highly unstructured. I think the current statistics show that only 10% of Indian retail is structured. That will change, and we’ve seen that happen in North Africa, East Africa, and many other markets. Technologies will lead to consolidation as it brings better value to the consumers, so that’s a natural evolution in all markets. And technology will drive it towards fewer, bigger and better retailers. How big is counterfeit as a challenge? It’s obviously a very big challenge, one we deal with on a daily basis. It’s also true that when you’re not being knocked off, you know, where’s your brand heat? Having said that, I don’t personally know what size it is. I don’t think it is material for our portfolio, particularly in this part of the world where we’re still growing, you know. We have recently come across counterfeit merchandise of Reebok, Nautica, Brooks Brother, as well as Juicy Couture, and so we are dealing with it. As the brand heat grows, we see more and more counterfeits in the market. The easiest way of addressing counterfeit merchandise is to make sure that you have a good supply chain. That is the number one way of stopping it. Have supply chains improved now after the pandemic? The pandemic led to shortfalls in the lack of availability of certain components, but that was not just for our industry. Look at the automotive industry in Europe; you can’t get computer chips. They’re selling cars now in Europe, where you have to come back six months later to get your navigation system installed. We faced unavailability of components, factory closures etc. Now the impact on fuel prices is something that’s going to be sitting right in front of us. With China reopening, it is going to lead to increasing capacity, which is good news, but it is also going to drive up fuel demands because China being shut down really kept fuel prices, on a global basis, largely under control.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/diesel-engines-will-dominate-trucking-biz-until-next-decade\/amp-11674403045798.html","pub_date":"2023-01-22T21:36:21+05:30","title":"‘Diesel engines will dominate trucking biz until next decade’","keywords":"cummins india,ICE,internal combustion engines,hydrogen-IC engines,fuel cells,biofuels,natural gas","articles":"The company believes that diesel engines and flex-fuel options that use biofuels, blended ethanol and natural gas will remain dominant as India transitions to fully green technologies.  NEW DELHI :Cummins India, a maker of diesel internal combustion engines, believes that while alternative fuel technologies such as hydrogen-IC engines and fuel cells could help the trucking sector go green, they won’t be adopted widely until the next decade due to significant infrastructure requirements. NEW DELHI :Cummins India, a maker of diesel internal combustion engines, believes that while alternative fuel technologies such as hydrogen-IC engines and fuel cells could help the trucking sector go green, they won’t be adopted widely until the next decade due to significant infrastructure requirements. The company believes that diesel engines and flex-fuel options that use biofuels, blended ethanol and natural gas will remain dominant as India transitions to fully green technologies. The company believes that diesel engines and flex-fuel options that use biofuels, blended ethanol and natural gas will remain dominant as India transitions to fully green technologies. The company is investing in building electrolyzers in India to generate green hydrogen for hydrogen fuel cell vehicles and fuel-agnostic platforms for Indian commercial vehicle makers as they transition to emissions-free technologies between 2040 and 2050, Ashwath Ram, managing director of Cummins India, said in an interview. “Ninety-nine per cent of everything we sell in India today is diesel-powered, and about 1% utilizes natural gas. Between now and 2030, we think that the CNG, LNG, biofuels and blended ethanol fuels could probably get to as high as 15%, and about 85% will continue to be with diesel, but between 2030 and 2040, we think the percentage of all those other fuels, including hydrogen, can go to 30%, and then in the 2040 to 2050 timeframe, we think we can get to 50:50. For a country like India, the time between 2050 and 2070, which is when we have committed to achieving net zero-carbon emissions, the remaining portion will also convert to green fuels\", Ram said. “The way we think about destination-zero is that it will not be a cliff event but a gradual journey towards zero. And our concern is what we can do today. In this decade, we are cleaning up the technologies. We are making our products more efficient and introducing several other platforms, such as LNG, CNG, biofuels and blended mixes with ethanol.\" According to Ram, it will take at least two decades for hydrogen-powered vehicles, particularly fuel cells, to gain wide adoption in India due to challenges such as lack of green hydrogen availability and storage, high cost of hydrogen IC-engines and fuel cell technologies, and regulatory bottlenecks. “Hydrogen storage and transport regulation in India says that 350 bar is the maximum pressure at which tanks can be used for hydrogen transportation. Around the world, the standard has already moved to 700 bar. When you move from 350 to 700 bar, you can store double the amount of fuel because it’s pressurized,\" Ram said. “So this regulation will have to change, and it will, as the world has already changed to that standard.\" Secondly, storage tanks for hydrogen are currently not built locally. “These tanks are built from carbon fibre. We need a supply of carbon fibre, which is produced by only a few companies in the world. It’s not produced in bulk volume in India as of now; so that infrastructure needs to be set up,\" Ram said. Additionally, hydrogen production for mobility will have to ramp up. “Today, most of the hydrogen produced is used up in the petrochemical processes to produce ammonia and decarbonize steel. So, where is hydrogen available for use in the mobility space? The industry will have to start generating excess hydrogen just for mobility. Besides this, all hydrogen being produced today is what’s called grey or blue hydrogen right out of the petrochemical process. It’s not green hydrogen, which solves only part of the problem of zero-emissions, not the complete problem\", Ram said, adding that Cummins is also setting up electrolyzers in India to produce green hydrogen. Lastly, hydrogen-IC engines currently cost roughly twice that of a comparable diesel engine, while a fuel cell vehicle comes with nearly five times the cost today. “There is a huge catch-up between where fuel cells are from a cost perspective, to where hydrogen ICE can get to quickly. We see that hydrogen-IC engine is a strong bridge for India and can be a dominant technology for 25-30 years before fuel cells become viable,\" he said.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/turbulence-at-go-first-spicejet-may-continue\/amp-11674402658943.html","pub_date":"2023-01-22T21:26:49+05:30","title":"Turbulence at Go First, SpiceJet may continue","keywords":"gofirst,spicejet,airlines,indigo,vistara,go first,aviation","articles":"Lack of  funds key hurdle as airlines weather a long  crisis that has spilled over into 2023  NEW DELHI :The prolonged air travel disruption caused by the pandemic has taken a heavy toll on airlines, especially two of India’s oldest budget carriers, Go First and SpiceJet, which lacked the funds to weather a long crisis period. NEW DELHI :The prolonged air travel disruption caused by the pandemic has taken a heavy toll on airlines, especially two of India’s oldest budget carriers, Go First and SpiceJet, which lacked the funds to weather a long crisis period. Go First and SpiceJet started flight operations in 2005, followed by the market leader, IndiGo, in 2006. As of 2022, IndiGo holds the largest share of the domestic market at 56.1%, followed by Vistara at 9.2%, Go First at 8.8%, and Air India and SpiceJet tied at 8.7% each. Go First and SpiceJet started flight operations in 2005, followed by the market leader, IndiGo, in 2006. As of 2022, IndiGo holds the largest share of the domestic market at 56.1%, followed by Vistara at 9.2%, Go First at 8.8%, and Air India and SpiceJet tied at 8.7% each. “The shutdown of air travel and resultant weak travel sentiment during 2020-21 has had a more severe impact on the airlines which did not have enough liquidity to deal with long periods of low revenue environment. Clearly, SpiceJet and Go First have been affected and need fund infusion to maintain course,\" an industry executive said, requesting anonymity. Supply chain challenges further compounded their struggles last year, leading to delayed delivery of engines and aircraft parts. Go First, for example, only received its 55th fuel-efficient Airbus A320neo aircraft after a delay of almost one-and-a-half months. Despite having a fleet of 60 planes, including 5 Airbus 320ceos, 20-25 of its planes were grounded in the last three months due to engine and parts shortages. “Pratt & Whitney had provided 17 serviceable engines in December, and we could make eight aircraft serviceable. Similarly, we expect 20 serviceable engines by February-March,\" said a Go First spokesperson. “We are in the process of taking delivery of eight new aircraft from Airbus from January to June, which will take the fleet to 68.\" The spokesperson said the airline would add a new aircraft in two days. While Go First has so far availed loans of around  ₹590 crore under the Emergency Credit Line Guarantee Scheme 3.0 (ECLGS), its proposed  ₹3,600-crore initial public offering has been delayed. The airline is evaluating the opportunity for an IPO from time to time and will be ready to take steps, the spokesperson said. SpiceJet has also been experiencing a host of issues, including delays in the induction of MAX aircraft and fundraising. The separation and stake sale in its profitable arm SpiceXpress has faced several hurdles. “They are trying to raise capital by hiving off cargo and possibly raising funds from strategic and financial investors. Without funding, frankly, there is no game, and they realise it,\" Kapil Kaul, chief executive and director of Centre for Aviation, said. Out of its fleet of 68 aircraft, 25 have not been in operation for seven days, leaving an operational fleet of 43 planes. Lack of funds is also impacting the airline’s ability to expand operations. In January-November, SpiceJet flight departures stood at 82,512, down 47% from the same period in 2019, while for Go First, flight departures fell 22.5% to 66,740 flights. IndiGo departures in the same period were at 452,798 flights, up 6% from 2019. For Vistara, flight departures in the period were 48% more than in 2019, or pre-covid levels at 72,615 departures. 2023 will be a year of intense competition between IndiGo and the Tata-run Air India group airlines. However, the situation will be even more crucial for SpiceJet and Go First to accelerate their fund infusion process, an aviation industry analyst said, requesting anonymity.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/microsoft-faces-the-highest-bar-in-tech\/amp-11674401989098.html","pub_date":"2023-01-22T21:22:50+05:30","title":"Microsoft faces the highest bar in tech","keywords":"Microsoft,Tech","articles":"Plan to lay off 10,000 workers shows pressure company faces to keep margins high  Microsoft might be planning to do more with less. Investors expect it to do a lot more.  Microsoft might be planning to do more with less. Investors expect it to do a lot more.  The software giant is heading into its second fiscal quarter earnings report on Tuesday facing a slumping PC market, a slowing corporate software market and even unclear demand for its once-hot cloud computing services.  The software giant is heading into its second fiscal quarter earnings report on Tuesday facing a slumping PC market, a slowing corporate software market and even unclear demand for its once-hot cloud computing services.  Microsoft’s dim forecast three months ago gave investors an early heads-up, and its plan to join other big techs in a recent layoff wave seemed to drive the point home further. “We will have to do more with less,\" Chief Executive Satya Nadella told the World Economic Forum in Davos, Switzerland, last week, before the company announced plans to cut 10,000 jobs from its payroll.  That would appear to set a low bar for the coming report. Analysts estimate that Microsoft’s revenue for the December quarter grew only 2.7% year over year to $53.1 billion—the company’s lowest growth rate in nearly six years. Growth for the company’s crucial Azure public cloud service is expected to hit a record low 30.5% year over year—a deceleration of nearly 5 percentage points from the September quarter.  Revenue in the personal-computing segment that includes the Windows business is expected to slide 14% year over year—a sharp reversal from the 15% growth logged in the previous year’s December quarter, when the company was still benefiting from the pandemic-induced PC sales boom.MINT PREMIUMSee All\n  Microsoft’s forecast for the March quarter and its outlook for the rest of the year will prove essential. Wall Street expects growth to pick back up in the second half of the calendar year. More crucially, Microsoft is expected to maintain annual operating margins above 40%—the highest among the big tech peers including Apple, Amazon.com and the parent companies of Google and Facebook. Wall Street’s projected operating margin of about 41% for Microsoft in calendar year 2023 is nearly 5 percentage points higher than what the company averaged over the five-year period running from 2017 to 2021 and is a much larger margin improvement than what the other four big techs are expected to show over the same period. Can the company pull that off? Maybe. Corporate tech officers are indeed cutting back their spending plans; Gartner projected that worldwide IT spending will grow 2.4% this year—less than half the growth rate the market research firm predicted three months ago. Microsoft is still in a prime position given that it runs the second-largest public cloud service and owns many of the software tools and applications that are still central to business life. A recent survey by Morgan Stanley found that 38% of chief information officers rank Microsoft’s Azure as their preferred cloud provider, compared with 31% for Amazon’s larger AWS service. But Microsoft still has a lot of exposure to the PC market, which is in free fall. IDC reported earlier this month that PC unit sales slid 28% year over year in the fourth quarter—the biggest drop that the market research firm has seen in years—and doesn’t expect recovery for the industry until 2024. Analyst John DiFucci of Guggenheim downgraded Microsoft to a sell rating on Jan. 17, citing both the PC slowdown and Microsoft’s strong exposure to small businesses, which he says “typically fare worse than enterprises in a macro slowdown.\" Even cutting 10,000 workers might have a limited impact. That is only one-quarter of the employees Microsoft added in the fiscal year that ended in June 2022, which included the company’s acquisition of Nuance Communications. In his email to employees announcing the layoffs, Mr. Nadella made clear that “we will continue to invest in strategic areas for our future,\" which includes the adoption of potentially expensive AI technology like ChatGPT across the company’s products. Microsoft’s highly successful transition into a cloudcentric company has deservedly earned it the faith of investors. Its ability to maintain high margins in the face of a possible recession will test that faith. This story has been published from a wire agency feed without modifications to the text","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/homeowners-struggle-to-get-pandemic-aid-meant-to-stop-foreclosures\/amp-11674397570205.html","pub_date":"2023-01-22T20:05:33+05:30","title":"Homeowners struggle to get pandemic aid meant to stop foreclosures","keywords":"Homeowners,Pandemic","articles":"The $10 billion Homeowner Assistance Fund has been slow to distribute funds  Peter and Nancy Rosalez found out in November they were eligible for up to $25,000 in government money to keep from losing their house to foreclosure.  Peter and Nancy Rosalez found out in November they were eligible for up to $25,000 in government money to keep from losing their house to foreclosure.  But their mortgage company had gotten permission to foreclose on their Middletown, Ohio, home and was about to sell it. The money sat unused while an auction of the home went forward.  But their mortgage company had gotten permission to foreclose on their Middletown, Ohio, home and was about to sell it. The money sat unused while an auction of the home went forward.  “The mental anguish we’ve been through with this house and trying to save this house—it’s just been ridiculous,\" Mrs. Rosalez said.  The federal government allocated funds for distressed homeowners as part of its expansive efforts to help Americans cope with the pandemic’s financial strains. Unlike some other stimulus programs, such as checks mailed to individuals, this money moved slowly.  The nearly $10 billion Homeowner Assistance Fund was administered through the U.S. Treasury Department, but relied heavily on individual states to set up programs to distribute aid. Some were slow to get up and running. Others struggled with a backlog of applications. For homeowners, getting money before the foreclosure went through could be a race against time.  The money ultimately came through for Mr. and Mrs. Rosalez, but it came down to the wire. Expecting to be forced out of their home, the couple had packed up their belongings.  “The homeowner shouldn’t be fighting on two battlefronts,\" said Jim Kowalski Jr., chief executive officer of Florida’s Jacksonville Area Legal Aid Inc. That was common during the previous financial crisis, when millions lost their homes, he said. “You learned this lesson.\"MINT PREMIUMSee All\n  The fund doled out about $2 billion to more than 150,000 households through the end of September, according to the National Council of State Housing Agencies, a trade group. The money serves a narrow slice of the population: There were some 324,000 foreclosure filings last year, below prepandemic norms but more than double 2021, according to real-estate data firm Attom. The funds were made available to homeowners who experienced pandemic-related hardships and whose household incomes were below a certain threshold. Most states gave the money as grants. About 200 homeowners have complained about the program through the Consumer Financial Protection Bureau’s complaint portal, including a handful about foreclosures moving forward while they were waiting on assistance. CFPB warned in March that foreclosing on a borrower who has a pending assistance application “will merit increased scrutiny.\" Government officials, as well as representatives of mortgage companies and states, said the assistance program has picked up speed, particularly in recent months, and everyone is working together. Servicers benefit more from taking the money than taking the home in a foreclosure, they said. The program “has already provided much-needed assistance in all fifty states to over a hundred thousand low-income families,\" said Gene Sperling, who coordinates the rollout of the Biden administration’s 2021 relief package, in a statement. Servicers must pause foreclosure proceedings for 60 days when a homeowner with a Fannie Mae or Freddie Mac loan applies for funds. But they don’t have to do so for Department of Veterans Affairs loans and other government-backed mortgages. A group of federal agencies urged servicers to halt foreclosures for pending applications in such cases but stopped short of requiring it. Mr. and Mrs. Rosalez had paused payments on their VA mortgage in 2021 under a Covid forbearance program. Conversations about a loan modification with their mortgage servicer, a unit of MidFirst Bank, didn’t result in a deal, according to Stephanie Moes, their legal aid attorney. The bank filed to foreclose in early August, and a court granted the request the next month. The couple filed an application in early October to Save the Dream, the Ohio program run by the state’s housing-finance agency to distribute homeowner aid. They learned they were eligible for the program in November, just before a scheduled sheriff’s sale of the house. Mrs. Rosalez emailed their eligibility letter to the bank. The sale went ahead and the bank was the winning bidder, which would allow it to evict the homeowners. In late December, Mrs. Rosalez called the bank’s law firm. “If you have a heart, please reinstate us and let us get all this right,\" she said in a message. After The Wall Street Journal contacted MidFirst in early January, the bank asked the court to rescind the foreclosure, which was approved. A spokeswoman for the Ohio Housing Finance Agency said funds are being applied to reinstate their mortgage and cover up to six months of future payments. “Once we learn someone has been approved for HAF, our policy is to take action immediately, including as appropriate initiating the process to rescind foreclosure,\" a spokeswoman for MidFirst said. Defenders of the program say states like New York and Texas are running smoothly. That isn’t the case everywhere, though. William Steinwedel, an attorney at Maryland Legal Aid Bureau, said one of his clients lost his home during a monthslong wait for assistance. In New Mexico, some homeowners are waiting months just to receive confirmation that their applications have been received, according to Eric Sutton, an attorney at the Albuquerque nonprofit United South Broadway Corp. “There are some states that are taking an alarming amount of time,\" said Stacey Tutt, an attorney who coordinates homeowner assistance at the National Housing Law Project. Homeowners who get approved after a lengthy delay might find their unpaid debt has gone up meanwhile, forcing them to use more assistance money to get their loans back on track, Ms. Tutt said. Because the fund has a fixed amount of money, that means less for other applicants. Some haven’t been able to use the money at all. Christopher Elia started the process for homeowner assistance on his Orange Park, Fla., home in April, soon after his mortgage company filed for foreclosure. “I stressed every day,\" Mr. Elia said. “I was afraid to answer the door.\" In October, he was approved for up to $50,000 in assistance. But because of missed payments and the servicer’s attorney fees, he owed more than $54,000 to reinstate the loan. Mr. Elia said he wasn’t able to come up with the additional money. The $50,000 went unused. Marissa Vetter, Mr. Elia’s housing counselor at Jacksonville Area Legal Aid, said she believes he could have used the assistance money if the unpaid debt hadn’t ticked higher while Mr. Elia waited. A spokeswoman for Florida’s Department of Economic Opportunity, which administers the state program, said Mr. Elia took three months to finish his application, delaying the process. Mr. Elia said he submitted his initial application promptly, but additional requests from the state delayed its completion. Weeks would pass in between requests, but he provided information as soon as he could, he said. The spokeswoman for the Florida agency defended its handling of aid applications, saying the state “stretched every available dollar to serve as many homeowners as possible.\" To reinstate his loan, Mr. Elia agreed with the servicer to extend the repayment term from 14 years to 40 with a higher monthly payment. He is hoping to get money from the program to cover some payments on the modified loan. A spokeswoman for Mr. Cooper Group Inc., the parent company of Mr. Elia’s mortgage servicer, RightPath, said the company continues to work with him. Mr. Kowalski, of Jacksonville Area Legal Aid, wrote a letter to federal regulators in November hoping to draw attention to Mr. Elia’s case. “You must do better,\" he wrote. This story has been published from a wire agency feed without modifications to the text","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/layoffs-often-leave-companies-worse-off\/amp-11674394634973.html","pub_date":"2023-01-22T19:12:31+05:30","title":"Layoffs often leave companies worse off","keywords":"layoff,layoff season,amazon layoff,twitter layoff,microsoft layoff,wipro layoff,google layoff,tech industry layoff,meta layoff","articles":"Job cuts alienate customers and sap morale among employees who have to pick up the slack.  Employers these days seem to feel they have plenty of employees — maybe even too many as the economy slows down. That’s what’s driving layoffs of tens of thousands of workers in tech, banking and other industries. Employers these days seem to feel they have plenty of employees — maybe even too many as the economy slows down. That’s what’s driving layoffs of tens of thousands of workers in tech, banking and other industries. But executives should be careful about making deep cuts. Because as the last three years have reminded us, having too few workers is almost always worse than having too many. When organizations are shorthanded, morale plunges and profits suffer. And companies often end up investing immense time and effort to rebuild their workforces not long after whittling them down. But executives should be careful about making deep cuts. Because as the last three years have reminded us, having too few workers is almost always worse than having too many. When organizations are shorthanded, morale plunges and profits suffer. And companies often end up investing immense time and effort to rebuild their workforces not long after whittling them down. “The good companies, whether they’re slightly understaffed or slightly overstaffed, if they’ve got that culture of innovation they will do really well in a recession,\" says Angie Kamath, dean of the New York University School of Professional Studies. It’s less about precise staffing levels and more about factors like product mix and pricing strategy. “The good companies, whether they’re slightly understaffed or slightly overstaffed, if they’ve got that culture of innovation they will do really well in a recession,\" says Angie Kamath, dean of the New York University School of Professional Studies. It’s less about precise staffing levels and more about factors like product mix and pricing strategy. A firm that’s slightly overstaffed should consider what to do with that capacity rather than panicking and jettisoning people they have worked hard to hire. “The research has been incredibly consistent that layoffs are not good,\" Kamath warns, ticking off a host of ills from bad PR to increased turnover among remaining employees. A firm that’s slightly overstaffed should consider what to do with that capacity rather than panicking and jettisoning people they have worked hard to hire. “The research has been incredibly consistent that layoffs are not good,\" Kamath warns, ticking off a host of ills from bad PR to increased turnover among remaining employees. Businesses contemplating job cuts might consider the experience of the retail industry, which for years sought to keep staff levels as lean as possible. Algorithms helped them predict periods of high and low demand and make sure stores had “just enough\" staff at those times — in theory, freeing them from having to employ quite as many workers. Businesses contemplating job cuts might consider the experience of the retail industry, which for years sought to keep staff levels as lean as possible. Algorithms helped them predict periods of high and low demand and make sure stores had “just enough\" staff at those times — in theory, freeing them from having to employ quite as many workers. Yet focusing so much on optimizing worker numbers left stores painfully understaffed during the busiest periods. A 2014 study in the journal Production and Operations Management looked at 41 stores of an (anonymized) large retail chain. The researchers, led by Vidya Mani of University of Virginia’s Darden School of Business, found all 41 locations were chronically shorthanded during peak hours. Adding staff during those times would have resulted in an increase in sales and profitability, the researchers concluded. Yet focusing so much on optimizing worker numbers left stores painfully understaffed during the busiest periods. A 2014 study in the journal Production and Operations Management looked at 41 stores of an (anonymized) large retail chain. The researchers, led by Vidya Mani of University of Virginia’s Darden School of Business, found all 41 locations were chronically shorthanded during peak hours. Adding staff during those times would have resulted in an increase in sales and profitability, the researchers concluded. The problems of understaffing go beyond lost sales, argue Zeynep Ton and Amanda Silver of the Good Jobs Institute, a nonprofit that works with companies in low-wage service industries to simultaneously improve financial performance and job stability. The problems of understaffing go beyond lost sales, argue Zeynep Ton and Amanda Silver of the Good Jobs Institute, a nonprofit that works with companies in low-wage service industries to simultaneously improve financial performance and job stability. The work draws from Massachusetts Institute of Technology professor Ton’s research that shows, among other things, the perils of being too lean. Understaffing creates waste: When there aren’t enough people to move pallets of groceries from trucks to warehouses, the food spoils. It angers customers: When they can’t get the help they need quickly, they get fed up and take their business elsewhere. It creates inefficiency: Inventory becomes disorganized, making it tougher for workers to find what they need quickly. The work draws from Massachusetts Institute of Technology professor Ton’s research that shows, among other things, the perils of being too lean. Understaffing creates waste: When there aren’t enough people to move pallets of groceries from trucks to warehouses, the food spoils. It angers customers: When they can’t get the help they need quickly, they get fed up and take their business elsewhere. It creates inefficiency: Inventory becomes disorganized, making it tougher for workers to find what they need quickly. In health care, where staffing levels have been a problem for decades, understaffing can be life-threatening. Studies have linked low staff levels in hospitals to worse outcomes for patients — specifically, in a hospital without enough workers, patients are more likely to contract an infection (because of things like decreased handwashing by frazzled staff). They also are less likely to get the right dose of medication and generally more likely to die. Nurses in such hospitals are more prone to feeling burned out and less inclined to recommend their hospital to friends and family who get sick. In health care, where staffing levels have been a problem for decades, understaffing can be life-threatening. Studies have linked low staff levels in hospitals to worse outcomes for patients — specifically, in a hospital without enough workers, patients are more likely to contract an infection (because of things like decreased handwashing by frazzled staff). They also are less likely to get the right dose of medication and generally more likely to die. Nurses in such hospitals are more prone to feeling burned out and less inclined to recommend their hospital to friends and family who get sick. Understaffing isn’t always a result of management short-sightedness. Restaurants, harried workplaces in the best of times, have had to shorten their hours — by about 6.4 hours a week in the US compared with 2019 levels — as the pandemic prompted workers to quit. Understaffing isn’t always a result of management short-sightedness. Restaurants, harried workplaces in the best of times, have had to shorten their hours — by about 6.4 hours a week in the US compared with 2019 levels — as the pandemic prompted workers to quit. Regardless of the cause, acute understaffing has a measurable impact on revenue. On a recent vacation to England, I found my favorite pub closed for two weeks — during a peak season — because they were so shorthanded. Never mind that they had already halved the number of diners they were serving. At another eatery, a full-page, single-spaced manifesto posted by the bathroom explained that they had had to stop offering hot food and table service due to a “very difficult staffing situation\" intensified by the area’s “lack of affordable [or any] housing.\" Regardless of the cause, acute understaffing has a measurable impact on revenue. On a recent vacation to England, I found my favorite pub closed for two weeks — during a peak season — because they were so shorthanded. Never mind that they had already halved the number of diners they were serving. At another eatery, a full-page, single-spaced manifesto posted by the bathroom explained that they had had to stop offering hot food and table service due to a “very difficult staffing situation\" intensified by the area’s “lack of affordable [or any] housing.\" The anonymous writer’s stress was palpable. No wonder a pandemic-era study of restaurant workers found a link between being spread too thin and higher levels of heavy drinking.  The anonymous writer’s stress was palpable. No wonder a pandemic-era study of restaurant workers found a link between being spread too thin and higher levels of heavy drinking.  Workers can put up with such conditions for only so long. Just look at the strikes we have seen lately by nurses, railroad workers, teachers and baristas. Chief among their demands: Hire more people. Workers can put up with such conditions for only so long. Just look at the strikes we have seen lately by nurses, railroad workers, teachers and baristas. Chief among their demands: Hire more people. Some bosses doubtless see it differently. They might feel that these workers are just lazy — that “no one wants to work\" as the management scholar Kim Kardashian once put it. That’s a managerial complaint as old as work itself. Some bosses doubtless see it differently. They might feel that these workers are just lazy — that “no one wants to work\" as the management scholar Kim Kardashian once put it. That’s a managerial complaint as old as work itself. I’m willing to concede the existence of some degree of human laziness. (This is why we invented the remote control, not to mention the bluetooth-enabled electric kettle.) And there are risks to being overstaffed. Workers may feel bored and unchallenged, picking up paychecks but not really engaging. In 2022, we called this “quiet quitting.\" In the 20th century, scholars termed it “social loafing.\" I’m willing to concede the existence of some degree of human laziness. (This is why we invented the remote control, not to mention the bluetooth-enabled electric kettle.) And there are risks to being overstaffed. Workers may feel bored and unchallenged, picking up paychecks but not really engaging. In 2022, we called this “quiet quitting.\" In the 20th century, scholars termed it “social loafing.\" Mild understaffing can keep staff focused and motivated, allowing employees to use a wider variety of skills (something most people find satisfying). But many sectors have gone far beyond being a little shorthanded — and have for a long time. Mild understaffing can keep staff focused and motivated, allowing employees to use a wider variety of skills (something most people find satisfying). But many sectors have gone far beyond being a little shorthanded — and have for a long time. Chronic understaffing hurts motivation and, of course, performance. Overstretched staff make mistakes. They disengage. Employees reason that if the company doesn’t care enough about its future to hire more people, why should they? They’ve essentially been set up to fail — and no one enjoys feeling incompetent. Chronic understaffing hurts motivation and, of course, performance. Overstretched staff make mistakes. They disengage. Employees reason that if the company doesn’t care enough about its future to hire more people, why should they? They’ve essentially been set up to fail — and no one enjoys feeling incompetent. At some point, the work just can’t get done, which weighs on the broader economy. There are still 90,000 fewer childcare workers in the US than there were pre-pandemic (when there already weren’t enough), making it tougher for parents to take on paid work. A dockworker shortage has contributed to clogged ports and snarled supply chains. A dearth of transit workers is a drag on cities trying to convince remote workers to start commuting again. At some point, the work just can’t get done, which weighs on the broader economy. There are still 90,000 fewer childcare workers in the US than there were pre-pandemic (when there already weren’t enough), making it tougher for parents to take on paid work. A dockworker shortage has contributed to clogged ports and snarled supply chains. A dearth of transit workers is a drag on cities trying to convince remote workers to start commuting again. That shared pain is worth remembering as companies seek to “right-size\" their staff levels. Demand for their services may have slowed, but if they cut too many jobs, it’s not only their remaining workers who will pay the price. It’s all of us. That shared pain is worth remembering as companies seek to “right-size\" their staff levels. Demand for their services may have slowed, but if they cut too many jobs, it’s not only their remaining workers who will pay the price. It’s all of us. This story has been published from a wire agency feed without modifications to the text.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/amazon-facing-questions-over-workplacesafety-also-probed-on-bank-dealings\/amp-11674394296279.html","pub_date":"2023-01-22T19:11:10+05:30","title":"Amazon, facing questions over workplacesafety, also probed on bank dealings","keywords":"Amazon,workplace safety,bank dealings,labor law,labor department,financial institutions,ecommerce,online Retail","articles":"The US Attorney is looking into whether what Amazon told lenders about labor law compliance might have defrauded them, applying a law originally aimed at the savings-and-loan industry  The US government is looking into whether Amazon.com Inc. might have misled lenders about its workplace safety record to obtain credit, using a law stemming from the savings-and-loan crisis in a legal move a lawyer for the company called “unprecedented.\"  The US government is looking into whether Amazon.com Inc. might have misled lenders about its workplace safety record to obtain credit, using a law stemming from the savings-and-loan crisis in a legal move a lawyer for the company called “unprecedented.\"  The Manhattan U.S. Attorney’s Office is conducting an investigation into Amazon under the Financial Institutions Reform, Recovery and Enforcement Act, a law that allows civil cases to be brought over wrongdoing that impacts banks. The office has deployed the 1989 law at the same time the Labor Department presses a workplace safety investigation of Amazon that has already led to several citations.  The Manhattan U.S. Attorney’s Office is conducting an investigation into Amazon under the Financial Institutions Reform, Recovery and Enforcement Act, a law that allows civil cases to be brought over wrongdoing that impacts banks. The office has deployed the 1989 law at the same time the Labor Department presses a workplace safety investigation of Amazon that has already led to several citations.  The Labor Department in December cited Amazon at six of its warehouses for not adequately reporting injuries and this week cited three company facilities, saying workers were exposed to ergonomic or equipment hazards.  Amazon has said it intends to appeal the citations. The company also said it never intentionally misrepresented its safety record.  Because Firrea cases proceed under civil law the government can more easily prove claims than in a criminal prosecution, which requires juries to be convinced of charges beyond a reasonable doubt.MINT PREMIUMSee All\n  The U.S. Attorney’s Office in Manhattan issued a subpoena in August to Amazon for information the company might have shared with financial institutions involved in at least $90 million in contracts or agreements with the online retailer in the previous five years, specifically information it shared on its injury rates and labor law compliance. An Amazon unit last month challenged the subpoena and related subpoenas in federal court in Seattle. “It is difficult to understand how a safety inquiry could plausibly be shoehorned into a Firrea investigation,\" Zainab Ahmad, a partner at outside counsel Gibson, Dunn & Crutcher LLP, wrote in a letter to government lawyers that is included with court papers. “Firrea addresses financial fraud, not employee safety,\" Ms. Ahmad added, calling the U.S. Attorney’s Office’s legal theory “extremely tenuous\" and “unprecedented.\" The office is seeking a range of documents on Amazon’s labor practices, including internal communications touching on policies around workplace productivity. The office also wants video surveillance footage of Amazon facilities and has served subpoenas to take testimony from Amazon employees, including high-level executives, according to Ms. Ahmad. Amazon in court papers in the case in Seattle said the information demands are “unrealistic\" and the U.S. Attorney’s Office stretched to assert jurisdiction under Firrea. While the law was meant to target insiders who looted savings-and-loan institutions, it has been applied in novel ways by government lawyers, said Robert Giuffra, a partner at the law firm Sullivan & Cromwell LLP who has worked on Firrea-related litigation. “The Justice Department has a history of misusing the Firrea statute and stretching it far beyond its intended purposes,\" he added. Firrea emerged as a “superweapon\" for the U.S. Justice Department following the 2008 financial crisis, when it was used to bring cases against banks themselves, said Brian Feldman, a lawyer formerly with the civil fraud unit of the U.S. Attorney’s Office in Manhattan who now is in private practice at Harter Secrest & Emery LLP. Mr. Feldman, who worked on Firrea-related cases during his time in the office, said that while the Amazon case involves a “novel set of circumstances,\" Firrea is written to allow the government to tackle a variety of fraud affecting banks. Any fraud case against Amazon would turn on whether the company had made misrepresentations to lenders and whether those misrepresentations impacted their decision-making, he said. A spokesman for the U.S. Attorney’s Office in Manhattan didn’t respond to a request for information on the identities of the financial institutions whose dealings with Amazon are under scrutiny.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/tata-communications-q3-preview-overall-revenue-to-recover-pat-to-decline\/amp-11674392693062.html","pub_date":"2023-01-22T18:38:36+05:30","title":"Tata Communications Q3 preview: Overall revenue to recover,  PAT to decline","keywords":"tata communications,tata communications share price target 2023,tata communications q3 preview","articles":"Tata Communications is expected to post recovery in its revenue 7.5 per cent year-on-year and 1.5 per cent quarter-on-quarter to  ₹4,497.4 crore, albeit normalising of costs      Telecom firm Tata Communications is expected to post recovery in revnue aided by data revenue which expected to grow. Tata Communication wil post its December quarter results on 23 jaunuary, 2023. Telecom firm Tata Communications is expected to post recovery in revnue aided by data revenue which expected to grow. Tata Communication wil post its December quarter results on 23 jaunuary, 2023. Tata Communications is expected to post recovery in its revenue 7.5 per cent year-on-year and 1.5 per cent quarter-on-quarter to  ₹4,497.4 crore, albeit normalising of costs will lead to margins decline said ICICI Direct in its brokerage report. Tata Communications is expected to post recovery in its revenue 7.5 per cent year-on-year and 1.5 per cent quarter-on-quarter to  ₹4,497.4 crore, albeit normalising of costs will lead to margins decline said ICICI Direct in its brokerage report. However, profit after tax (PAT) is expected to decline by 3.9 per cent year-on-year and 28.6 per cent quarter-on-quarter to  ₹380 crore in December 2022 quarter. However, profit after tax (PAT) is expected to decline by 3.9 per cent year-on-year and 28.6 per cent quarter-on-quarter to  ₹380 crore in December 2022 quarter. The data revenue is expected to grow 10.3 per cent year-on-year and 2.1 per cent quarter-on-quarter at  ₹2565 crore. While the overall Overall margins are expected at 24.9%, down 60 bps QoQ, 100 bps YoY. The data revenue is expected to grow 10.3 per cent year-on-year and 2.1 per cent quarter-on-quarter at  ₹2565 crore. While the overall Overall margins are expected at 24.9%, down 60 bps QoQ, 100 bps YoY. The firm is expected to post an EBITDA of  ₹1,119.9 crore up by 3.5 per cent YoY while it could decline by 0.9%. The firm is expected to post an EBITDA of  ₹1,119.9 crore up by 3.5 per cent YoY while it could decline by 0.9%. \"For Tata Communications (TCom), we expect gradual revenue growth recovery to continue, albeit normalising of costs will lead to margins decline QoQ and YoY. The data revenue is expected to grow 2.1% QoQ (up ~10.3% YoY) at  ₹3565 crore. The voice revenues are anticipated to continue to remain weak, down 4.7% QoQ (10 % YoY decline) at  ₹500 crore. The overall revenue is expected to grow 1.5% QoQ (7.5% YoY) at  ₹4497 crore. Data segment margins are expected at 29% (flattish QoQ). Overall margins are expected at 24.9%, down 60 bps QoQ and down 100 bps YoY. Key monitorable : Growth outlook commentary,\" said ICICI Direct brokerage report. \"For Tata Communications (TCom), we expect gradual revenue growth recovery to continue, albeit normalising of costs will lead to margins decline QoQ and YoY. The data revenue is expected to grow 2.1% QoQ (up ~10.3% YoY) at  ₹3565 crore. The voice revenues are anticipated to continue to remain weak, down 4.7% QoQ (10 % YoY decline) at  ₹500 crore. The overall revenue is expected to grow 1.5% QoQ (7.5% YoY) at  ₹4497 crore. Data segment margins are expected at 29% (flattish QoQ). Overall margins are expected at 24.9%, down 60 bps QoQ and down 100 bps YoY. Key monitorable : Growth outlook commentary,\" said ICICI Direct brokerage report. Tata Communications net consolidated profit fell by 2.1% to  ₹532.29 crore in Q2 from  ₹543.36 crore in Q1. The company's consolidated revenue from operations reduced to  ₹4,467 crore in the quarter under review. On Friday, the company's scrip was down by 2.04 per cent to  ₹1,342.55 at BSE. Tata Communications net consolidated profit fell by 2.1% to  ₹532.29 crore in Q2 from  ₹543.36 crore in Q1. The company's consolidated revenue from operations reduced to  ₹4,467 crore in the quarter under review. On Friday, the company's scrip was down by 2.04 per cent to  ₹1,342.55 at BSE.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/abbott-under-federal-criminal-investigation-over-baby-formula\/amp-11674388752851.html","pub_date":"2023-01-22T17:35:13+05:30","title":"Abbott under federal criminal investigation over baby formula","keywords":"Abbott Laboratories,baby formula,federal criminal investigation,Abbott Michigan plant,consumer-protection,contaminated food,Food and Drug Administration","articles":"Michigan plant at center of probe was temporarily closed by the company last year after potentially deadly bacteria was found  The Justice Department is investigating conduct at the Abbott Laboratories infant-formula plant in Sturgis, Mich., that led to its shutdown last year and worsened a nationwide formula shortage, people familiar with the matter said.  The Justice Department is investigating conduct at the Abbott Laboratories infant-formula plant in Sturgis, Mich., that led to its shutdown last year and worsened a nationwide formula shortage, people familiar with the matter said.  Attorneys with the Justice Department’s consumer-protection branch are conducting the criminal investigation, the people said.  Attorneys with the Justice Department’s consumer-protection branch are conducting the criminal investigation, the people said.  The branch, which has criminal as well as civil authority, was involved last year in a settlement with Abbott that allowed its Sturgis plant to resume operations after Food and Drug Administration inspectors found a potentially deadly bacteria there.  “The DOJ has informed us of its investigation, and we’re cooperating fully,\" an Abbott spokesman said.  The investigation signals further scrutiny of Abbott’s operation of the plant, a major source of baby formula in the U.S., and perhaps of the more than $4 billion formula industry.  The Justice Department in the past decade has investigated numerous food companies that have shipped contaminated products that resulted in illnesses or deaths.  Several have led to criminal prosecutions under the 1938 Federal Food, Drug and Cosmetic Act of companies or executives involved in producing goods from ice cream to peanut butter. The law allows government officials to prosecute entities or individuals who introduce adulterated food into interstate commerce.  In many recent cases, DOJ has been able to successfully prosecute defendants on misdemeanor charges for introducing contaminated food into the market even without proof that officials acted with criminal intent, according to Bill Marler, a Seattle lawyer who represents victims of food-borne illnesses.MINT PREMIUMSee All\n  Abbott, based outside Chicago, is one of the biggest manufacturers of baby formula. The company sells Similac, among other brands. Last January, FDA inspectors found bacteria at the plant after receiving reports of babies who drank the company’s formula and became sick. The inspectors also found standing water, damage to drying equipment and defects in the seams of formula cans, among other problems at the Sturgis plant. Federal officials couldn’t conclusively link the bacteria at the plant to the infants’ illnesses, however. Abbott has said genetic sequencing of the bacteria in the sick babies didn’t match the strains found at the plant. Abbott temporarily halted production at the Sturgis factory in February, and recalled baby formula made at the plant. The moves contributed to an infant formula shortage that sent parents and federal officials scrambling for months. To bolster supplies, the federal government waived regulatory requirements and tariffs to allow more foreign formula into the country, and the White House organized planes to fly baby formula to the U.S. Abbott last May signed a legal agreement, called a consent decree, detailing the steps it would need to take to reopen the plant. In the complaint accompanying that civil agreement, the Justice Department said Abbott and several of its employees had caused “adulterated food\" to enter interstate commerce. “Ongoing inadequacies in manufacturing conditions and practices at Defendants’ facilities demonstrate that Defendants have been unwilling or unable to implement sustainable corrective actions to ensure the safety and quality of food manufactured for infants, a consumer group particularly vulnerable to foodborne pathogens,\" the department said in the complaint. Also in May, Abbott Chief Executive Robert Ford apologized for the company’s role in the formula shortage, and said it was making investments to avoid a repeat. The company reopened the plant in June. Limited formula supplies continued into September, however, when adults in roughly one-third of households with infant children on formula had trouble getting it, according U.S. Census Bureau data. By October, in-stock rates had stabilized close to where they had been before the Sturgis plant shut down, federal officials have said. In 2020, the Justice Department filed criminal charges against Texas ice-cream company Blue Bell Creameries LP and its former chief executive following an investigation into a listeria outbreak tied to three deaths and other illnesses. Blue Bell agreed to pay $19 million and plead guilty to two misdemeanor charges related to shipments of contaminated ice cream. The former chief executive has pleaded not guilty to the charges. That same year, Chipotle Mexican Grill Inc. said it would pay a record $25 million to resolve criminal charges stemming from a series of foodborne-illness outbreaks involving its restaurants that sickened more than 1,000 people. In 2015, Stewart Parnell, the former owner of Peanut Corp. of America, was sentenced to 28 years in prison a year after being convicted of presiding over a coverup that led to a deadly salmonella outbreak.  ","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/axis-bank-q3-preview-pat-likely-to-see-strong-yoy-growth-progress-on-citi-deal-among-key-factors-to-watch\/amp-11674387380488.html","pub_date":"2023-01-22T17:11:59+05:30","title":"Axis Bank Q3 preview: PAT likely to see strong YoY growth; progress on Citi deal among key factors to watch","keywords":"Axis Bank Q3 results,Axis Bank Q3 preview,Axis Bank Q3 earnings,Axis Bank share price,Axis Bank Q3 net profit,Axis Bank Q3 NET INTEREST INCOME,Axis Bank Q3 gross NPA,Axis Bank Q3 asset quality,Axis Bank Citi deal,Axis Bank Q3 provisions,Axis Bank Q3 expectations","articles":"During the second quarter, Axis Bank posted a net profit of  ₹5,330 crore up by 70% YoY, and net interest income (NII) of  ₹10,360 crore surging by 31% YoY.  Private lender Axis Bank is set to announce its financial results for the third quarter of FY23 on Monday. The bank's stock will be in focus accordingly. Axis Bank is likely to report robust YoY growth in both the bottom-line and top-line front coupled with margins to improve furthermore. Among key factors to watch would be the bank's comments on the progress of Citi deal. Private lender Axis Bank is set to announce its financial results for the third quarter of FY23 on Monday. The bank's stock will be in focus accordingly. Axis Bank is likely to report robust YoY growth in both the bottom-line and top-line front coupled with margins to improve furthermore. Among key factors to watch would be the bank's comments on the progress of Citi deal. During the second quarter, Axis Bank posted a net profit of  ₹5,330 crore up by 70% YoY, and net interest income (NII) of  ₹10,360 crore surging by 31% YoY. Net interest margin (NIM) for Q2FY23 came at 3.96%, up 57 YOY and 36 QOQ. Provisions dropped to  ₹550 crore, as against  ₹1,735 crore a year ago. Meanwhile, asset quality improved with the gross non-performing asset ratio declining to 2.5% as of 30 September 2022, from 2.76% a quarter ago and 3.53% a year ago. During the second quarter, Axis Bank posted a net profit of  ₹5,330 crore up by 70% YoY, and net interest income (NII) of  ₹10,360 crore surging by 31% YoY. Net interest margin (NIM) for Q2FY23 came at 3.96%, up 57 YOY and 36 QOQ. Provisions dropped to  ₹550 crore, as against  ₹1,735 crore a year ago. Meanwhile, asset quality improved with the gross non-performing asset ratio declining to 2.5% as of 30 September 2022, from 2.76% a quarter ago and 3.53% a year ago. Last week, on Friday, Axis Bank shares closed at  ₹930.70 apiece on BSE marginally up from the previous session. Its market cap is over  ₹2.86 lakh crore. Last week, on Friday, Axis Bank shares closed at  ₹930.70 apiece on BSE marginally up from the previous session. Its market cap is over  ₹2.86 lakh crore. Axis Bank Q3 preview: Axis Bank Q3 preview: In its preview note, ICICI Direct expects Axis Bank to post advance growth of 15.7% YoY, 5.2% QoQ to  ₹7.68 lakh crore while deposits are expected to grow 9.1% YoY, 3.8% QoQ to  ₹8.41 lakh crore wherein CASA should remain steady at ~46%. Net interest income is likely to grow 24.4% YoY, 3.9% QoQ to  ₹10765 crore while NIMs may see improvement at ~4%. CI ratio to be at ~47% vs. ~50% in Q3FY22. On a sequential basis, provisions are expected to go up to  ₹692 crore versus  ₹550 crore. The brokerage added, \"We expect PAT to register growth of 50% YoY at  ₹5,444 crore. Asset quality is likely to improve in Q3FY23 with GNPA ratio at 2.4%, led by lower slippages and healthy recoveries.\" In its preview note, ICICI Direct expects Axis Bank to post advance growth of 15.7% YoY, 5.2% QoQ to  ₹7.68 lakh crore while deposits are expected to grow 9.1% YoY, 3.8% QoQ to  ₹8.41 lakh crore wherein CASA should remain steady at ~46%. Net interest income is likely to grow 24.4% YoY, 3.9% QoQ to  ₹10765 crore while NIMs may see improvement at ~4%. CI ratio to be at ~47% vs. ~50% in Q3FY22. On a sequential basis, provisions are expected to go up to  ₹692 crore versus  ₹550 crore. The brokerage added, \"We expect PAT to register growth of 50% YoY at  ₹5,444 crore. Asset quality is likely to improve in Q3FY23 with GNPA ratio at 2.4%, led by lower slippages and healthy recoveries.\" Meanwhile, Kotak Institutional Equities expects Axis Bank's loan growth at 15% yoy (~6% qoq) with a greater focus on retail and SME. NIM should be stable qoq with marginal upward bias driven stronger loan re-pricing as compared to deposits. Operating profit to grow at ~30% yoy led by normalisation of operating expenses. Meanwhile, Kotak Institutional Equities expects Axis Bank's loan growth at 15% yoy (~6% qoq) with a greater focus on retail and SME. NIM should be stable qoq with marginal upward bias driven stronger loan re-pricing as compared to deposits. Operating profit to grow at ~30% yoy led by normalisation of operating expenses. Further, Kotak's note said, \"We expect slippages of ~Rs35 bn (~2% of loans) mostly led by small ticket loans. Expect strong commentary on asset quality performance and we see an improvement in NPL ratios aided by stronger recovery\/upgradations. Provisions are mainly to reduce net NPL ratios. Progress of the Citi portfolio and direction of operating profit growth will be a key discussion area for the quarter.\" Further, Kotak's note said, \"We expect slippages of ~Rs35 bn (~2% of loans) mostly led by small ticket loans. Expect strong commentary on asset quality performance and we see an improvement in NPL ratios aided by stronger recovery\/upgradations. Provisions are mainly to reduce net NPL ratios. Progress of the Citi portfolio and direction of operating profit growth will be a key discussion area for the quarter.\" Axis Bank has inked a deal with Citi Group to acquire Citibank’s consumer businesses in India for  ₹12,325 crore. Citi's consumer businesses include covering loans, credit cards, wealth management, and retail banking operations in India. Through the acquisition, Axis Bank will gain access to the large and affluent customer franchise of Citibank having a bouquet of fee-oriented and profitable segments, that include a quality credit card portfolio, affluent wealth management clientele, and meaningful deposits with a strong consumer lending portfolio. However, Axis Bank earlier mentioned that the deal is expected to close by March 2023. However, in December last year, it was known that the deal may get pushed further to May. Axis Bank has inked a deal with Citi Group to acquire Citibank’s consumer businesses in India for  ₹12,325 crore. Citi's consumer businesses include covering loans, credit cards, wealth management, and retail banking operations in India. Through the acquisition, Axis Bank will gain access to the large and affluent customer franchise of Citibank having a bouquet of fee-oriented and profitable segments, that include a quality credit card portfolio, affluent wealth management clientele, and meaningful deposits with a strong consumer lending portfolio. However, Axis Bank earlier mentioned that the deal is expected to close by March 2023. However, in December last year, it was known that the deal may get pushed further to May. Thereby, some limelight on the progress of the Citi deal will be expected in the Q3 conference. Thereby, some limelight on the progress of the Citi deal will be expected in the Q3 conference. Also, Emkay Global's note said, \"Axis Bank reported strong core profit growth on the back of robust margin expansion and contained opex, partly offset by subdued treasury performance. This coupled with continued lower LLP led to a beat on PAT.\" Also, Emkay Global's note said, \"Axis Bank reported strong core profit growth on the back of robust margin expansion and contained opex, partly offset by subdued treasury performance. This coupled with continued lower LLP led to a beat on PAT.\"     Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions. Disclaimer: The views and recommendations made above are those of individual analysts or broking companies, and not of Mint. We advise investors to check with certified experts before taking any investment decisions.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/how-apple-has-so-far-avoided-layoffs\/amp-11674362598525.html","pub_date":"2023-01-22T10:46:46+05:30","title":"How Apple has so far avoided layoffs","keywords":"Apple,Layoffs at Apple,Google,Meta,Tech Layoffs,Tech Layoffs latest news","articles":"The iPhone maker’s workforce grew 20% in the past three years, a far slower pace than rivals  Layoffs have hit the tech industry hard—except at Apple Inc. Layoffs have hit the tech industry hard—except at Apple Inc. The world’s largest company has so far avoided the job cuts rippling through peers including Microsoft Corp., Google, Meta Platforms Inc. and Amazon.com Inc. The world’s largest company has so far avoided the job cuts rippling through peers including Microsoft Corp., Google, Meta Platforms Inc. and Amazon.com Inc. No company is certain to avoid significant cutbacks in an economic environment as volatile as the current one, and Apple isn’t immune to the business challenges that have hit other tech giants. It is expected next month to report its first quarterly sales decline in more than three years. Apple has also slowed hiring in some areas. No company is certain to avoid significant cutbacks in an economic environment as volatile as the current one, and Apple isn’t immune to the business challenges that have hit other tech giants. It is expected next month to report its first quarterly sales decline in more than three years. Apple has also slowed hiring in some areas. But the iPhone maker has been better positioned than many rivals to date in part because it added employees at a much slower clip than those companies during the pandemic. It also tends to run lean, with limited employee perks and businesses focused on hardware products and sales that have so far largely dodged the economic downturn, investors say. But the iPhone maker has been better positioned than many rivals to date in part because it added employees at a much slower clip than those companies during the pandemic. It also tends to run lean, with limited employee perks and businesses focused on hardware products and sales that have so far largely dodged the economic downturn, investors say. An Apple spokesman declined to comment. An Apple spokesman declined to comment. From its fiscal year-end in September 2019 to September 2022, Apple’s workforce grew by about 20% to approximately 164,000 full-time employees. Meanwhile, over roughly the same period, the employee count at Amazon doubled, Microsoft’s rose 53%, Google parent Alphabet Inc.’s increased 57% and Facebook owner Meta’s ballooned 94%. From its fiscal year-end in September 2019 to September 2022, Apple’s workforce grew by about 20% to approximately 164,000 full-time employees. Meanwhile, over roughly the same period, the employee count at Amazon doubled, Microsoft’s rose 53%, Google parent Alphabet Inc.’s increased 57% and Facebook owner Meta’s ballooned 94%. Apple has about 65,000 retail employees working in more than 500 stores who make up roughly 40% of the company’s total workforce. Apple has about 65,000 retail employees working in more than 500 stores who make up roughly 40% of the company’s total workforce. On Friday, Alphabet became the latest tech company to announce widespread layoffs, with a plan to eliminate roughly 12,000 jobs, the company’s largest-ever round of job cuts. On Friday, Alphabet became the latest tech company to announce widespread layoffs, with a plan to eliminate roughly 12,000 jobs, the company’s largest-ever round of job cuts. Alphabet’s cut follows a wave of large layoffs at Amazon, Microsoft and Meta. The tech industry has seen more than 200,000 layoffs since the start of 2022, according to Layoffs.fyi, a website that tracks cuts in the sector as they surface in media reports and company releases. Alphabet’s cut follows a wave of large layoffs at Amazon, Microsoft and Meta. The tech industry has seen more than 200,000 layoffs since the start of 2022, according to Layoffs.fyi, a website that tracks cuts in the sector as they surface in media reports and company releases. The last big round of layoffs at Apple happened way back in 1997, when co-founder Steve Jobs returned to the company, which then cut costs by firing 4,100 employees. The last big round of layoffs at Apple happened way back in 1997, when co-founder Steve Jobs returned to the company, which then cut costs by firing 4,100 employees. So far, Apple’s core business has shown itself to be resilient against broader downturns in the market. The other four tech giants have suffered amid slowdowns in digital advertising, e-commerce and PCs. In its September quarter, Apple reported that sales at its most important business—the iPhone—advanced 9.7% from the previous year to $42.6 billion, surpassing analyst estimates. So far, Apple’s core business has shown itself to be resilient against broader downturns in the market. The other four tech giants have suffered amid slowdowns in digital advertising, e-commerce and PCs. In its September quarter, Apple reported that sales at its most important business—the iPhone—advanced 9.7% from the previous year to $42.6 billion, surpassing analyst estimates. Apple may face a rougher December quarter, which it is scheduled to report on Feb. 2, as the company encountered manufacturing challenges in China, where strict zero-Covid policies damped much economic activity. Many analysts expect that demand hasn’t subsided for its iPhones and as the company continues to ramp back up manufacturing, demand is anticipated to move to the March quarter. Apple may face a rougher December quarter, which it is scheduled to report on Feb. 2, as the company encountered manufacturing challenges in China, where strict zero-Covid policies damped much economic activity. Many analysts expect that demand hasn’t subsided for its iPhones and as the company continues to ramp back up manufacturing, demand is anticipated to move to the March quarter. The company’s business model hasn’t been totally immune to broader slowdowns. Revenue from its services business continued to slow, growing 5% annually to $19.2 billion in the September quarter, shy of the gains posted in recent quarters. The company’s business model hasn’t been totally immune to broader slowdowns. Revenue from its services business continued to slow, growing 5% annually to $19.2 billion in the September quarter, shy of the gains posted in recent quarters. Tom Forte, senior research analyst at investment bank D.A. Davidson & Co., said he expects Apple to reduce head count, but it might do that quietly through employee attrition—by not replacing workers who leave. The company could move in the direction of making other cuts or adjustments to perks that are common in Silicon Valley. Apple doesn’t offer free lunches to employees on its corporate campus, unlike other big tech companies such as Google and Meta. Tom Forte, senior research analyst at investment bank D.A. Davidson & Co., said he expects Apple to reduce head count, but it might do that quietly through employee attrition—by not replacing workers who leave. The company could move in the direction of making other cuts or adjustments to perks that are common in Silicon Valley. Apple doesn’t offer free lunches to employees on its corporate campus, unlike other big tech companies such as Google and Meta. Some of the tech giants cutting jobs have spent heavily on projects that are unlikely to turn into strong businesses anytime soon, said Daniel Morgan, a senior portfolio manager at Synovus Trust Co., which counts Apple among its largest holdings. “Both Meta and Google are terribly guilty of that,\" he said. Some of the tech giants cutting jobs have spent heavily on projects that are unlikely to turn into strong businesses anytime soon, said Daniel Morgan, a senior portfolio manager at Synovus Trust Co., which counts Apple among its largest holdings. “Both Meta and Google are terribly guilty of that,\" he said. Meta has been pouring billions of dollars into its Reality Labs for its new ambitions in the so-called metaverse. Meta Chief Executive Mark Zuckerberg has defended the company’s spending on Reality Labs, suggesting that virtual reality will become an important technological platform. Meta has been pouring billions of dollars into its Reality Labs for its new ambitions in the so-called metaverse. Meta Chief Executive Mark Zuckerberg has defended the company’s spending on Reality Labs, suggesting that virtual reality will become an important technological platform. After announcing the layoffs, Alphabet Chief Executive Sundar Pichai said the company had seen dramatic periods of growth during the past two years. “To match and fuel that growth, we hired for a different economic reality than the one we face today,\" he wrote in a message to employees on Friday. After announcing the layoffs, Alphabet Chief Executive Sundar Pichai said the company had seen dramatic periods of growth during the past two years. “To match and fuel that growth, we hired for a different economic reality than the one we face today,\" he wrote in a message to employees on Friday. Apple also is working on risky future bets, such as an augmented-reality headset due out later this year and a car project whose release date is uncertain, but at a more measured pace. Apple also is working on risky future bets, such as an augmented-reality headset due out later this year and a car project whose release date is uncertain, but at a more measured pace.","scraped_date":"2023-01-24"}
{"news_link":"https:\/\/www.livemint.com\/companies\/news\/microsoft-kicks-off-tech-earnings-set-to-slump-most-since-2016\/amp-11674346182457.html","pub_date":"2023-01-22T05:46:21+05:30","title":"Microsoft kicks off tech earnings set to slump most since 2016","keywords":"Microsoft,tech companies,Nasdaq,US tech firms,stock market,Wall street,Google,Alphabet Inc,S&amp;P 500 profits","articles":"The tech-heavy Nasdaq 100 Stock Index enters this crucial stretch amid a darkening backdrop that short-circuited a strong start to the year  US technology stocks are about to hit their next hurdle when earnings season for the most influential segment of the S&P 500 Index gets underway in the coming week: vanishing profits. US technology stocks are about to hit their next hurdle when earnings season for the most influential segment of the S&P 500 Index gets underway in the coming week: vanishing profits. The tech-heavy Nasdaq 100 Stock Index enters this crucial stretch amid a darkening backdrop that short-circuited a strong start to the year. Underscoring the risks ahead, Microsoft Corp., which kicks off the group’s reporting Tuesday, joined Amazon. com Inc. in starting to cut thousands of jobs this week as sales slow. Google parent Alphabet Inc. followed with plans of its own to shrink its workforce. The tech-heavy Nasdaq 100 Stock Index enters this crucial stretch amid a darkening backdrop that short-circuited a strong start to the year. Underscoring the risks ahead, Microsoft Corp., which kicks off the group’s reporting Tuesday, joined Amazon. com Inc. in starting to cut thousands of jobs this week as sales slow. Google parent Alphabet Inc. followed with plans of its own to shrink its workforce. Wall Street has been slashing earnings estimates for months for the tech sector, which is projected to be the biggest drag on S&P 500 profits in the fourth quarter, data compiled by Bloomberg Intelligence show. The danger for investors, however, is that analysts still prove too optimistic, with demand for the industry’s products crumbling as the economy cools. “Tech is driving a lot of the overall earnings recession that we’re seeing in the S&P,\" said Michael Casper, an equity strategist with Bloomberg Intelligence. “While there’s a lot baked in, depending on if this recession does emerge and how badly it occurs, there is certainly some negative revision risk for the sector still.\" Firms including Texas Instruments Inc., Lam Research Corp. and Intel Corp. also report next week. Apple Inc., Alphabet and other behemoths announce the week after. The group has huge sway over the path of the overall market, with info-tech accounting for more than 25% of the S&P 500’s market capitalization. Fourth-quarter earnings for tech firms in the benchmark are projected to drop 9.2% from the same period a year earlier, the steepest slide since 2016, data compiled by BI show. The speed of the deterioration in sentiment is notable: Three months ago, Wall Street merely saw profits coming in flat. Revenue growth for these companies is fading relative to the past couple of years, when the pandemic and ensuing lockdowns supercharged sales for everything from digital services to personal computers and the components that power them. Higher costs are also squeezing profits. Valuation Concerns The concern, however, is that valuations are still far from cheap despite last year’s 33% tumble in the Nasdaq 100. The gauge is priced at about 21 times profits projected over the next 12 months, compared with an average of 20.5 for the past decade, and further estimate cuts would only make it look more expensive. The multiple bottomed at 17.7 in 2020 and at 11.3 in 2011, in the wake of the recession that ended in 2009. Still, for Sameer Bhasin, principal at Value Point Capital, most of the bad news has been priced in. He anticipates that first-quarter profit estimates may have further to fall, but says some of the fears are overblown. “Tech isn’t suffering from an industry demand issue, it’s suffering more from a digestion of the excesses that were built in during the pandemic,\" he said. “There’s money on the sidelines that is waiting to be put back into the sector.\" Analysts anticipate that tech profits will return to growth in the second half of the year, data compiled by BI show. That will make executives’ outlooks for the full year all the more critical for stocks. As earnings roll in over the next few weeks, investors will have plenty of risks to monitor. Among them are the possibility that inflation proves to be more entrenched than many expect, as well as the effect of higher rates on profits, says Nick Getaz, a portfolio manager of the Franklin Rising Dividends Fund. “Monetary policy has a lag and we’re likely still in the window of that,\" he said. “We haven’t seen the earnings impact you’d expect to see from rate hikes.\"   This story has been published from a wire agency feed without modifications to the text.","scraped_date":"2023-01-24"}
